#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Granny

#include "Basic.hpp"

#include "ABP_Granny_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Granny.ABP_Granny_C
// 0x0310 (0x0660 - 0x0350)
class UABP_Granny_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2490[0x8];                                     // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimBlueprintGeneratedMutableData     __AnimBlueprintMutables;                           // 0x0358(0x000C)(HasGetValueTypeHash)
	uint8                                         Pad_2491[0x4];                                     // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0368(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0370(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0378(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0398(0x0128)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x04C0(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x04E0(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x0500(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0570(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x05B8(0x0048)()
	double                                        Speed;                                             // 0x0600(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               TargetHeadRotation;                                // 0x0608(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	double                                        Alpha;                                             // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Viewing;                                           // 0x0628(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2492[0x7];                                     // 0x0629(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                NewVar;                                            // 0x0630(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Granny_C*                           As_BP_Granny;                                      // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          GrannySeeking;                                     // 0x0650(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NoGrannyPawn;                                      // 0x0651(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ABP_Granny(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Granny_AnimGraphNode_ModifyBone_86E3DB2F4284BC3B723062AA44A66D7A();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void BlueprintInitializeAnimation();
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Granny_C">();
	}
	static class UABP_Granny_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Granny_C>();
	}
};
static_assert(alignof(UABP_Granny_C) == 0x000010, "Wrong alignment on UABP_Granny_C");
static_assert(sizeof(UABP_Granny_C) == 0x000660, "Wrong size on UABP_Granny_C");
static_assert(offsetof(UABP_Granny_C, UberGraphFrame) == 0x000350, "Member 'UABP_Granny_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Granny_C, __AnimBlueprintMutables) == 0x000358, "Member 'UABP_Granny_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UABP_Granny_C, AnimBlueprintExtension_PropertyAccess) == 0x000368, "Member 'UABP_Granny_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_Granny_C, AnimBlueprintExtension_Base) == 0x000370, "Member 'UABP_Granny_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_Granny_C, AnimGraphNode_Root) == 0x000378, "Member 'UABP_Granny_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Granny_C, AnimGraphNode_ModifyBone) == 0x000398, "Member 'UABP_Granny_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UABP_Granny_C, AnimGraphNode_ComponentToLocalSpace) == 0x0004C0, "Member 'UABP_Granny_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_Granny_C, AnimGraphNode_LocalToComponentSpace) == 0x0004E0, "Member 'UABP_Granny_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_Granny_C, AnimGraphNode_BlendSpacePlayer) == 0x000500, "Member 'UABP_Granny_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Granny_C, AnimGraphNode_BlendListByBool) == 0x000570, "Member 'UABP_Granny_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_Granny_C, AnimGraphNode_SequencePlayer) == 0x0005B8, "Member 'UABP_Granny_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Granny_C, Speed) == 0x000600, "Member 'UABP_Granny_C::Speed' has a wrong offset!");
static_assert(offsetof(UABP_Granny_C, TargetHeadRotation) == 0x000608, "Member 'UABP_Granny_C::TargetHeadRotation' has a wrong offset!");
static_assert(offsetof(UABP_Granny_C, Alpha) == 0x000620, "Member 'UABP_Granny_C::Alpha' has a wrong offset!");
static_assert(offsetof(UABP_Granny_C, Viewing) == 0x000628, "Member 'UABP_Granny_C::Viewing' has a wrong offset!");
static_assert(offsetof(UABP_Granny_C, NewVar) == 0x000630, "Member 'UABP_Granny_C::NewVar' has a wrong offset!");
static_assert(offsetof(UABP_Granny_C, As_BP_Granny) == 0x000648, "Member 'UABP_Granny_C::As_BP_Granny' has a wrong offset!");
static_assert(offsetof(UABP_Granny_C, GrannySeeking) == 0x000650, "Member 'UABP_Granny_C::GrannySeeking' has a wrong offset!");
static_assert(offsetof(UABP_Granny_C, NoGrannyPawn) == 0x000651, "Member 'UABP_Granny_C::NoGrannyPawn' has a wrong offset!");

}

