#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Granny

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABP_Granny.ABP_Granny_C.ExecuteUbergraph_ABP_Granny
// 0x0308 (0x0308 - 0x0000)
struct ABP_Granny_C_ExecuteUbergraph_ABP_Granny final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2493[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2494[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2495[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue_1;         // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2496[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2497[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_2;                      // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_2;                     // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_2;                       // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2498[0x4];                                     // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_3;                      // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_3;                     // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_3;                       // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2499[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue_2;         // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_3;                // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ABP_Granny_C*                           K2Node_DynamicCast_AsBP_Granny;                    // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249A[0x7];                                     // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               K2Node_Select_Default_1;                           // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_2;                          // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0270(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue_1;                // 0x0288(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Vector_IsNearlyZero_ReturnValue;          // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AiHasTask_Return;                         // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AiHasTask_Return_1;                       // 0x02AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x02AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249B[0x2];                                     // 0x02AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_StructMemberSet_Alpha_ImplicitCast;         // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249C[0x4];                                     // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeVector_X_ImplicitCast;                // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Y_ImplicitCast;                // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Z_ImplicitCast;                // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast;           // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249D[0x4];                                     // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeVector_X_ImplicitCast_1;              // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Y_ImplicitCast_1;              // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Z_ImplicitCast_1;              // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast_1;          // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast_1;         // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast_1;           // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny) == 0x000008, "Wrong alignment on ABP_Granny_C_ExecuteUbergraph_ABP_Granny");
static_assert(sizeof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny) == 0x000308, "Wrong size on ABP_Granny_C_ExecuteUbergraph_ABP_Granny");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, EntryPoint) == 0x000000, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000008, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_BreakRotator_Roll) == 0x000020, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_BreakRotator_Pitch) == 0x000024, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_BreakRotator_Yaw) == 0x000028, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_MakeRotator_ReturnValue) == 0x000030, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_BreakRotator_Roll_1) == 0x000048, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_BreakRotator_Pitch_1) == 0x00004C, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_BreakRotator_Yaw_1) == 0x000050, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000058, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_MakeVector_ReturnValue) == 0x000070, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_Conv_FloatToVector_ReturnValue_1) == 0x000088, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_Conv_FloatToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_Add_VectorVector_ReturnValue) == 0x0000A0, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, Temp_bool_Variable) == 0x0000B8, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_BreakVector_X) == 0x0000C0, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_BreakVector_Y) == 0x0000C8, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_BreakVector_Z) == 0x0000D0, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, Temp_bool_Variable_1) == 0x0000D8, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_MakeRotator_ReturnValue_1) == 0x0000E0, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_BreakRotator_Roll_2) == 0x0000F8, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_BreakRotator_Roll_2' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_BreakRotator_Pitch_2) == 0x0000FC, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_BreakRotator_Pitch_2' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_BreakRotator_Yaw_2) == 0x000100, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_BreakRotator_Yaw_2' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_MakeRotator_ReturnValue_2) == 0x000108, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, K2Node_Event_DeltaTimeX) == 0x000120, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_BreakRotator_Roll_3) == 0x000124, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_BreakRotator_Roll_3' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_BreakRotator_Pitch_3) == 0x000128, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_BreakRotator_Pitch_3' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_BreakRotator_Yaw_3) == 0x00012C, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_BreakRotator_Yaw_3' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_MakeVector_ReturnValue_1) == 0x000130, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_RandomUnitVector_ReturnValue) == 0x000148, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000160, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000168, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_Conv_FloatToVector_ReturnValue_2) == 0x000180, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_Conv_FloatToVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, K2Node_Select_Default) == 0x000198, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_Multiply_VectorVector_ReturnValue_2) == 0x0001B0, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_Multiply_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0001C8, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_BreakVector_X_1) == 0x0001E0, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_BreakVector_Y_1) == 0x0001E8, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_BreakVector_Z_1) == 0x0001F0, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_TryGetPawnOwner_ReturnValue) == 0x0001F8, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_MakeRotator_ReturnValue_3) == 0x000200, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_MakeRotator_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, K2Node_DynamicCast_AsBP_Granny) == 0x000218, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::K2Node_DynamicCast_AsBP_Granny' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, K2Node_DynamicCast_bSuccess) == 0x000220, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, K2Node_Select_Default_1) == 0x000228, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_GetVelocity_ReturnValue) == 0x000240, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_BreakVector_X_2) == 0x000258, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_BreakVector_Y_2) == 0x000260, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_BreakVector_Z_2) == 0x000268, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_MakeVector_ReturnValue_2) == 0x000270, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_GetVelocity_ReturnValue_1) == 0x000288, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_GetVelocity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_VSize_ReturnValue) == 0x0002A0, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_Vector_IsNearlyZero_ReturnValue) == 0x0002A8, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_Vector_IsNearlyZero_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_AiHasTask_Return) == 0x0002A9, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_AiHasTask_Return' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_AiHasTask_Return_1) == 0x0002AA, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_AiHasTask_Return_1' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_Not_PreBool_ReturnValue) == 0x0002AB, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_BooleanAND_ReturnValue) == 0x0002AC, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_BooleanAND_ReturnValue_1) == 0x0002AD, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, K2Node_StructMemberSet_Alpha_ImplicitCast) == 0x0002B0, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::K2Node_StructMemberSet_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_MakeVector_X_ImplicitCast) == 0x0002B8, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_MakeVector_X_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_MakeVector_Y_ImplicitCast) == 0x0002C0, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_MakeVector_Y_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_MakeVector_Z_ImplicitCast) == 0x0002C8, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_MakeVector_Z_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_MakeRotator_Roll_ImplicitCast) == 0x0002D0, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_MakeRotator_Roll_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_MakeRotator_Pitch_ImplicitCast) == 0x0002D4, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_MakeRotator_Pitch_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x0002D8, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_MakeVector_X_ImplicitCast_1) == 0x0002E0, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_MakeVector_X_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_MakeVector_Y_ImplicitCast_1) == 0x0002E8, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_MakeVector_Y_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_MakeVector_Z_ImplicitCast_1) == 0x0002F0, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_MakeVector_Z_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_MakeRotator_Roll_ImplicitCast_1) == 0x0002F8, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_MakeRotator_Roll_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_MakeRotator_Pitch_ImplicitCast_1) == 0x0002FC, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_MakeRotator_Pitch_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ABP_Granny_C_ExecuteUbergraph_ABP_Granny, CallFunc_MakeRotator_Yaw_ImplicitCast_1) == 0x000300, "Member 'ABP_Granny_C_ExecuteUbergraph_ABP_Granny::CallFunc_MakeRotator_Yaw_ImplicitCast_1' has a wrong offset!");

// Function ABP_Granny.ABP_Granny_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_Granny_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Granny_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_Granny_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_Granny_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_Granny_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_Granny_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_Granny_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_Granny.ABP_Granny_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Granny_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Granny_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Granny_C_AnimGraph");
static_assert(sizeof(ABP_Granny_C_AnimGraph) == 0x000010, "Wrong size on ABP_Granny_C_AnimGraph");
static_assert(offsetof(ABP_Granny_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'ABP_Granny_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

}

