#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AiCamera

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Granny_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AiCamera.AiCamera_C
// 0x0030 (0x0A90 - 0x0A60)
class UAiCamera_C final : public UAiCameraComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A60(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class AActor*>                         SawActors;                                         // 0x0A68(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	double                                        Distance_0;                                        // 0x0A78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SphereSize;                                        // 0x0A80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Debugging;                                         // 0x0A88(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AllowTrace;                                        // 0x0A89(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveTick(float DeltaSeconds);
	void GetActorsInCamera(bool Param_AllowTrace, TArray<class AActor*>* Actors);
	void ExecuteUbergraph_AiCamera(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AiCamera_C">();
	}
	static class UAiCamera_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAiCamera_C>();
	}
};
static_assert(alignof(UAiCamera_C) == 0x000010, "Wrong alignment on UAiCamera_C");
static_assert(sizeof(UAiCamera_C) == 0x000A90, "Wrong size on UAiCamera_C");
static_assert(offsetof(UAiCamera_C, UberGraphFrame) == 0x000A60, "Member 'UAiCamera_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAiCamera_C, SawActors) == 0x000A68, "Member 'UAiCamera_C::SawActors' has a wrong offset!");
static_assert(offsetof(UAiCamera_C, Distance_0) == 0x000A78, "Member 'UAiCamera_C::Distance_0' has a wrong offset!");
static_assert(offsetof(UAiCamera_C, SphereSize) == 0x000A80, "Member 'UAiCamera_C::SphereSize' has a wrong offset!");
static_assert(offsetof(UAiCamera_C, Debugging) == 0x000A88, "Member 'UAiCamera_C::Debugging' has a wrong offset!");
static_assert(offsetof(UAiCamera_C, AllowTrace) == 0x000A89, "Member 'UAiCamera_C::AllowTrace' has a wrong offset!");

}

