#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AiTask

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ST_Task_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass AiTask.AiTask_C
// 0x0060 (0x02F0 - 0x0290)
class AAiTask_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_Granny_C*                           Granny;                                            // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FST_Task                               Task;                                              // 0x02A8(0x0020)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        CurrentTime;                                       // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StartTime;                                         // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             TaskComplete;                                      // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          Completed;                                         // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void TaskComplete__DelegateSignature(const struct FST_Task& Param_Task);
	void Reset(const struct FST_Task& Param_Task);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_AiTask(int32 EntryPoint);
	void Complete();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AiTask_C">();
	}
	static class AAiTask_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAiTask_C>();
	}
};
static_assert(alignof(AAiTask_C) == 0x000008, "Wrong alignment on AAiTask_C");
static_assert(sizeof(AAiTask_C) == 0x0002F0, "Wrong size on AAiTask_C");
static_assert(offsetof(AAiTask_C, UberGraphFrame) == 0x000290, "Member 'AAiTask_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAiTask_C, DefaultSceneRoot) == 0x000298, "Member 'AAiTask_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AAiTask_C, Granny) == 0x0002A0, "Member 'AAiTask_C::Granny' has a wrong offset!");
static_assert(offsetof(AAiTask_C, Task) == 0x0002A8, "Member 'AAiTask_C::Task' has a wrong offset!");
static_assert(offsetof(AAiTask_C, CurrentTime) == 0x0002C8, "Member 'AAiTask_C::CurrentTime' has a wrong offset!");
static_assert(offsetof(AAiTask_C, StartTime) == 0x0002D0, "Member 'AAiTask_C::StartTime' has a wrong offset!");
static_assert(offsetof(AAiTask_C, TaskComplete) == 0x0002D8, "Member 'AAiTask_C::TaskComplete' has a wrong offset!");
static_assert(offsetof(AAiTask_C, Completed) == 0x0002E8, "Member 'AAiTask_C::Completed' has a wrong offset!");

}

