#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AiTask

#include "Basic.hpp"

#include "ST_Task_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AiTask.AiTask_C.TaskComplete__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct AiTask_C_TaskComplete__DelegateSignature final
{
public:
	struct FST_Task                               Param_Task;                                        // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AiTask_C_TaskComplete__DelegateSignature) == 0x000008, "Wrong alignment on AiTask_C_TaskComplete__DelegateSignature");
static_assert(sizeof(AiTask_C_TaskComplete__DelegateSignature) == 0x000020, "Wrong size on AiTask_C_TaskComplete__DelegateSignature");
static_assert(offsetof(AiTask_C_TaskComplete__DelegateSignature, Param_Task) == 0x000000, "Member 'AiTask_C_TaskComplete__DelegateSignature::Param_Task' has a wrong offset!");

// Function AiTask.AiTask_C.Reset
// 0x0020 (0x0020 - 0x0000)
struct AiTask_C_Reset final
{
public:
	struct FST_Task                               Param_Task;                                        // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AiTask_C_Reset) == 0x000008, "Wrong alignment on AiTask_C_Reset");
static_assert(sizeof(AiTask_C_Reset) == 0x000020, "Wrong size on AiTask_C_Reset");
static_assert(offsetof(AiTask_C_Reset, Param_Task) == 0x000000, "Member 'AiTask_C_Reset::Param_Task' has a wrong offset!");

// Function AiTask.AiTask_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct AiTask_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AiTask_C_ReceiveTick) == 0x000004, "Wrong alignment on AiTask_C_ReceiveTick");
static_assert(sizeof(AiTask_C_ReceiveTick) == 0x000004, "Wrong size on AiTask_C_ReceiveTick");
static_assert(offsetof(AiTask_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'AiTask_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function AiTask.AiTask_C.ExecuteUbergraph_AiTask
// 0x00C8 (0x00C8 - 0x0000)
struct AiTask_C_ExecuteUbergraph_AiTask final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24A6[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_Player_C*>                   CallFunc_GetAllActorsOfClass_OutActors;            // 0x0008(0x0010)(ReferenceParm)
	class ABP_Player_C*                           CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue_1;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_Task                               K2Node_CustomEvent_Task;                           // 0x0060(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	TArray<class AAiTask_C*>                      CallFunc_GetAllActorsOfClassWithTag_OutActors;     // 0x0090(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24A7[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAiTask_C*                              CallFunc_Array_Get_Item_1;                         // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24A8[0x2];                                     // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24A9[0x3];                                     // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RetriggerableDelay_Duration_ImplicitCast; // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AiTask_C_ExecuteUbergraph_AiTask) == 0x000008, "Wrong alignment on AiTask_C_ExecuteUbergraph_AiTask");
static_assert(sizeof(AiTask_C_ExecuteUbergraph_AiTask) == 0x0000C8, "Wrong size on AiTask_C_ExecuteUbergraph_AiTask");
static_assert(offsetof(AiTask_C_ExecuteUbergraph_AiTask, EntryPoint) == 0x000000, "Member 'AiTask_C_ExecuteUbergraph_AiTask::EntryPoint' has a wrong offset!");
static_assert(offsetof(AiTask_C_ExecuteUbergraph_AiTask, CallFunc_GetAllActorsOfClass_OutActors) == 0x000008, "Member 'AiTask_C_ExecuteUbergraph_AiTask::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(AiTask_C_ExecuteUbergraph_AiTask, CallFunc_Array_Get_Item) == 0x000018, "Member 'AiTask_C_ExecuteUbergraph_AiTask::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AiTask_C_ExecuteUbergraph_AiTask, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'AiTask_C_ExecuteUbergraph_AiTask::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AiTask_C_ExecuteUbergraph_AiTask, Temp_int_Array_Index_Variable) == 0x000038, "Member 'AiTask_C_ExecuteUbergraph_AiTask::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AiTask_C_ExecuteUbergraph_AiTask, K2Node_Event_DeltaSeconds) == 0x00003C, "Member 'AiTask_C_ExecuteUbergraph_AiTask::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(AiTask_C_ExecuteUbergraph_AiTask, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000040, "Member 'AiTask_C_ExecuteUbergraph_AiTask::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(AiTask_C_ExecuteUbergraph_AiTask, CallFunc_GetGameTimeInSeconds_ReturnValue_1) == 0x000048, "Member 'AiTask_C_ExecuteUbergraph_AiTask::CallFunc_GetGameTimeInSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AiTask_C_ExecuteUbergraph_AiTask, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000050, "Member 'AiTask_C_ExecuteUbergraph_AiTask::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AiTask_C_ExecuteUbergraph_AiTask, CallFunc_Abs_ReturnValue) == 0x000058, "Member 'AiTask_C_ExecuteUbergraph_AiTask::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(AiTask_C_ExecuteUbergraph_AiTask, K2Node_CustomEvent_Task) == 0x000060, "Member 'AiTask_C_ExecuteUbergraph_AiTask::K2Node_CustomEvent_Task' has a wrong offset!");
static_assert(offsetof(AiTask_C_ExecuteUbergraph_AiTask, K2Node_MakeArray_Array) == 0x000080, "Member 'AiTask_C_ExecuteUbergraph_AiTask::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AiTask_C_ExecuteUbergraph_AiTask, CallFunc_GetAllActorsOfClassWithTag_OutActors) == 0x000090, "Member 'AiTask_C_ExecuteUbergraph_AiTask::CallFunc_GetAllActorsOfClassWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(AiTask_C_ExecuteUbergraph_AiTask, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0000A0, "Member 'AiTask_C_ExecuteUbergraph_AiTask::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AiTask_C_ExecuteUbergraph_AiTask, CallFunc_Array_Get_Item_1) == 0x0000A8, "Member 'AiTask_C_ExecuteUbergraph_AiTask::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(AiTask_C_ExecuteUbergraph_AiTask, CallFunc_Array_Length_ReturnValue) == 0x0000B0, "Member 'AiTask_C_ExecuteUbergraph_AiTask::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AiTask_C_ExecuteUbergraph_AiTask, Temp_int_Loop_Counter_Variable) == 0x0000B4, "Member 'AiTask_C_ExecuteUbergraph_AiTask::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AiTask_C_ExecuteUbergraph_AiTask, CallFunc_Less_IntInt_ReturnValue) == 0x0000B8, "Member 'AiTask_C_ExecuteUbergraph_AiTask::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AiTask_C_ExecuteUbergraph_AiTask, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x0000B9, "Member 'AiTask_C_ExecuteUbergraph_AiTask::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AiTask_C_ExecuteUbergraph_AiTask, CallFunc_Add_IntInt_ReturnValue) == 0x0000BC, "Member 'AiTask_C_ExecuteUbergraph_AiTask::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AiTask_C_ExecuteUbergraph_AiTask, CallFunc_IsValid_ReturnValue) == 0x0000C0, "Member 'AiTask_C_ExecuteUbergraph_AiTask::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AiTask_C_ExecuteUbergraph_AiTask, CallFunc_RetriggerableDelay_Duration_ImplicitCast) == 0x0000C4, "Member 'AiTask_C_ExecuteUbergraph_AiTask::CallFunc_RetriggerableDelay_Duration_ImplicitCast' has a wrong offset!");

}

