#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CoreHUD

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CoreHUD.BP_CoreHUD_C
// 0x0018 (0x0398 - 0x0380)
class ABP_CoreHUD_C : public AHUD
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_ConsoleWidget_C*                    Console;                                           // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void OpenConsole();
	void ExecuteUbergraph_BP_CoreHUD(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CoreHUD_C">();
	}
	static class ABP_CoreHUD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CoreHUD_C>();
	}
};
static_assert(alignof(ABP_CoreHUD_C) == 0x000008, "Wrong alignment on ABP_CoreHUD_C");
static_assert(sizeof(ABP_CoreHUD_C) == 0x000398, "Wrong size on ABP_CoreHUD_C");
static_assert(offsetof(ABP_CoreHUD_C, UberGraphFrame) == 0x000380, "Member 'ABP_CoreHUD_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_CoreHUD_C, DefaultSceneRoot) == 0x000388, "Member 'ABP_CoreHUD_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_CoreHUD_C, Console) == 0x000390, "Member 'ABP_CoreHUD_C::Console' has a wrong offset!");

}

