#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CameraPawn

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function BP_CameraPawn.BP_CameraPawn_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_CameraPawn_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CameraPawn_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_CameraPawn_C_ReceiveTick");
static_assert(sizeof(BP_CameraPawn_C_ReceiveTick) == 0x000004, "Wrong size on BP_CameraPawn_C_ReceiveTick");
static_assert(offsetof(BP_CameraPawn_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_CameraPawn_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_CameraPawn.BP_CameraPawn_C.InpActEvt_Q_K2Node_InputKeyEvent_1
// 0x0018 (0x0018 - 0x0000)
struct BP_CameraPawn_C_InpActEvt_Q_K2Node_InputKeyEvent_1 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_CameraPawn_C_InpActEvt_Q_K2Node_InputKeyEvent_1) == 0x000008, "Wrong alignment on BP_CameraPawn_C_InpActEvt_Q_K2Node_InputKeyEvent_1");
static_assert(sizeof(BP_CameraPawn_C_InpActEvt_Q_K2Node_InputKeyEvent_1) == 0x000018, "Wrong size on BP_CameraPawn_C_InpActEvt_Q_K2Node_InputKeyEvent_1");
static_assert(offsetof(BP_CameraPawn_C_InpActEvt_Q_K2Node_InputKeyEvent_1, Key) == 0x000000, "Member 'BP_CameraPawn_C_InpActEvt_Q_K2Node_InputKeyEvent_1::Key' has a wrong offset!");

// Function BP_CameraPawn.BP_CameraPawn_C.InpActEvt_Q_K2Node_InputKeyEvent_0
// 0x0018 (0x0018 - 0x0000)
struct BP_CameraPawn_C_InpActEvt_Q_K2Node_InputKeyEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_CameraPawn_C_InpActEvt_Q_K2Node_InputKeyEvent_0) == 0x000008, "Wrong alignment on BP_CameraPawn_C_InpActEvt_Q_K2Node_InputKeyEvent_0");
static_assert(sizeof(BP_CameraPawn_C_InpActEvt_Q_K2Node_InputKeyEvent_0) == 0x000018, "Wrong size on BP_CameraPawn_C_InpActEvt_Q_K2Node_InputKeyEvent_0");
static_assert(offsetof(BP_CameraPawn_C_InpActEvt_Q_K2Node_InputKeyEvent_0, Key) == 0x000000, "Member 'BP_CameraPawn_C_InpActEvt_Q_K2Node_InputKeyEvent_0::Key' has a wrong offset!");

// Function BP_CameraPawn.BP_CameraPawn_C.InpActEvt_IA_Move_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct BP_CameraPawn_C_InpActEvt_IA_Move_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CameraPawn_C_InpActEvt_IA_Move_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on BP_CameraPawn_C_InpActEvt_IA_Move_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(BP_CameraPawn_C_InpActEvt_IA_Move_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on BP_CameraPawn_C_InpActEvt_IA_Move_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(BP_CameraPawn_C_InpActEvt_IA_Move_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'BP_CameraPawn_C_InpActEvt_IA_Move_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(BP_CameraPawn_C_InpActEvt_IA_Move_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'BP_CameraPawn_C_InpActEvt_IA_Move_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(BP_CameraPawn_C_InpActEvt_IA_Move_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'BP_CameraPawn_C_InpActEvt_IA_Move_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(BP_CameraPawn_C_InpActEvt_IA_Move_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'BP_CameraPawn_C_InpActEvt_IA_Move_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

// Function BP_CameraPawn.BP_CameraPawn_C.InpActEvt_E_K2Node_InputKeyEvent_3
// 0x0018 (0x0018 - 0x0000)
struct BP_CameraPawn_C_InpActEvt_E_K2Node_InputKeyEvent_3 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_CameraPawn_C_InpActEvt_E_K2Node_InputKeyEvent_3) == 0x000008, "Wrong alignment on BP_CameraPawn_C_InpActEvt_E_K2Node_InputKeyEvent_3");
static_assert(sizeof(BP_CameraPawn_C_InpActEvt_E_K2Node_InputKeyEvent_3) == 0x000018, "Wrong size on BP_CameraPawn_C_InpActEvt_E_K2Node_InputKeyEvent_3");
static_assert(offsetof(BP_CameraPawn_C_InpActEvt_E_K2Node_InputKeyEvent_3, Key) == 0x000000, "Member 'BP_CameraPawn_C_InpActEvt_E_K2Node_InputKeyEvent_3::Key' has a wrong offset!");

// Function BP_CameraPawn.BP_CameraPawn_C.InpActEvt_E_K2Node_InputKeyEvent_2
// 0x0018 (0x0018 - 0x0000)
struct BP_CameraPawn_C_InpActEvt_E_K2Node_InputKeyEvent_2 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_CameraPawn_C_InpActEvt_E_K2Node_InputKeyEvent_2) == 0x000008, "Wrong alignment on BP_CameraPawn_C_InpActEvt_E_K2Node_InputKeyEvent_2");
static_assert(sizeof(BP_CameraPawn_C_InpActEvt_E_K2Node_InputKeyEvent_2) == 0x000018, "Wrong size on BP_CameraPawn_C_InpActEvt_E_K2Node_InputKeyEvent_2");
static_assert(offsetof(BP_CameraPawn_C_InpActEvt_E_K2Node_InputKeyEvent_2, Key) == 0x000000, "Member 'BP_CameraPawn_C_InpActEvt_E_K2Node_InputKeyEvent_2::Key' has a wrong offset!");

// Function BP_CameraPawn.BP_CameraPawn_C.ExecuteUbergraph_BP_CameraPawn
// 0x0178 (0x0178 - 0x0000)
struct BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EBB[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable;                              // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_3;                        // 0x0030(0x0018)(HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_2;                        // 0x0058(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_1;                            // 0x0070(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_1;                        // 0x0088(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x00A0(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_2;                            // 0x00B8(0x0018)(HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x00D0(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x00F8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_InputActionValueToAxis2D_ReturnValue; // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AddMovementInput_ScaleValue_ImplicitCast; // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AddMovementInput_ScaleValue_ImplicitCast_1; // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn) == 0x000008, "Wrong alignment on BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn");
static_assert(sizeof(BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn) == 0x000178, "Wrong size on BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn");
static_assert(offsetof(BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn, EntryPoint) == 0x000000, "Member 'BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn, Temp_object_Variable) == 0x000008, "Member 'BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn, Temp_real_Variable) == 0x000010, "Member 'BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn, Temp_real_Variable_1) == 0x000018, "Member 'BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn, Temp_struct_Variable) == 0x000020, "Member 'BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn, K2Node_InputKeyEvent_Key_3) == 0x000030, "Member 'BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn::K2Node_InputKeyEvent_Key_3' has a wrong offset!");
static_assert(offsetof(BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn, CallFunc_BreakVector2D_X) == 0x000048, "Member 'BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn, CallFunc_BreakVector2D_Y) == 0x000050, "Member 'BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn, K2Node_InputKeyEvent_Key_2) == 0x000058, "Member 'BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn::K2Node_InputKeyEvent_Key_2' has a wrong offset!");
static_assert(offsetof(BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn, Temp_struct_Variable_1) == 0x000070, "Member 'BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn, K2Node_InputKeyEvent_Key_1) == 0x000088, "Member 'BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn::K2Node_InputKeyEvent_Key_1' has a wrong offset!");
static_assert(offsetof(BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn, K2Node_InputKeyEvent_Key) == 0x0000A0, "Member 'BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn::K2Node_InputKeyEvent_Key' has a wrong offset!");
static_assert(offsetof(BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn, Temp_struct_Variable_2) == 0x0000B8, "Member 'BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn, K2Node_EnhancedInputActionEvent_ActionValue) == 0x0000D0, "Member 'BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x0000F0, "Member 'BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x0000F4, "Member 'BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn, K2Node_EnhancedInputActionEvent_SourceAction) == 0x0000F8, "Member 'BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn, CallFunc_GetControlRotation_ReturnValue) == 0x000100, "Member 'BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn::CallFunc_GetControlRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn, CallFunc_GetRightVector_ReturnValue) == 0x000118, "Member 'BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x000130, "Member 'BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn, Temp_real_Variable_0) == 0x000148, "Member 'BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn, Temp_real_Variable_1_0) == 0x000150, "Member 'BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn, CallFunc_Conv_InputActionValueToAxis2D_ReturnValue) == 0x000158, "Member 'BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn::CallFunc_Conv_InputActionValueToAxis2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn, K2Node_Event_DeltaSeconds) == 0x000168, "Member 'BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn, CallFunc_AddMovementInput_ScaleValue_ImplicitCast) == 0x00016C, "Member 'BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn::CallFunc_AddMovementInput_ScaleValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn, CallFunc_AddMovementInput_ScaleValue_ImplicitCast_1) == 0x000170, "Member 'BP_CameraPawn_C_ExecuteUbergraph_BP_CameraPawn::CallFunc_AddMovementInput_ScaleValue_ImplicitCast_1' has a wrong offset!");

}

