#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ConsoleWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "BP_CoreWidget_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_ConsoleWidget.BP_ConsoleWidget_C
// 0x0128 (0x03A0 - 0x0278)
class UBP_ConsoleWidget_C final : public UBP_CoreWidget_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_0;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       EditableTextBox_169;                               // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_69;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_67;                                      // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Opened;                                            // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28A1[0x7];                                     // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Command;                                           // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          OpenSMC;                                           // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28A2[0x7];                                     // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LastCommand;                                       // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FEventReply                            NewVar;                                            // 0x02E8(0x00B8)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void VisController();
	void TryToUeConsole();
	void TryToDestroy();
	void TryToClearConsole();
	void TryRunLuaScript();
	void ToggleConsole();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	struct FEventReply OnPreviewKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void ExecuteUbergraph_BP_ConsoleWidget(int32 EntryPoint);
	void CreateResponse(const class FString& Text, const struct FLinearColor& Color);
	void Construct();
	void CommandHandler(const class FString& Param_Command);
	void BndEvt__BP_ConsoleWidget_EditableTextBox_169_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void BndEvt__BP_ConsoleWidget_Button_0_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void ActorsList();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ConsoleWidget_C">();
	}
	static class UBP_ConsoleWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ConsoleWidget_C>();
	}
};
static_assert(alignof(UBP_ConsoleWidget_C) == 0x000008, "Wrong alignment on UBP_ConsoleWidget_C");
static_assert(sizeof(UBP_ConsoleWidget_C) == 0x0003A0, "Wrong size on UBP_ConsoleWidget_C");
static_assert(offsetof(UBP_ConsoleWidget_C, UberGraphFrame) == 0x000278, "Member 'UBP_ConsoleWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ConsoleWidget_C, Button_0) == 0x000280, "Member 'UBP_ConsoleWidget_C::Button_0' has a wrong offset!");
static_assert(offsetof(UBP_ConsoleWidget_C, EditableTextBox_169) == 0x000288, "Member 'UBP_ConsoleWidget_C::EditableTextBox_169' has a wrong offset!");
static_assert(offsetof(UBP_ConsoleWidget_C, Image) == 0x000290, "Member 'UBP_ConsoleWidget_C::Image' has a wrong offset!");
static_assert(offsetof(UBP_ConsoleWidget_C, Image_0) == 0x000298, "Member 'UBP_ConsoleWidget_C::Image_0' has a wrong offset!");
static_assert(offsetof(UBP_ConsoleWidget_C, Image_1) == 0x0002A0, "Member 'UBP_ConsoleWidget_C::Image_1' has a wrong offset!");
static_assert(offsetof(UBP_ConsoleWidget_C, Image_69) == 0x0002A8, "Member 'UBP_ConsoleWidget_C::Image_69' has a wrong offset!");
static_assert(offsetof(UBP_ConsoleWidget_C, ScrollBox_67) == 0x0002B0, "Member 'UBP_ConsoleWidget_C::ScrollBox_67' has a wrong offset!");
static_assert(offsetof(UBP_ConsoleWidget_C, Opened) == 0x0002B8, "Member 'UBP_ConsoleWidget_C::Opened' has a wrong offset!");
static_assert(offsetof(UBP_ConsoleWidget_C, Command) == 0x0002C0, "Member 'UBP_ConsoleWidget_C::Command' has a wrong offset!");
static_assert(offsetof(UBP_ConsoleWidget_C, OpenSMC) == 0x0002D0, "Member 'UBP_ConsoleWidget_C::OpenSMC' has a wrong offset!");
static_assert(offsetof(UBP_ConsoleWidget_C, LastCommand) == 0x0002D8, "Member 'UBP_ConsoleWidget_C::LastCommand' has a wrong offset!");
static_assert(offsetof(UBP_ConsoleWidget_C, NewVar) == 0x0002E8, "Member 'UBP_ConsoleWidget_C::NewVar' has a wrong offset!");

}

