#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ConsoleWidget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ConsoleWidget.BP_ConsoleWidget_C.VisController
// 0x0040 (0x0040 - 0x0000)
struct BP_ConsoleWidget_C_VisController final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28A3[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28A4[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28A5[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FInterpTo_Current_ImplicitCast;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConsoleWidget_C_VisController) == 0x000008, "Wrong alignment on BP_ConsoleWidget_C_VisController");
static_assert(sizeof(BP_ConsoleWidget_C_VisController) == 0x000040, "Wrong size on BP_ConsoleWidget_C_VisController");
static_assert(offsetof(BP_ConsoleWidget_C_VisController, Temp_bool_Variable) == 0x000000, "Member 'BP_ConsoleWidget_C_VisController::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_VisController, Temp_byte_Variable) == 0x000001, "Member 'BP_ConsoleWidget_C_VisController::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_VisController, Temp_byte_Variable_1) == 0x000002, "Member 'BP_ConsoleWidget_C_VisController::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_VisController, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000008, "Member 'BP_ConsoleWidget_C_VisController::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_VisController, CallFunc_GetRenderOpacity_ReturnValue) == 0x000010, "Member 'BP_ConsoleWidget_C_VisController::CallFunc_GetRenderOpacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_VisController, CallFunc_SelectFloat_ReturnValue) == 0x000018, "Member 'BP_ConsoleWidget_C_VisController::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_VisController, CallFunc_FInterpTo_ReturnValue) == 0x000020, "Member 'BP_ConsoleWidget_C_VisController::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_VisController, K2Node_Select_Default) == 0x000028, "Member 'BP_ConsoleWidget_C_VisController::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_VisController, CallFunc_FInterpTo_Current_ImplicitCast) == 0x000030, "Member 'BP_ConsoleWidget_C_VisController::CallFunc_FInterpTo_Current_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_VisController, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000038, "Member 'BP_ConsoleWidget_C_VisController::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function BP_ConsoleWidget.BP_ConsoleWidget_C.TryToUeConsole
// 0x0030 (0x0030 - 0x0000)
struct BP_ConsoleWidget_C_TryToUeConsole final
{
public:
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConsoleWidget_C_TryToUeConsole) == 0x000008, "Wrong alignment on BP_ConsoleWidget_C_TryToUeConsole");
static_assert(sizeof(BP_ConsoleWidget_C_TryToUeConsole) == 0x000030, "Wrong size on BP_ConsoleWidget_C_TryToUeConsole");
static_assert(offsetof(BP_ConsoleWidget_C_TryToUeConsole, CallFunc_Replace_ReturnValue) == 0x000000, "Member 'BP_ConsoleWidget_C_TryToUeConsole::CallFunc_Replace_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToUeConsole, CallFunc_Concat_StrStr_ReturnValue) == 0x000010, "Member 'BP_ConsoleWidget_C_TryToUeConsole::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToUeConsole, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000020, "Member 'BP_ConsoleWidget_C_TryToUeConsole::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");

// Function BP_ConsoleWidget.BP_ConsoleWidget_C.TryToDestroy
// 0x0580 (0x0580 - 0x0000)
struct BP_ConsoleWidget_C_TryToDestroy final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28A6[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0020(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         CallFunc_GetAllActorsOfClass_OutActors;            // 0x0030(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28A7[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28A8[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28A9[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue_1;         // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28AA[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetCameraRotation_ReturnValue;            // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28AB[0x4];                                     // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28AC[0x3];                                     // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x0150(0x0010)(ConstParm, ReferenceParm)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_1;     // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0168(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28AD[0x7];                                     // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetCameraRotation_ReturnValue_1;          // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28AE[0x2];                                     // 0x0272(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28AF[0x4];                                     // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0280(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0298(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x02B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x02C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28B0[0x4];                                     // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0318(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0330(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x0348(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28B1[0x7];                                     // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0368(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue_1;          // 0x0380(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0398(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28B2[0x7];                                     // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit_1;                 // 0x03B8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue_1;            // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x04A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x04A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28B3[0x1];                                     // 0x04A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x04A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x04A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28B4[0x4];                                     // 0x04AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x04B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x04C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x04E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x04F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0510(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0518(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0520(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_1;                // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x053C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28B5[0x4];                                     // 0x0544(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0548(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0560(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartsWith_ReturnValue;                   // 0x0579(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConsoleWidget_C_TryToDestroy) == 0x000008, "Wrong alignment on BP_ConsoleWidget_C_TryToDestroy");
static_assert(sizeof(BP_ConsoleWidget_C_TryToDestroy) == 0x000580, "Wrong size on BP_ConsoleWidget_C_TryToDestroy");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_ConsoleWidget_C_TryToDestroy::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000008, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, Temp_object_Variable) == 0x000020, "Member 'BP_ConsoleWidget_C_TryToDestroy::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_GetAllActorsOfClass_OutActors) == 0x000030, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_Replace_ReturnValue) == 0x000048, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_Replace_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_GetDisplayName_ReturnValue) == 0x000060, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_Concat_StrStr_ReturnValue) == 0x000070, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_EqualEqual_StriStri_ReturnValue) == 0x000080, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_EqualEqual_StriStri_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000088, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_Conv_FloatToVector_ReturnValue_1) == 0x0000A0, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_Conv_FloatToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x0000B8, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x0000C0, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_GetCameraRotation_ReturnValue) == 0x0000C8, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_GetCameraRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_GetCameraLocation_ReturnValue) == 0x0000E0, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_GetForwardVector_ReturnValue) == 0x0000F8, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, Temp_int_Loop_Counter_Variable) == 0x000110, "Member 'BP_ConsoleWidget_C_TryToDestroy::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000118, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_Add_VectorVector_ReturnValue) == 0x000130, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_Less_IntInt_ReturnValue) == 0x000148, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_Add_IntInt_ReturnValue) == 0x00014C, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, Temp_object_Variable_1) == 0x000150, "Member 'BP_ConsoleWidget_C_TryToDestroy::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_GetPlayerCameraManager_ReturnValue_1) == 0x000160, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_GetPlayerCameraManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_LineTraceSingle_OutHit) == 0x000168, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_LineTraceSingle_ReturnValue) == 0x000250, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_GetCameraRotation_ReturnValue_1) == 0x000258, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_GetCameraRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_BreakHitResult_bBlockingHit) == 0x000270, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_BreakHitResult_bInitialOverlap) == 0x000271, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_BreakHitResult_Time) == 0x000274, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_BreakHitResult_Distance) == 0x000278, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_BreakHitResult_Location) == 0x000280, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_BreakHitResult_ImpactPoint) == 0x000298, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_BreakHitResult_Normal) == 0x0002B0, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_BreakHitResult_ImpactNormal) == 0x0002C8, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_BreakHitResult_PhysMat) == 0x0002E0, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_BreakHitResult_HitActor) == 0x0002E8, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_BreakHitResult_HitComponent) == 0x0002F0, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_BreakHitResult_HitBoneName) == 0x0002F8, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_BreakHitResult_BoneName) == 0x000300, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_BreakHitResult_HitItem) == 0x000308, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_BreakHitResult_ElementIndex) == 0x00030C, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_BreakHitResult_FaceIndex) == 0x000310, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_BreakHitResult_TraceStart) == 0x000318, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_BreakHitResult_TraceEnd) == 0x000330, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_GetForwardVector_ReturnValue_1) == 0x000348, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_IsValid_ReturnValue_1) == 0x000360, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000368, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_GetCameraLocation_ReturnValue_1) == 0x000380, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_GetCameraLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000398, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x0003B0, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_LineTraceSingle_OutHit_1) == 0x0003B8, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_LineTraceSingle_OutHit_1' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_LineTraceSingle_ReturnValue_1) == 0x0004A0, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_LineTraceSingle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_BreakHitResult_bBlockingHit_1) == 0x0004A1, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x0004A2, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_BreakHitResult_Time_1) == 0x0004A4, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_BreakHitResult_Distance_1) == 0x0004A8, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_BreakHitResult_Location_1) == 0x0004B0, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_BreakHitResult_ImpactPoint_1) == 0x0004C8, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_BreakHitResult_Normal_1) == 0x0004E0, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_BreakHitResult_ImpactNormal_1) == 0x0004F8, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_BreakHitResult_PhysMat_1) == 0x000510, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_BreakHitResult_HitActor_1) == 0x000518, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_BreakHitResult_HitComponent_1) == 0x000520, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_BreakHitResult_HitBoneName_1) == 0x000528, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_BreakHitResult_BoneName_1) == 0x000530, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_BreakHitResult_BoneName_1' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_BreakHitResult_HitItem_1) == 0x000538, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_BreakHitResult_ElementIndex_1) == 0x00053C, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_BreakHitResult_FaceIndex_1) == 0x000540, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_BreakHitResult_TraceStart_1) == 0x000548, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_BreakHitResult_TraceEnd_1) == 0x000560, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_IsValid_ReturnValue_2) == 0x000578, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_TryToDestroy, CallFunc_StartsWith_ReturnValue) == 0x000579, "Member 'BP_ConsoleWidget_C_TryToDestroy::CallFunc_StartsWith_ReturnValue' has a wrong offset!");

// Function BP_ConsoleWidget.BP_ConsoleWidget_C.TryToClearConsole
// 0x0001 (0x0001 - 0x0000)
struct BP_ConsoleWidget_C_TryToClearConsole final
{
public:
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConsoleWidget_C_TryToClearConsole) == 0x000001, "Wrong alignment on BP_ConsoleWidget_C_TryToClearConsole");
static_assert(sizeof(BP_ConsoleWidget_C_TryToClearConsole) == 0x000001, "Wrong size on BP_ConsoleWidget_C_TryToClearConsole");
static_assert(offsetof(BP_ConsoleWidget_C_TryToClearConsole, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000000, "Member 'BP_ConsoleWidget_C_TryToClearConsole::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// Function BP_ConsoleWidget.BP_ConsoleWidget_C.Tick
// 0x0048 (0x0048 - 0x0000)
struct BP_ConsoleWidget_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConsoleWidget_C_Tick) == 0x000008, "Wrong alignment on BP_ConsoleWidget_C_Tick");
static_assert(sizeof(BP_ConsoleWidget_C_Tick) == 0x000048, "Wrong size on BP_ConsoleWidget_C_Tick");
static_assert(offsetof(BP_ConsoleWidget_C_Tick, MyGeometry) == 0x000000, "Member 'BP_ConsoleWidget_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_Tick, InDeltaTime) == 0x000040, "Member 'BP_ConsoleWidget_C_Tick::InDeltaTime' has a wrong offset!");

// Function BP_ConsoleWidget.BP_ConsoleWidget_C.OnPreviewKeyDown
// 0x02E0 (0x02E0 - 0x0000)
struct BP_ConsoleWidget_C_OnPreviewKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0040(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0080(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0138(0x00B8)()
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x01F0(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28B6[0x7];                                     // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0210(0x00B8)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x02C8(0x0018)()
};
static_assert(alignof(BP_ConsoleWidget_C_OnPreviewKeyDown) == 0x000008, "Wrong alignment on BP_ConsoleWidget_C_OnPreviewKeyDown");
static_assert(sizeof(BP_ConsoleWidget_C_OnPreviewKeyDown) == 0x0002E0, "Wrong size on BP_ConsoleWidget_C_OnPreviewKeyDown");
static_assert(offsetof(BP_ConsoleWidget_C_OnPreviewKeyDown, MyGeometry) == 0x000000, "Member 'BP_ConsoleWidget_C_OnPreviewKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_OnPreviewKeyDown, InKeyEvent) == 0x000040, "Member 'BP_ConsoleWidget_C_OnPreviewKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_OnPreviewKeyDown, ReturnValue) == 0x000080, "Member 'BP_ConsoleWidget_C_OnPreviewKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_OnPreviewKeyDown, CallFunc_Unhandled_ReturnValue) == 0x000138, "Member 'BP_ConsoleWidget_C_OnPreviewKeyDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_OnPreviewKeyDown, CallFunc_GetKey_ReturnValue) == 0x0001F0, "Member 'BP_ConsoleWidget_C_OnPreviewKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_OnPreviewKeyDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000208, "Member 'BP_ConsoleWidget_C_OnPreviewKeyDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_OnPreviewKeyDown, CallFunc_Handled_ReturnValue) == 0x000210, "Member 'BP_ConsoleWidget_C_OnPreviewKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_OnPreviewKeyDown, CallFunc_Conv_StringToText_ReturnValue) == 0x0002C8, "Member 'BP_ConsoleWidget_C_OnPreviewKeyDown::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function BP_ConsoleWidget.BP_ConsoleWidget_C.OnKeyDown
// 0x0138 (0x0138 - 0x0000)
struct BP_ConsoleWidget_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0040(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0080(0x00B8)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(BP_ConsoleWidget_C_OnKeyDown) == 0x000008, "Wrong alignment on BP_ConsoleWidget_C_OnKeyDown");
static_assert(sizeof(BP_ConsoleWidget_C_OnKeyDown) == 0x000138, "Wrong size on BP_ConsoleWidget_C_OnKeyDown");
static_assert(offsetof(BP_ConsoleWidget_C_OnKeyDown, MyGeometry) == 0x000000, "Member 'BP_ConsoleWidget_C_OnKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_OnKeyDown, InKeyEvent) == 0x000040, "Member 'BP_ConsoleWidget_C_OnKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_OnKeyDown, ReturnValue) == 0x000080, "Member 'BP_ConsoleWidget_C_OnKeyDown::ReturnValue' has a wrong offset!");

// Function BP_ConsoleWidget.BP_ConsoleWidget_C.ExecuteUbergraph_BP_ConsoleWidget
// 0x0130 (0x0130 - 0x0000)
struct BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28B7[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ConsolePromt_C*                     CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_ConsolePromt_C*                     CallFunc_Create_ReturnValue_1;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UScrollBoxSlot*                         CallFunc_SlotAsScrollBoxSlot_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UScrollBoxSlot*                         CallFunc_SlotAsScrollBoxSlot_ReturnValue_1;        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28B8[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0030(0x0018)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28B9[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0060(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0078(0x0040)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28BA[0x4];                                     // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Command;                        // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_ToLower_ReturnValue;                      // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Text;                           // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_CustomEvent_Color;                          // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget) == 0x000008, "Wrong alignment on BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget");
static_assert(sizeof(BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget) == 0x000130, "Wrong size on BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget");
static_assert(offsetof(BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget, EntryPoint) == 0x000000, "Member 'BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget, CallFunc_Create_ReturnValue) == 0x000008, "Member 'BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget, CallFunc_Create_ReturnValue_1) == 0x000010, "Member 'BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget, CallFunc_SlotAsScrollBoxSlot_ReturnValue) == 0x000018, "Member 'BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget::CallFunc_SlotAsScrollBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget, CallFunc_SlotAsScrollBoxSlot_ReturnValue_1) == 0x000020, "Member 'BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget::CallFunc_SlotAsScrollBoxSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget, Temp_bool_Variable) == 0x000028, "Member 'BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget, Temp_byte_Variable) == 0x000029, "Member 'BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget, Temp_byte_Variable_1) == 0x00002A, "Member 'BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget, K2Node_Select_Default) == 0x00002B, "Member 'BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget, K2Node_ComponentBoundEvent_Text) == 0x000030, "Member 'BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget, K2Node_ComponentBoundEvent_CommitMethod) == 0x000048, "Member 'BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget::K2Node_ComponentBoundEvent_CommitMethod' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget, K2Node_SwitchEnum_CmpSuccess) == 0x000049, "Member 'BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget, CallFunc_Conv_TextToString_ReturnValue) == 0x000050, "Member 'BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget, Temp_struct_Variable) == 0x000060, "Member 'BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget, CallFunc_AddChild_ReturnValue) == 0x000070, "Member 'BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget, K2Node_Event_MyGeometry) == 0x000078, "Member 'BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget, K2Node_Event_InDeltaTime) == 0x0000B8, "Member 'BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000C0, "Member 'BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x0000C8, "Member 'BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget, K2Node_CustomEvent_Command) == 0x0000D0, "Member 'BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget::K2Node_CustomEvent_Command' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget, CallFunc_ToLower_ReturnValue) == 0x0000E0, "Member 'BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget::CallFunc_ToLower_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget, K2Node_CustomEvent_Text) == 0x0000F0, "Member 'BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget::K2Node_CustomEvent_Text' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget, K2Node_CustomEvent_Color) == 0x000100, "Member 'BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget::K2Node_CustomEvent_Color' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget, CallFunc_AddChild_ReturnValue_1) == 0x000110, "Member 'BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget, CallFunc_GetOwningPlayer_ReturnValue_2) == 0x000118, "Member 'BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget::CallFunc_GetOwningPlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget, CallFunc_SelectFloat_ReturnValue) == 0x000120, "Member 'BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000128, "Member 'BP_ConsoleWidget_C_ExecuteUbergraph_BP_ConsoleWidget::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function BP_ConsoleWidget.BP_ConsoleWidget_C.CreateResponse
// 0x0020 (0x0020 - 0x0000)
struct BP_ConsoleWidget_C_CreateResponse final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConsoleWidget_C_CreateResponse) == 0x000008, "Wrong alignment on BP_ConsoleWidget_C_CreateResponse");
static_assert(sizeof(BP_ConsoleWidget_C_CreateResponse) == 0x000020, "Wrong size on BP_ConsoleWidget_C_CreateResponse");
static_assert(offsetof(BP_ConsoleWidget_C_CreateResponse, Text) == 0x000000, "Member 'BP_ConsoleWidget_C_CreateResponse::Text' has a wrong offset!");
static_assert(offsetof(BP_ConsoleWidget_C_CreateResponse, Color) == 0x000010, "Member 'BP_ConsoleWidget_C_CreateResponse::Color' has a wrong offset!");

// Function BP_ConsoleWidget.BP_ConsoleWidget_C.CommandHandler
// 0x0010 (0x0010 - 0x0000)
struct BP_ConsoleWidget_C_CommandHandler final
{
public:
	class FString                                 Param_Command;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConsoleWidget_C_CommandHandler) == 0x000008, "Wrong alignment on BP_ConsoleWidget_C_CommandHandler");
static_assert(sizeof(BP_ConsoleWidget_C_CommandHandler) == 0x000010, "Wrong size on BP_ConsoleWidget_C_CommandHandler");
static_assert(offsetof(BP_ConsoleWidget_C_CommandHandler, Param_Command) == 0x000000, "Member 'BP_ConsoleWidget_C_CommandHandler::Param_Command' has a wrong offset!");

// Function BP_ConsoleWidget.BP_ConsoleWidget_C.BndEvt__BP_ConsoleWidget_EditableTextBox_169_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_ConsoleWidget_C_BndEvt__BP_ConsoleWidget_EditableTextBox_169_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConsoleWidget_C_BndEvt__BP_ConsoleWidget_EditableTextBox_169_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on BP_ConsoleWidget_C_BndEvt__BP_ConsoleWidget_EditableTextBox_169_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature");
