#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DuctTape

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_DuctTape.BP_DuctTape_C.Taken
// 0x0001 (0x0001 - 0x0000)
struct BP_DuctTape_C_Taken final
{
public:
	bool                                          ByGranny;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DuctTape_C_Taken) == 0x000001, "Wrong alignment on BP_DuctTape_C_Taken");
static_assert(sizeof(BP_DuctTape_C_Taken) == 0x000001, "Wrong size on BP_DuctTape_C_Taken");
static_assert(offsetof(BP_DuctTape_C_Taken, ByGranny) == 0x000000, "Member 'BP_DuctTape_C_Taken::ByGranny' has a wrong offset!");

// Function BP_DuctTape.BP_DuctTape_C.ExecuteUbergraph_BP_DuctTape
// 0x0008 (0x0008 - 0x0000)
struct BP_DuctTape_C_ExecuteUbergraph_BP_DuctTape final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_ByGranny;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DuctTape_C_ExecuteUbergraph_BP_DuctTape) == 0x000004, "Wrong alignment on BP_DuctTape_C_ExecuteUbergraph_BP_DuctTape");
static_assert(sizeof(BP_DuctTape_C_ExecuteUbergraph_BP_DuctTape) == 0x000008, "Wrong size on BP_DuctTape_C_ExecuteUbergraph_BP_DuctTape");
static_assert(offsetof(BP_DuctTape_C_ExecuteUbergraph_BP_DuctTape, EntryPoint) == 0x000000, "Member 'BP_DuctTape_C_ExecuteUbergraph_BP_DuctTape::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DuctTape_C_ExecuteUbergraph_BP_DuctTape, K2Node_Event_ByGranny) == 0x000004, "Member 'BP_DuctTape_C_ExecuteUbergraph_BP_DuctTape::K2Node_Event_ByGranny' has a wrong offset!");

}

