#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ExtraLock

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_InteractableBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ExtraLock.BP_ExtraLock_C
// 0x0068 (0x0358 - 0x02F0)
class ABP_ExtraLock_C final : public ABP_InteractableBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_ExtraLock_C;                     // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Key;                                               // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BoxPlate1;                                         // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BoxPlate;                                          // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_NewTrack_0_B82D937642554EB7B6BC47A533F3F6E6; // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_B82D937642554EB7B6BC47A533F3F6E6; // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2603[0x3];                                     // 0x0315(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_Player_C*                           Player;                                            // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    PlayerHitComponent;                                // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        StartAnimationSeconds;                             // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Unscrewing;                                        // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2604[0x7];                                     // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    AnimatingComponent;                                // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_MainDoor_C*                         MainDoor;                                          // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Opened;                                            // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Timeline__UpdateFunc();
	void Timeline__FinishedFunc();
	void Interact(class ABP_Player_C* Param_Player, const struct FHitResult& Hit);
	void GetAllNotUnscrewed(TArray<class UStaticMeshComponent*>* NewLocalVar1);
	void ExecuteUbergraph_BP_ExtraLock(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ExtraLock_C">();
	}
	static class ABP_ExtraLock_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ExtraLock_C>();
	}
};
static_assert(alignof(ABP_ExtraLock_C) == 0x000008, "Wrong alignment on ABP_ExtraLock_C");
static_assert(sizeof(ABP_ExtraLock_C) == 0x000358, "Wrong size on ABP_ExtraLock_C");
static_assert(offsetof(ABP_ExtraLock_C, UberGraphFrame_BP_ExtraLock_C) == 0x0002F0, "Member 'ABP_ExtraLock_C::UberGraphFrame_BP_ExtraLock_C' has a wrong offset!");
static_assert(offsetof(ABP_ExtraLock_C, Key) == 0x0002F8, "Member 'ABP_ExtraLock_C::Key' has a wrong offset!");
static_assert(offsetof(ABP_ExtraLock_C, BoxPlate1) == 0x000300, "Member 'ABP_ExtraLock_C::BoxPlate1' has a wrong offset!");
static_assert(offsetof(ABP_ExtraLock_C, BoxPlate) == 0x000308, "Member 'ABP_ExtraLock_C::BoxPlate' has a wrong offset!");
static_assert(offsetof(ABP_ExtraLock_C, Timeline_NewTrack_0_B82D937642554EB7B6BC47A533F3F6E6) == 0x000310, "Member 'ABP_ExtraLock_C::Timeline_NewTrack_0_B82D937642554EB7B6BC47A533F3F6E6' has a wrong offset!");
static_assert(offsetof(ABP_ExtraLock_C, Timeline__Direction_B82D937642554EB7B6BC47A533F3F6E6) == 0x000314, "Member 'ABP_ExtraLock_C::Timeline__Direction_B82D937642554EB7B6BC47A533F3F6E6' has a wrong offset!");
static_assert(offsetof(ABP_ExtraLock_C, Timeline) == 0x000318, "Member 'ABP_ExtraLock_C::Timeline' has a wrong offset!");
static_assert(offsetof(ABP_ExtraLock_C, Player) == 0x000320, "Member 'ABP_ExtraLock_C::Player' has a wrong offset!");
static_assert(offsetof(ABP_ExtraLock_C, PlayerHitComponent) == 0x000328, "Member 'ABP_ExtraLock_C::PlayerHitComponent' has a wrong offset!");
static_assert(offsetof(ABP_ExtraLock_C, StartAnimationSeconds) == 0x000330, "Member 'ABP_ExtraLock_C::StartAnimationSeconds' has a wrong offset!");
static_assert(offsetof(ABP_ExtraLock_C, Unscrewing) == 0x000338, "Member 'ABP_ExtraLock_C::Unscrewing' has a wrong offset!");
static_assert(offsetof(ABP_ExtraLock_C, AnimatingComponent) == 0x000340, "Member 'ABP_ExtraLock_C::AnimatingComponent' has a wrong offset!");
static_assert(offsetof(ABP_ExtraLock_C, MainDoor) == 0x000348, "Member 'ABP_ExtraLock_C::MainDoor' has a wrong offset!");
static_assert(offsetof(ABP_ExtraLock_C, Opened) == 0x000350, "Member 'ABP_ExtraLock_C::Opened' has a wrong offset!");

}

