#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ExtraLock

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ExtraLock.BP_ExtraLock_C.Interact
// 0x00F0 (0x00F0 - 0x0000)
struct BP_ExtraLock_C_Interact final
{
public:
	class ABP_Player_C*                           Param_Player;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x00E8)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_ExtraLock_C_Interact) == 0x000008, "Wrong alignment on BP_ExtraLock_C_Interact");
static_assert(sizeof(BP_ExtraLock_C_Interact) == 0x0000F0, "Wrong size on BP_ExtraLock_C_Interact");
static_assert(offsetof(BP_ExtraLock_C_Interact, Param_Player) == 0x000000, "Member 'BP_ExtraLock_C_Interact::Param_Player' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_Interact, Hit) == 0x000008, "Member 'BP_ExtraLock_C_Interact::Hit' has a wrong offset!");

// Function BP_ExtraLock.BP_ExtraLock_C.GetAllNotUnscrewed
// 0x0058 (0x0058 - 0x0000)
struct BP_ExtraLock_C_GetAllNotUnscrewed final
{
public:
	TArray<class UStaticMeshComponent*>           NewLocalVar1;                                      // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UStaticMeshComponent*>           NewLocalVar;                                       // 0x0010(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2605[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ComponentHasTag_ReturnValue;              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2606[0x2];                                     // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExtraLock_C_GetAllNotUnscrewed) == 0x000008, "Wrong alignment on BP_ExtraLock_C_GetAllNotUnscrewed");
static_assert(sizeof(BP_ExtraLock_C_GetAllNotUnscrewed) == 0x000058, "Wrong size on BP_ExtraLock_C_GetAllNotUnscrewed");
static_assert(offsetof(BP_ExtraLock_C_GetAllNotUnscrewed, NewLocalVar1) == 0x000000, "Member 'BP_ExtraLock_C_GetAllNotUnscrewed::NewLocalVar1' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_GetAllNotUnscrewed, NewLocalVar) == 0x000010, "Member 'BP_ExtraLock_C_GetAllNotUnscrewed::NewLocalVar' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_GetAllNotUnscrewed, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BP_ExtraLock_C_GetAllNotUnscrewed::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_GetAllNotUnscrewed, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'BP_ExtraLock_C_GetAllNotUnscrewed::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_GetAllNotUnscrewed, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_ExtraLock_C_GetAllNotUnscrewed::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_GetAllNotUnscrewed, K2Node_MakeArray_Array) == 0x000030, "Member 'BP_ExtraLock_C_GetAllNotUnscrewed::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_GetAllNotUnscrewed, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_ExtraLock_C_GetAllNotUnscrewed::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_GetAllNotUnscrewed, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_ExtraLock_C_GetAllNotUnscrewed::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_GetAllNotUnscrewed, CallFunc_ComponentHasTag_ReturnValue) == 0x00004C, "Member 'BP_ExtraLock_C_GetAllNotUnscrewed::CallFunc_ComponentHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_GetAllNotUnscrewed, CallFunc_Less_IntInt_ReturnValue) == 0x00004D, "Member 'BP_ExtraLock_C_GetAllNotUnscrewed::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_GetAllNotUnscrewed, CallFunc_Array_Add_ReturnValue) == 0x000050, "Member 'BP_ExtraLock_C_GetAllNotUnscrewed::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_ExtraLock.BP_ExtraLock_C.ExecuteUbergraph_BP_ExtraLock
// 0x0408 (0x0408 - 0x0000)
struct BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2607[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2608[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Player_C*                           K2Node_Event_Player;                               // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0058(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2609[0x2];                                     // 0x0142(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_260A[0x4];                                     // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_260B[0x4];                                     // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ItemInHands_InHands;                      // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_260C[0x7];                                     // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ItemBase_C*                         CallFunc_ItemInHands_ItemRef;                      // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0228(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x0310(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast_1;                // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock) == 0x000008, "Wrong alignment on BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock");
static_assert(sizeof(BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock) == 0x000408, "Wrong size on BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock");
static_assert(offsetof(BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock, EntryPoint) == 0x000000, "Member 'BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock, CallFunc_Lerp_ReturnValue_1) == 0x000010, "Member 'BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock, CallFunc_MakeVector_ReturnValue) == 0x000018, "Member 'BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock, CallFunc_MakeVector_ReturnValue_1) == 0x000030, "Member 'BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock, Temp_bool_Has_Been_Initd_Variable) == 0x000048, "Member 'BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock, Temp_bool_IsClosed_Variable) == 0x000049, "Member 'BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock, K2Node_Event_Player) == 0x000050, "Member 'BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock::K2Node_Event_Player' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock, K2Node_Event_Hit) == 0x000058, "Member 'BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock, CallFunc_BreakHitResult_bBlockingHit) == 0x000140, "Member 'BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock, CallFunc_BreakHitResult_bInitialOverlap) == 0x000141, "Member 'BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock, CallFunc_BreakHitResult_Time) == 0x000144, "Member 'BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock, CallFunc_BreakHitResult_Distance) == 0x000148, "Member 'BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock, CallFunc_BreakHitResult_Location) == 0x000150, "Member 'BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock, CallFunc_BreakHitResult_ImpactPoint) == 0x000168, "Member 'BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock, CallFunc_BreakHitResult_Normal) == 0x000180, "Member 'BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock, CallFunc_BreakHitResult_ImpactNormal) == 0x000198, "Member 'BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock, CallFunc_BreakHitResult_PhysMat) == 0x0001B0, "Member 'BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock, CallFunc_BreakHitResult_HitActor) == 0x0001B8, "Member 'BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock, CallFunc_BreakHitResult_HitComponent) == 0x0001C0, "Member 'BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock, CallFunc_BreakHitResult_HitBoneName) == 0x0001C8, "Member 'BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock, CallFunc_BreakHitResult_BoneName) == 0x0001D0, "Member 'BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock, CallFunc_BreakHitResult_HitItem) == 0x0001D8, "Member 'BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock, CallFunc_BreakHitResult_ElementIndex) == 0x0001DC, "Member 'BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock, CallFunc_BreakHitResult_FaceIndex) == 0x0001E0, "Member 'BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock, CallFunc_BreakHitResult_TraceStart) == 0x0001E8, "Member 'BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock, CallFunc_BreakHitResult_TraceEnd) == 0x000200, "Member 'BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock, CallFunc_ItemInHands_InHands) == 0x000218, "Member 'BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock::CallFunc_ItemInHands_InHands' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock, CallFunc_ItemInHands_ItemRef) == 0x000220, "Member 'BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock::CallFunc_ItemInHands_ItemRef' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000228, "Member 'BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x000310, "Member 'BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock, CallFunc_Lerp_Alpha_ImplicitCast) == 0x0003F8, "Member 'BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock, CallFunc_Lerp_Alpha_ImplicitCast_1) == 0x000400, "Member 'BP_ExtraLock_C_ExecuteUbergraph_BP_ExtraLock::CallFunc_Lerp_Alpha_ImplicitCast_1' has a wrong offset!");

}

