#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GrannyHUD

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_CoreHUD_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GrannyHUD.BP_GrannyHUD_C
// 0x0020 (0x03B8 - 0x0398)
class ABP_GrannyHUD_C final : public ABP_CoreHUD_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_GrannyHUD_C;                     // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_GameCanvas_C*                      GameCanvas;                                        // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_DebugCanvas_C*                     DebugCanvasRef;                                    // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Note_C*                            NoteWidget;                                        // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ToggleMenu();
	void ShowNote(const class FText& NoteText);
	void ReceiveBeginPlay();
	void PrintDebugString(const class FString& String, bool PrintToLog, const struct FLinearColor& Text_Color, double Duration);
	void ExecuteUbergraph_BP_GrannyHUD(int32 EntryPoint);
	void CallNotification(const class FText& WriteText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GrannyHUD_C">();
	}
	static class ABP_GrannyHUD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GrannyHUD_C>();
	}
};
static_assert(alignof(ABP_GrannyHUD_C) == 0x000008, "Wrong alignment on ABP_GrannyHUD_C");
static_assert(sizeof(ABP_GrannyHUD_C) == 0x0003B8, "Wrong size on ABP_GrannyHUD_C");
static_assert(offsetof(ABP_GrannyHUD_C, UberGraphFrame_BP_GrannyHUD_C) == 0x000398, "Member 'ABP_GrannyHUD_C::UberGraphFrame_BP_GrannyHUD_C' has a wrong offset!");
static_assert(offsetof(ABP_GrannyHUD_C, GameCanvas) == 0x0003A0, "Member 'ABP_GrannyHUD_C::GameCanvas' has a wrong offset!");
static_assert(offsetof(ABP_GrannyHUD_C, DebugCanvasRef) == 0x0003A8, "Member 'ABP_GrannyHUD_C::DebugCanvasRef' has a wrong offset!");
static_assert(offsetof(ABP_GrannyHUD_C, NoteWidget) == 0x0003B0, "Member 'ABP_GrannyHUD_C::NoteWidget' has a wrong offset!");

}

