#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Granny

#include "Basic.hpp"

#include "ST_Task_structs.hpp"
#include "AIModule_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "EDifficulty_structs.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK::Params
{

// Function BP_Granny.BP_Granny_C.TasksDebug
// 0x0180 (0x0180 - 0x0000)
struct BP_Granny_C_TasksDebug final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24D0[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class AAiTask_C*>                      CallFunc_GetAllActorsOfClass_OutActors;            // 0x0040(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24D1[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAiTask_C*                              CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24D2[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue_1;        // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue_2;        // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_9;              // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_10;             // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_11;             // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_LinearColorLerp_Alpha_ImplicitCast;       // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Granny_C_TasksDebug) == 0x000008, "Wrong alignment on BP_Granny_C_TasksDebug");
static_assert(sizeof(BP_Granny_C_TasksDebug) == 0x000180, "Wrong size on BP_Granny_C_TasksDebug");
static_assert(offsetof(BP_Granny_C_TasksDebug, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_Granny_C_TasksDebug::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_TasksDebug, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_Granny_C_TasksDebug::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_TasksDebug, CallFunc_Conv_IntToString_ReturnValue) == 0x000008, "Member 'BP_Granny_C_TasksDebug::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_TasksDebug, CallFunc_Concat_StrStr_ReturnValue) == 0x000018, "Member 'BP_Granny_C_TasksDebug::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_TasksDebug, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_Granny_C_TasksDebug::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_TasksDebug, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000030, "Member 'BP_Granny_C_TasksDebug::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_TasksDebug, CallFunc_GetAllActorsOfClass_OutActors) == 0x000040, "Member 'BP_Granny_C_TasksDebug::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_TasksDebug, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'BP_Granny_C_TasksDebug::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_TasksDebug, CallFunc_Array_Get_Item) == 0x000058, "Member 'BP_Granny_C_TasksDebug::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_TasksDebug, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'BP_Granny_C_TasksDebug::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_TasksDebug, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000068, "Member 'BP_Granny_C_TasksDebug::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_TasksDebug, CallFunc_Conv_NameToString_ReturnValue) == 0x000078, "Member 'BP_Granny_C_TasksDebug::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_TasksDebug, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000088, "Member 'BP_Granny_C_TasksDebug::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_TasksDebug, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000098, "Member 'BP_Granny_C_TasksDebug::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_TasksDebug, CallFunc_SelectString_ReturnValue) == 0x0000A8, "Member 'BP_Granny_C_TasksDebug::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_TasksDebug, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000B8, "Member 'BP_Granny_C_TasksDebug::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_TasksDebug, CallFunc_Conv_DoubleToString_ReturnValue_1) == 0x0000C8, "Member 'BP_Granny_C_TasksDebug::CallFunc_Conv_DoubleToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_TasksDebug, CallFunc_LinearColorLerp_ReturnValue) == 0x0000D8, "Member 'BP_Granny_C_TasksDebug::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_TasksDebug, CallFunc_Conv_DoubleToString_ReturnValue_2) == 0x0000E8, "Member 'BP_Granny_C_TasksDebug::CallFunc_Conv_DoubleToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_TasksDebug, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0000F8, "Member 'BP_Granny_C_TasksDebug::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_TasksDebug, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000108, "Member 'BP_Granny_C_TasksDebug::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_TasksDebug, CallFunc_Concat_StrStr_ReturnValue_6) == 0x000118, "Member 'BP_Granny_C_TasksDebug::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_TasksDebug, CallFunc_Concat_StrStr_ReturnValue_7) == 0x000128, "Member 'BP_Granny_C_TasksDebug::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_TasksDebug, CallFunc_Concat_StrStr_ReturnValue_8) == 0x000138, "Member 'BP_Granny_C_TasksDebug::CallFunc_Concat_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_TasksDebug, CallFunc_Concat_StrStr_ReturnValue_9) == 0x000148, "Member 'BP_Granny_C_TasksDebug::CallFunc_Concat_StrStr_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_TasksDebug, CallFunc_Concat_StrStr_ReturnValue_10) == 0x000158, "Member 'BP_Granny_C_TasksDebug::CallFunc_Concat_StrStr_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_TasksDebug, CallFunc_Concat_StrStr_ReturnValue_11) == 0x000168, "Member 'BP_Granny_C_TasksDebug::CallFunc_Concat_StrStr_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_TasksDebug, CallFunc_LinearColorLerp_Alpha_ImplicitCast) == 0x000178, "Member 'BP_Granny_C_TasksDebug::CallFunc_LinearColorLerp_Alpha_ImplicitCast' has a wrong offset!");

// Function BP_Granny.BP_Granny_C.TaskComplete_Event
// 0x0020 (0x0020 - 0x0000)
struct BP_Granny_C_TaskComplete_Event final
{
public:
	struct FST_Task                               Task;                                              // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Granny_C_TaskComplete_Event) == 0x000008, "Wrong alignment on BP_Granny_C_TaskComplete_Event");
static_assert(sizeof(BP_Granny_C_TaskComplete_Event) == 0x000020, "Wrong size on BP_Granny_C_TaskComplete_Event");
static_assert(offsetof(BP_Granny_C_TaskComplete_Event, Task) == 0x000000, "Member 'BP_Granny_C_TaskComplete_Event::Task' has a wrong offset!");

// Function BP_Granny.BP_Granny_C.StartNoiseSeeking
// 0x0018 (0x0018 - 0x0000)
struct BP_Granny_C_StartNoiseSeeking final
{
public:
	struct FVector                                NoiseLocation;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Granny_C_StartNoiseSeeking) == 0x000008, "Wrong alignment on BP_Granny_C_StartNoiseSeeking");
static_assert(sizeof(BP_Granny_C_StartNoiseSeeking) == 0x000018, "Wrong size on BP_Granny_C_StartNoiseSeeking");
static_assert(offsetof(BP_Granny_C_StartNoiseSeeking, NoiseLocation) == 0x000000, "Member 'BP_Granny_C_StartNoiseSeeking::NoiseLocation' has a wrong offset!");

// Function BP_Granny.BP_Granny_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Granny_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Granny_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Granny_C_ReceiveTick");
static_assert(sizeof(BP_Granny_C_ReceiveTick) == 0x000004, "Wrong size on BP_Granny_C_ReceiveTick");
static_assert(offsetof(BP_Granny_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Granny_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Granny.BP_Granny_C.OpenDoor
// 0x0240 (0x0240 - 0x0000)
struct BP_Granny_C_OpenDoor final
{
public:
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0000(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0070(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24D3[0x1];                                     // 0x015B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24D4[0x4];                                     // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24D5[0x4];                                     // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DoorActor_C*                        K2Node_DynamicCast_AsBP_Door_Actor;                // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Granny_C_OpenDoor) == 0x000008, "Wrong alignment on BP_Granny_C_OpenDoor");
static_assert(sizeof(BP_Granny_C_OpenDoor) == 0x000240, "Wrong size on BP_Granny_C_OpenDoor");
static_assert(offsetof(BP_Granny_C_OpenDoor, Temp_object_Variable) == 0x000000, "Member 'BP_Granny_C_OpenDoor::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_OpenDoor, CallFunc_GetActorForwardVector_ReturnValue) == 0x000010, "Member 'BP_Granny_C_OpenDoor::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_OpenDoor, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'BP_Granny_C_OpenDoor::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_OpenDoor, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000040, "Member 'BP_Granny_C_OpenDoor::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_OpenDoor, CallFunc_Add_VectorVector_ReturnValue) == 0x000058, "Member 'BP_Granny_C_OpenDoor::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_OpenDoor, CallFunc_LineTraceSingle_OutHit) == 0x000070, "Member 'BP_Granny_C_OpenDoor::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_OpenDoor, CallFunc_LineTraceSingle_ReturnValue) == 0x000158, "Member 'BP_Granny_C_OpenDoor::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_OpenDoor, CallFunc_BreakHitResult_bBlockingHit) == 0x000159, "Member 'BP_Granny_C_OpenDoor::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_OpenDoor, CallFunc_BreakHitResult_bInitialOverlap) == 0x00015A, "Member 'BP_Granny_C_OpenDoor::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_OpenDoor, CallFunc_BreakHitResult_Time) == 0x00015C, "Member 'BP_Granny_C_OpenDoor::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_OpenDoor, CallFunc_BreakHitResult_Distance) == 0x000160, "Member 'BP_Granny_C_OpenDoor::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_OpenDoor, CallFunc_BreakHitResult_Location) == 0x000168, "Member 'BP_Granny_C_OpenDoor::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_OpenDoor, CallFunc_BreakHitResult_ImpactPoint) == 0x000180, "Member 'BP_Granny_C_OpenDoor::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_OpenDoor, CallFunc_BreakHitResult_Normal) == 0x000198, "Member 'BP_Granny_C_OpenDoor::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_OpenDoor, CallFunc_BreakHitResult_ImpactNormal) == 0x0001B0, "Member 'BP_Granny_C_OpenDoor::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_OpenDoor, CallFunc_BreakHitResult_PhysMat) == 0x0001C8, "Member 'BP_Granny_C_OpenDoor::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_OpenDoor, CallFunc_BreakHitResult_HitActor) == 0x0001D0, "Member 'BP_Granny_C_OpenDoor::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_OpenDoor, CallFunc_BreakHitResult_HitComponent) == 0x0001D8, "Member 'BP_Granny_C_OpenDoor::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_OpenDoor, CallFunc_BreakHitResult_HitBoneName) == 0x0001E0, "Member 'BP_Granny_C_OpenDoor::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_OpenDoor, CallFunc_BreakHitResult_BoneName) == 0x0001E8, "Member 'BP_Granny_C_OpenDoor::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_OpenDoor, CallFunc_BreakHitResult_HitItem) == 0x0001F0, "Member 'BP_Granny_C_OpenDoor::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_OpenDoor, CallFunc_BreakHitResult_ElementIndex) == 0x0001F4, "Member 'BP_Granny_C_OpenDoor::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_OpenDoor, CallFunc_BreakHitResult_FaceIndex) == 0x0001F8, "Member 'BP_Granny_C_OpenDoor::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_OpenDoor, CallFunc_BreakHitResult_TraceStart) == 0x000200, "Member 'BP_Granny_C_OpenDoor::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_OpenDoor, CallFunc_BreakHitResult_TraceEnd) == 0x000218, "Member 'BP_Granny_C_OpenDoor::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_OpenDoor, K2Node_DynamicCast_AsBP_Door_Actor) == 0x000230, "Member 'BP_Granny_C_OpenDoor::K2Node_DynamicCast_AsBP_Door_Actor' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_OpenDoor, K2Node_DynamicCast_bSuccess) == 0x000238, "Member 'BP_Granny_C_OpenDoor::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_Granny.BP_Granny_C.OnSuccess_E8896B7E4F9BD749C50E528AB02748E9
// 0x0001 (0x0001 - 0x0000)
struct BP_Granny_C_OnSuccess_E8896B7E4F9BD749C50E528AB02748E9 final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Granny_C_OnSuccess_E8896B7E4F9BD749C50E528AB02748E9) == 0x000001, "Wrong alignment on BP_Granny_C_OnSuccess_E8896B7E4F9BD749C50E528AB02748E9");
static_assert(sizeof(BP_Granny_C_OnSuccess_E8896B7E4F9BD749C50E528AB02748E9) == 0x000001, "Wrong size on BP_Granny_C_OnSuccess_E8896B7E4F9BD749C50E528AB02748E9");
static_assert(offsetof(BP_Granny_C_OnSuccess_E8896B7E4F9BD749C50E528AB02748E9, MovementResult) == 0x000000, "Member 'BP_Granny_C_OnSuccess_E8896B7E4F9BD749C50E528AB02748E9::MovementResult' has a wrong offset!");

// Function BP_Granny.BP_Granny_C.OnSuccess_77A6E78F4B82EDA58966EA84452C11C8
// 0x0001 (0x0001 - 0x0000)
struct BP_Granny_C_OnSuccess_77A6E78F4B82EDA58966EA84452C11C8 final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Granny_C_OnSuccess_77A6E78F4B82EDA58966EA84452C11C8) == 0x000001, "Wrong alignment on BP_Granny_C_OnSuccess_77A6E78F4B82EDA58966EA84452C11C8");
static_assert(sizeof(BP_Granny_C_OnSuccess_77A6E78F4B82EDA58966EA84452C11C8) == 0x000001, "Wrong size on BP_Granny_C_OnSuccess_77A6E78F4B82EDA58966EA84452C11C8");
static_assert(offsetof(BP_Granny_C_OnSuccess_77A6E78F4B82EDA58966EA84452C11C8, MovementResult) == 0x000000, "Member 'BP_Granny_C_OnSuccess_77A6E78F4B82EDA58966EA84452C11C8::MovementResult' has a wrong offset!");

// Function BP_Granny.BP_Granny_C.OnSuccess_6C2D868343FB20CA9ED08CABE6031AA2
// 0x0001 (0x0001 - 0x0000)
struct BP_Granny_C_OnSuccess_6C2D868343FB20CA9ED08CABE6031AA2 final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Granny_C_OnSuccess_6C2D868343FB20CA9ED08CABE6031AA2) == 0x000001, "Wrong alignment on BP_Granny_C_OnSuccess_6C2D868343FB20CA9ED08CABE6031AA2");
static_assert(sizeof(BP_Granny_C_OnSuccess_6C2D868343FB20CA9ED08CABE6031AA2) == 0x000001, "Wrong size on BP_Granny_C_OnSuccess_6C2D868343FB20CA9ED08CABE6031AA2");
static_assert(offsetof(BP_Granny_C_OnSuccess_6C2D868343FB20CA9ED08CABE6031AA2, MovementResult) == 0x000000, "Member 'BP_Granny_C_OnSuccess_6C2D868343FB20CA9ED08CABE6031AA2::MovementResult' has a wrong offset!");

// Function BP_Granny.BP_Granny_C.OnFail_E8896B7E4F9BD749C50E528AB02748E9
// 0x0001 (0x0001 - 0x0000)
struct BP_Granny_C_OnFail_E8896B7E4F9BD749C50E528AB02748E9 final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Granny_C_OnFail_E8896B7E4F9BD749C50E528AB02748E9) == 0x000001, "Wrong alignment on BP_Granny_C_OnFail_E8896B7E4F9BD749C50E528AB02748E9");
static_assert(sizeof(BP_Granny_C_OnFail_E8896B7E4F9BD749C50E528AB02748E9) == 0x000001, "Wrong size on BP_Granny_C_OnFail_E8896B7E4F9BD749C50E528AB02748E9");
static_assert(offsetof(BP_Granny_C_OnFail_E8896B7E4F9BD749C50E528AB02748E9, MovementResult) == 0x000000, "Member 'BP_Granny_C_OnFail_E8896B7E4F9BD749C50E528AB02748E9::MovementResult' has a wrong offset!");

// Function BP_Granny.BP_Granny_C.OnFail_77A6E78F4B82EDA58966EA84452C11C8
// 0x0001 (0x0001 - 0x0000)
struct BP_Granny_C_OnFail_77A6E78F4B82EDA58966EA84452C11C8 final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Granny_C_OnFail_77A6E78F4B82EDA58966EA84452C11C8) == 0x000001, "Wrong alignment on BP_Granny_C_OnFail_77A6E78F4B82EDA58966EA84452C11C8");
static_assert(sizeof(BP_Granny_C_OnFail_77A6E78F4B82EDA58966EA84452C11C8) == 0x000001, "Wrong size on BP_Granny_C_OnFail_77A6E78F4B82EDA58966EA84452C11C8");
static_assert(offsetof(BP_Granny_C_OnFail_77A6E78F4B82EDA58966EA84452C11C8, MovementResult) == 0x000000, "Member 'BP_Granny_C_OnFail_77A6E78F4B82EDA58966EA84452C11C8::MovementResult' has a wrong offset!");

// Function BP_Granny.BP_Granny_C.OnFail_6C2D868343FB20CA9ED08CABE6031AA2
// 0x0001 (0x0001 - 0x0000)
struct BP_Granny_C_OnFail_6C2D868343FB20CA9ED08CABE6031AA2 final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Granny_C_OnFail_6C2D868343FB20CA9ED08CABE6031AA2) == 0x000001, "Wrong alignment on BP_Granny_C_OnFail_6C2D868343FB20CA9ED08CABE6031AA2");
static_assert(sizeof(BP_Granny_C_OnFail_6C2D868343FB20CA9ED08CABE6031AA2) == 0x000001, "Wrong size on BP_Granny_C_OnFail_6C2D868343FB20CA9ED08CABE6031AA2");
static_assert(offsetof(BP_Granny_C_OnFail_6C2D868343FB20CA9ED08CABE6031AA2, MovementResult) == 0x000000, "Member 'BP_Granny_C_OnFail_6C2D868343FB20CA9ED08CABE6031AA2::MovementResult' has a wrong offset!");

// Function BP_Granny.BP_Granny_C.NightmareImprovements
// 0x0018 (0x0018 - 0x0000)
struct BP_Granny_C_NightmareImprovements final
{
public:
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GameInstanceMain_C*                 K2Node_DynamicCast_AsBP_Game_Instance_Main;        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Granny_C_NightmareImprovements) == 0x000008, "Wrong alignment on BP_Granny_C_NightmareImprovements");
static_assert(sizeof(BP_Granny_C_NightmareImprovements) == 0x000018, "Wrong size on BP_Granny_C_NightmareImprovements");
static_assert(offsetof(BP_Granny_C_NightmareImprovements, CallFunc_GetGameInstance_ReturnValue) == 0x000000, "Member 'BP_Granny_C_NightmareImprovements::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_NightmareImprovements, K2Node_DynamicCast_AsBP_Game_Instance_Main) == 0x000008, "Member 'BP_Granny_C_NightmareImprovements::K2Node_DynamicCast_AsBP_Game_Instance_Main' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_NightmareImprovements, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_Granny_C_NightmareImprovements::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_Granny.BP_Granny_C.NearTheGoodTrapPoint
// 0x0038 (0x0038 - 0x0000)
struct BP_Granny_C_NearTheGoodTrapPoint final
{
public:
	bool                                          GoodPlace;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewLocalVar;                                       // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24D6[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24D7[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATargetPoint*                           CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24D8[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24D9[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Granny_C_NearTheGoodTrapPoint) == 0x000008, "Wrong alignment on BP_Granny_C_NearTheGoodTrapPoint");
static_assert(sizeof(BP_Granny_C_NearTheGoodTrapPoint) == 0x000038, "Wrong size on BP_Granny_C_NearTheGoodTrapPoint");
static_assert(offsetof(BP_Granny_C_NearTheGoodTrapPoint, GoodPlace) == 0x000000, "Member 'BP_Granny_C_NearTheGoodTrapPoint::GoodPlace' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_NearTheGoodTrapPoint, NewLocalVar) == 0x000001, "Member 'BP_Granny_C_NearTheGoodTrapPoint::NewLocalVar' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_NearTheGoodTrapPoint, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_Granny_C_NearTheGoodTrapPoint::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_NearTheGoodTrapPoint, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_Granny_C_NearTheGoodTrapPoint::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_NearTheGoodTrapPoint, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_Granny_C_NearTheGoodTrapPoint::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_NearTheGoodTrapPoint, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'BP_Granny_C_NearTheGoodTrapPoint::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_NearTheGoodTrapPoint, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_Granny_C_NearTheGoodTrapPoint::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_NearTheGoodTrapPoint, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'BP_Granny_C_NearTheGoodTrapPoint::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_NearTheGoodTrapPoint, CallFunc_GetDistanceTo_ReturnValue) == 0x000024, "Member 'BP_Granny_C_NearTheGoodTrapPoint::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_NearTheGoodTrapPoint, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_Granny_C_NearTheGoodTrapPoint::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_NearTheGoodTrapPoint, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000030, "Member 'BP_Granny_C_NearTheGoodTrapPoint::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_Granny.BP_Granny_C.HeadAnimation
// 0x0140 (0x0140 - 0x0000)
struct BP_Granny_C_HeadAnimation final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24DA[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AiHasTask_Return;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24DB[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_1;     // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue_1;          // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue_1;         // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24DC[0x6];                                     // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Granny_C_HeadAnimation) == 0x000008, "Wrong alignment on BP_Granny_C_HeadAnimation");
static_assert(sizeof(BP_Granny_C_HeadAnimation) == 0x000140, "Wrong size on BP_Granny_C_HeadAnimation");
static_assert(offsetof(BP_Granny_C_HeadAnimation, Temp_bool_Variable) == 0x000000, "Member 'BP_Granny_C_HeadAnimation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_HeadAnimation, Temp_real_Variable) == 0x000008, "Member 'BP_Granny_C_HeadAnimation::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_HeadAnimation, Temp_real_Variable_1) == 0x000010, "Member 'BP_Granny_C_HeadAnimation::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_HeadAnimation, CallFunc_AiHasTask_Return) == 0x000018, "Member 'BP_Granny_C_HeadAnimation::CallFunc_AiHasTask_Return' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_HeadAnimation, CallFunc_GetSocketLocation_ReturnValue) == 0x000020, "Member 'BP_Granny_C_HeadAnimation::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_HeadAnimation, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000038, "Member 'BP_Granny_C_HeadAnimation::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_HeadAnimation, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000040, "Member 'BP_Granny_C_HeadAnimation::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_HeadAnimation, CallFunc_GetActorForwardVector_ReturnValue) == 0x000048, "Member 'BP_Granny_C_HeadAnimation::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_HeadAnimation, CallFunc_GetCameraLocation_ReturnValue) == 0x000060, "Member 'BP_Granny_C_HeadAnimation::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_HeadAnimation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000078, "Member 'BP_Granny_C_HeadAnimation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_HeadAnimation, CallFunc_FindLookAtRotation_ReturnValue) == 0x000090, "Member 'BP_Granny_C_HeadAnimation::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_HeadAnimation, CallFunc_GetPlayerCameraManager_ReturnValue_1) == 0x0000A8, "Member 'BP_Granny_C_HeadAnimation::CallFunc_GetPlayerCameraManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_HeadAnimation, CallFunc_GetCameraLocation_ReturnValue_1) == 0x0000B0, "Member 'BP_Granny_C_HeadAnimation::CallFunc_GetCameraLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_HeadAnimation, CallFunc_FindLookAtRotation_ReturnValue_1) == 0x0000C8, "Member 'BP_Granny_C_HeadAnimation::CallFunc_FindLookAtRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_HeadAnimation, CallFunc_GetRightVector_ReturnValue) == 0x0000E0, "Member 'BP_Granny_C_HeadAnimation::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_HeadAnimation, CallFunc_Cross_VectorVector_ReturnValue) == 0x0000F8, "Member 'BP_Granny_C_HeadAnimation::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_HeadAnimation, CallFunc_BreakVector_X) == 0x000110, "Member 'BP_Granny_C_HeadAnimation::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_HeadAnimation, CallFunc_BreakVector_Y) == 0x000118, "Member 'BP_Granny_C_HeadAnimation::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_HeadAnimation, CallFunc_BreakVector_Z) == 0x000120, "Member 'BP_Granny_C_HeadAnimation::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_HeadAnimation, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000128, "Member 'BP_Granny_C_HeadAnimation::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_HeadAnimation, CallFunc_BooleanAND_ReturnValue) == 0x000129, "Member 'BP_Granny_C_HeadAnimation::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_HeadAnimation, K2Node_Select_Default) == 0x000130, "Member 'BP_Granny_C_HeadAnimation::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_HeadAnimation, CallFunc_FInterpTo_ReturnValue) == 0x000138, "Member 'BP_Granny_C_HeadAnimation::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");

// Function BP_Granny.BP_Granny_C.GrannySeePlayer
// 0x00F8 (0x00F8 - 0x0000)
struct BP_Granny_C_GrannySeePlayer final
{
public:
	class ABP_Player_C*                           Param_Player;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          See;                                               // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24DD[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         NewLocalVar_10;                                    // 0x0010(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class AActor*>                         NewLocalVar_1;                                     // 0x0020(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class ABP_Player_C*                           NewLocalVar_0;                                     // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          NewLocalVar;                                       // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24DE[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetActorsInCamera_Actors;                 // 0x0058(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24DF[0x5];                                     // 0x008B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24E0[0x6];                                     // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_B_ImplicitCast;         // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Granny_C_GrannySeePlayer) == 0x000008, "Wrong alignment on BP_Granny_C_GrannySeePlayer");
static_assert(sizeof(BP_Granny_C_GrannySeePlayer) == 0x0000F8, "Wrong size on BP_Granny_C_GrannySeePlayer");
static_assert(offsetof(BP_Granny_C_GrannySeePlayer, Param_Player) == 0x000000, "Member 'BP_Granny_C_GrannySeePlayer::Param_Player' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_GrannySeePlayer, See) == 0x000008, "Member 'BP_Granny_C_GrannySeePlayer::See' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_GrannySeePlayer, NewLocalVar_10) == 0x000010, "Member 'BP_Granny_C_GrannySeePlayer::NewLocalVar_10' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_GrannySeePlayer, NewLocalVar_1) == 0x000020, "Member 'BP_Granny_C_GrannySeePlayer::NewLocalVar_1' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_GrannySeePlayer, NewLocalVar_0) == 0x000030, "Member 'BP_Granny_C_GrannySeePlayer::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_GrannySeePlayer, NewLocalVar) == 0x000038, "Member 'BP_Granny_C_GrannySeePlayer::NewLocalVar' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_GrannySeePlayer, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000040, "Member 'BP_Granny_C_GrannySeePlayer::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_GrannySeePlayer, CallFunc_GetActorsInCamera_Actors) == 0x000058, "Member 'BP_Granny_C_GrannySeePlayer::CallFunc_GetActorsInCamera_Actors' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_GrannySeePlayer, CallFunc_GetForwardVector_ReturnValue) == 0x000068, "Member 'BP_Granny_C_GrannySeePlayer::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_GrannySeePlayer, CallFunc_GetDistanceTo_ReturnValue) == 0x000080, "Member 'BP_Granny_C_GrannySeePlayer::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_GrannySeePlayer, CallFunc_Array_Find_ReturnValue) == 0x000084, "Member 'BP_Granny_C_GrannySeePlayer::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_GrannySeePlayer, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000088, "Member 'BP_Granny_C_GrannySeePlayer::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_GrannySeePlayer, CallFunc_BooleanAND_ReturnValue) == 0x000089, "Member 'BP_Granny_C_GrannySeePlayer::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_GrannySeePlayer, CallFunc_Less_DoubleDouble_ReturnValue) == 0x00008A, "Member 'BP_Granny_C_GrannySeePlayer::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_GrannySeePlayer, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000090, "Member 'BP_Granny_C_GrannySeePlayer::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_GrannySeePlayer, CallFunc_FindLookAtRotation_ReturnValue) == 0x0000A8, "Member 'BP_Granny_C_GrannySeePlayer::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_GrannySeePlayer, CallFunc_GetForwardVector_ReturnValue_1) == 0x0000C0, "Member 'BP_Granny_C_GrannySeePlayer::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_GrannySeePlayer, CallFunc_Dot_VectorVector_ReturnValue) == 0x0000D8, "Member 'BP_Granny_C_GrannySeePlayer::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_GrannySeePlayer, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000E0, "Member 'BP_Granny_C_GrannySeePlayer::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_GrannySeePlayer, CallFunc_BooleanAND_ReturnValue_1) == 0x0000E1, "Member 'BP_Granny_C_GrannySeePlayer::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_GrannySeePlayer, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x0000E8, "Member 'BP_Granny_C_GrannySeePlayer::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_GrannySeePlayer, CallFunc_Less_DoubleDouble_B_ImplicitCast) == 0x0000F0, "Member 'BP_Granny_C_GrannySeePlayer::CallFunc_Less_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function BP_Granny.BP_Granny_C.GetSenseStrength
// 0x0028 (0x0028 - 0x0000)
struct BP_Granny_C_GetSenseStrength final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue1;                                      // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue2;                                      // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                NewLocalVar_9;                                     // 0x0010(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         StartNum;                                          // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Granny_C_GetSenseStrength) == 0x000008, "Wrong alignment on BP_Granny_C_GetSenseStrength");
static_assert(sizeof(BP_Granny_C_GetSenseStrength) == 0x000028, "Wrong size on BP_Granny_C_GetSenseStrength");
static_assert(offsetof(BP_Granny_C_GetSenseStrength, ReturnValue) == 0x000000, "Member 'BP_Granny_C_GetSenseStrength::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_GetSenseStrength, ReturnValue1) == 0x000008, "Member 'BP_Granny_C_GetSenseStrength::ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_GetSenseStrength, ReturnValue2) == 0x00000C, "Member 'BP_Granny_C_GetSenseStrength::ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_GetSenseStrength, NewLocalVar_9) == 0x000010, "Member 'BP_Granny_C_GetSenseStrength::NewLocalVar_9' has a wrong offset!");
static_assert(offsetof(BP_Granny_C_GetSenseStrength, StartNum) == 0x000020, "Member 'BP_Granny_C_GetSenseStrength::StartNum' has a wrong offset!");

// Function BP_Granny.BP_Granny_C.GetRandomPointInTorus
// 0x01C0 (0x01C0 - 0x0000)
struct BP_Granny_C_GetRandomPointInTorus final
{
public:
	struct FVector                                Param_Center;                                      // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Up;                                                // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Forward;                                           // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TorusRadius;                                       // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TorusThikness;                                     // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Angle;                                             // 0x0058(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Subdivisions;                                      // 0x0060(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24E1[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Point;                                             // 0x0068(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        Points;                                            // 0x0080(0x0010)(Edit, BlueprintVisible)
	TArray<struct FLinearColor>                   NewLocalVar_6;                                     // 0x0090(0x0010)(Edit, BlueprintVisible)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Random_OutItem;                     // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
