#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GrannyGamemode

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GrannyGamemode.BP_GrannyGamemode_C
// 0x00A0 (0x03D0 - 0x0330)
class ABP_GrannyGamemode_C final : public AGameModeBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Day;                                               // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29A9[0x4];                                     // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DoorCode;                                          // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          PictureRestored;                                   // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SpawnImediately;                                   // 0x0359(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29AA[0x6];                                     // 0x035A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         Items;                                             // 0x0360(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         ItemsRandomKey;                                    // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRandomStream                          GameSeed;                                          // 0x0374(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor)
	int32                                         SpawnPointIndex;                                   // 0x037C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ItemSpawnPoint_C*                   SpawningIterationSpawnPoint;                       // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_ItemSpawnPoint_C*>           SpawnPoints;                                       // 0x0388(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class ABP_ItemSpawnPoint_C*>           Suitable_Points;                                   // 0x0398(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             ItemsSpawned;                                      // 0x03A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             GameRestarted;                                     // 0x03B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        RockSize;                                          // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ThirdDayImprovements();
	void SpawnItems();
	void SpawnItem(class UClass* Item);
	void ShuffleArrayWithSeed(TArray<class UClass*>& ItemsArray, const struct FRandomStream& Stream, TArray<class UClass*>* ShuffledArray);
	void SecondDayImprovements();
	void RestartGame();
	void RespawnGranny();
	void ReceiveBeginPlay();
	void OnFinished_Event();
	void ItemWhitelisted(class UClass* Item, class ABP_ItemSpawnPoint_C* SpawnPoint, bool* Whitelisted);
	void ItemsSpawned__DelegateSignature();
	void GetSuitablePoint(class UClass* Item, TArray<class ABP_ItemSpawnPoint_C*>* SuitablePoints);
	void GetNotOccupiedSpawnPoints(TArray<class ABP_ItemSpawnPoint_C*>* NotOccupiedPoints);
	void GameRestarted__DelegateSignature();
	void FourDay();
	void ExecuteUbergraph_BP_GrannyGamemode(int32 EntryPoint);
	const struct FTransform DaySpawnPoint();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GrannyGamemode_C">();
	}
	static class ABP_GrannyGamemode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GrannyGamemode_C>();
	}
};
static_assert(alignof(ABP_GrannyGamemode_C) == 0x000008, "Wrong alignment on ABP_GrannyGamemode_C");
static_assert(sizeof(ABP_GrannyGamemode_C) == 0x0003D0, "Wrong size on ABP_GrannyGamemode_C");
static_assert(offsetof(ABP_GrannyGamemode_C, UberGraphFrame) == 0x000330, "Member 'ABP_GrannyGamemode_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_GrannyGamemode_C, DefaultSceneRoot) == 0x000338, "Member 'ABP_GrannyGamemode_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_GrannyGamemode_C, Day) == 0x000340, "Member 'ABP_GrannyGamemode_C::Day' has a wrong offset!");
static_assert(offsetof(ABP_GrannyGamemode_C, DoorCode) == 0x000348, "Member 'ABP_GrannyGamemode_C::DoorCode' has a wrong offset!");
static_assert(offsetof(ABP_GrannyGamemode_C, PictureRestored) == 0x000358, "Member 'ABP_GrannyGamemode_C::PictureRestored' has a wrong offset!");
static_assert(offsetof(ABP_GrannyGamemode_C, SpawnImediately) == 0x000359, "Member 'ABP_GrannyGamemode_C::SpawnImediately' has a wrong offset!");
static_assert(offsetof(ABP_GrannyGamemode_C, Items) == 0x000360, "Member 'ABP_GrannyGamemode_C::Items' has a wrong offset!");
static_assert(offsetof(ABP_GrannyGamemode_C, ItemsRandomKey) == 0x000370, "Member 'ABP_GrannyGamemode_C::ItemsRandomKey' has a wrong offset!");
static_assert(offsetof(ABP_GrannyGamemode_C, GameSeed) == 0x000374, "Member 'ABP_GrannyGamemode_C::GameSeed' has a wrong offset!");
static_assert(offsetof(ABP_GrannyGamemode_C, SpawnPointIndex) == 0x00037C, "Member 'ABP_GrannyGamemode_C::SpawnPointIndex' has a wrong offset!");
static_assert(offsetof(ABP_GrannyGamemode_C, SpawningIterationSpawnPoint) == 0x000380, "Member 'ABP_GrannyGamemode_C::SpawningIterationSpawnPoint' has a wrong offset!");
static_assert(offsetof(ABP_GrannyGamemode_C, SpawnPoints) == 0x000388, "Member 'ABP_GrannyGamemode_C::SpawnPoints' has a wrong offset!");
static_assert(offsetof(ABP_GrannyGamemode_C, Suitable_Points) == 0x000398, "Member 'ABP_GrannyGamemode_C::Suitable_Points' has a wrong offset!");
static_assert(offsetof(ABP_GrannyGamemode_C, ItemsSpawned) == 0x0003A8, "Member 'ABP_GrannyGamemode_C::ItemsSpawned' has a wrong offset!");
static_assert(offsetof(ABP_GrannyGamemode_C, GameRestarted) == 0x0003B8, "Member 'ABP_GrannyGamemode_C::GameRestarted' has a wrong offset!");
static_assert(offsetof(ABP_GrannyGamemode_C, RockSize) == 0x0003C8, "Member 'ABP_GrannyGamemode_C::RockSize' has a wrong offset!");

}

