#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GrannyController

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_CoreController_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GrannyController.BP_GrannyController_C
// 0x0038 (0x0890 - 0x0858)
class ABP_GrannyController_C final : public ABP_CoreController_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_GrannyController_C;              // 0x0858(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Look;                                              // 0x0860(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2804[0x7];                                     // 0x0861(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GameInstanceMain_C*                 As_BP_Game_Instance_Main;                          // 0x0868(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_CameraPawn_C*                       CameraPawn;                                        // 0x0870(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  BeginPlayPawn;                                     // 0x0878(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              LookVector;                                        // 0x0880(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void InpActEvt_IA_Pause_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_3(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_2(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_1(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void FindPlayerAndPossess();
	void ExecuteUbergraph_BP_GrannyController(int32 EntryPoint);
	void AddInputMapping();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GrannyController_C">();
	}
	static class ABP_GrannyController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GrannyController_C>();
	}
};
static_assert(alignof(ABP_GrannyController_C) == 0x000008, "Wrong alignment on ABP_GrannyController_C");
static_assert(sizeof(ABP_GrannyController_C) == 0x000890, "Wrong size on ABP_GrannyController_C");
static_assert(offsetof(ABP_GrannyController_C, UberGraphFrame_BP_GrannyController_C) == 0x000858, "Member 'ABP_GrannyController_C::UberGraphFrame_BP_GrannyController_C' has a wrong offset!");
static_assert(offsetof(ABP_GrannyController_C, Look) == 0x000860, "Member 'ABP_GrannyController_C::Look' has a wrong offset!");
static_assert(offsetof(ABP_GrannyController_C, As_BP_Game_Instance_Main) == 0x000868, "Member 'ABP_GrannyController_C::As_BP_Game_Instance_Main' has a wrong offset!");
static_assert(offsetof(ABP_GrannyController_C, CameraPawn) == 0x000870, "Member 'ABP_GrannyController_C::CameraPawn' has a wrong offset!");
static_assert(offsetof(ABP_GrannyController_C, BeginPlayPawn) == 0x000878, "Member 'ABP_GrannyController_C::BeginPlayPawn' has a wrong offset!");
static_assert(offsetof(ABP_GrannyController_C, LookVector) == 0x000880, "Member 'ABP_GrannyController_C::LookVector' has a wrong offset!");

}

