#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GrannyController

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "EnhancedInput_structs.hpp"


namespace SDK::Params
{

// Function BP_GrannyController.BP_GrannyController_C.InpActEvt_IA_Pause_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct BP_GrannyController_C_InpActEvt_IA_Pause_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GrannyController_C_InpActEvt_IA_Pause_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on BP_GrannyController_C_InpActEvt_IA_Pause_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(BP_GrannyController_C_InpActEvt_IA_Pause_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on BP_GrannyController_C_InpActEvt_IA_Pause_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(BP_GrannyController_C_InpActEvt_IA_Pause_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'BP_GrannyController_C_InpActEvt_IA_Pause_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_InpActEvt_IA_Pause_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'BP_GrannyController_C_InpActEvt_IA_Pause_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_InpActEvt_IA_Pause_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'BP_GrannyController_C_InpActEvt_IA_Pause_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_InpActEvt_IA_Pause_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'BP_GrannyController_C_InpActEvt_IA_Pause_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

// Function BP_GrannyController.BP_GrannyController_C.InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_3
// 0x0030 (0x0030 - 0x0000)
struct BP_GrannyController_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_3 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GrannyController_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_3) == 0x000008, "Wrong alignment on BP_GrannyController_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_3");
static_assert(sizeof(BP_GrannyController_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_3) == 0x000030, "Wrong size on BP_GrannyController_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_3");
static_assert(offsetof(BP_GrannyController_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_3, ActionValue) == 0x000000, "Member 'BP_GrannyController_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_3::ActionValue' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_3, ElapsedTime) == 0x000020, "Member 'BP_GrannyController_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_3::ElapsedTime' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_3, TriggeredTime) == 0x000024, "Member 'BP_GrannyController_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_3::TriggeredTime' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_3, SourceAction) == 0x000028, "Member 'BP_GrannyController_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_3::SourceAction' has a wrong offset!");

// Function BP_GrannyController.BP_GrannyController_C.InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_2
// 0x0030 (0x0030 - 0x0000)
struct BP_GrannyController_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_2 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GrannyController_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_2) == 0x000008, "Wrong alignment on BP_GrannyController_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_2");
static_assert(sizeof(BP_GrannyController_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_2) == 0x000030, "Wrong size on BP_GrannyController_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_2");
static_assert(offsetof(BP_GrannyController_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_2, ActionValue) == 0x000000, "Member 'BP_GrannyController_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_2::ActionValue' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_2, ElapsedTime) == 0x000020, "Member 'BP_GrannyController_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_2::ElapsedTime' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_2, TriggeredTime) == 0x000024, "Member 'BP_GrannyController_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_2::TriggeredTime' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_2, SourceAction) == 0x000028, "Member 'BP_GrannyController_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_2::SourceAction' has a wrong offset!");

// Function BP_GrannyController.BP_GrannyController_C.InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_1
// 0x0030 (0x0030 - 0x0000)
struct BP_GrannyController_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_1 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GrannyController_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_1) == 0x000008, "Wrong alignment on BP_GrannyController_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_1");
static_assert(sizeof(BP_GrannyController_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_1) == 0x000030, "Wrong size on BP_GrannyController_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_1");
static_assert(offsetof(BP_GrannyController_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_1, ActionValue) == 0x000000, "Member 'BP_GrannyController_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_1::ActionValue' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_1, ElapsedTime) == 0x000020, "Member 'BP_GrannyController_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_1::ElapsedTime' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_1, TriggeredTime) == 0x000024, "Member 'BP_GrannyController_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_1::TriggeredTime' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_1, SourceAction) == 0x000028, "Member 'BP_GrannyController_C_InpActEvt_IA_Look_K2Node_EnhancedInputActionEvent_1::SourceAction' has a wrong offset!");

// Function BP_GrannyController.BP_GrannyController_C.ExecuteUbergraph_BP_GrannyController
// 0x0258 (0x0258 - 0x0000)
struct BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2805[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_2;     // 0x0008(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_2;     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_2;   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_2;    // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x0038(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x0060(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_InputActionValueToAxis2D_ReturnValue; // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_InputActionValueToAxis2D_ReturnValue_1; // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable;                              // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_1;                            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x00F0(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0118(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2806[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_1;                            // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2_0;                            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2807[0x7];                                     // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_3_0;                            // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0168(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GameInstanceMain_C*                 K2Node_DynamicCast_AsBP_Game_Instance_Main;        // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2808[0x7];                                     // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_3;     // 0x0198(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_3;     // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_3;   // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_3;    // 0x01C0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GrannyHUD_C*                        K2Node_DynamicCast_AsBP_Granny_HUD;                // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2809[0x7];                                     // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_2;                              // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_2;                            // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_InputActionValueToAxis2D_ReturnValue_2; // 0x01F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_Player_C*>                   CallFunc_GetAllActorsOfClass_OutActors;            // 0x0200(0x0010)(ReferenceParm)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_1;                 // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Player_C*                           CallFunc_Array_Random_OutItem;                     // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_280A[0x4];                                     // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_280B[0x7];                                     // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_2;                 // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_1;             // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_1;      // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_280C[0x2];                                     // 0x024A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_AddYawInput_Val_ImplicitCast;             // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AddPitchInput_Val_ImplicitCast;           // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController) == 0x000008, "Wrong alignment on BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController");
static_assert(sizeof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController) == 0x000258, "Wrong size on BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, EntryPoint) == 0x000000, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, K2Node_EnhancedInputActionEvent_ActionValue_2) == 0x000008, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::K2Node_EnhancedInputActionEvent_ActionValue_2' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, K2Node_EnhancedInputActionEvent_ElapsedTime_2) == 0x000028, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::K2Node_EnhancedInputActionEvent_ElapsedTime_2' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, K2Node_EnhancedInputActionEvent_TriggeredTime_2) == 0x00002C, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::K2Node_EnhancedInputActionEvent_TriggeredTime_2' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, K2Node_EnhancedInputActionEvent_SourceAction_2) == 0x000030, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::K2Node_EnhancedInputActionEvent_SourceAction_2' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, K2Node_EnhancedInputActionEvent_ActionValue_1) == 0x000038, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::K2Node_EnhancedInputActionEvent_ActionValue_1' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, K2Node_EnhancedInputActionEvent_ElapsedTime_1) == 0x000058, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::K2Node_EnhancedInputActionEvent_ElapsedTime_1' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, K2Node_EnhancedInputActionEvent_TriggeredTime_1) == 0x00005C, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::K2Node_EnhancedInputActionEvent_TriggeredTime_1' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, K2Node_EnhancedInputActionEvent_SourceAction_1) == 0x000060, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::K2Node_EnhancedInputActionEvent_SourceAction_1' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, CallFunc_Conv_InputActionValueToAxis2D_ReturnValue) == 0x000068, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::CallFunc_Conv_InputActionValueToAxis2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, CallFunc_Conv_InputActionValueToAxis2D_ReturnValue_1) == 0x000078, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::CallFunc_Conv_InputActionValueToAxis2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, Temp_object_Variable) == 0x000088, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, Temp_real_Variable) == 0x000090, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, Temp_real_Variable_0) == 0x000098, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, Temp_real_Variable_1) == 0x0000A0, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, Temp_real_Variable_1) == 0x0000A8, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, Temp_struct_Variable) == 0x0000B0, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, Temp_real_Variable_1_0) == 0x0000C0, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, CallFunc_BreakVector2D_X) == 0x0000C8, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, CallFunc_BreakVector2D_Y) == 0x0000D0, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, Temp_real_Variable_1_1) == 0x0000D8, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::Temp_real_Variable_1_1' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, CallFunc_MakeVector2D_ReturnValue) == 0x0000E0, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, K2Node_EnhancedInputActionEvent_ActionValue) == 0x0000F0, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000110, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x000114, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000118, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000120, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, Temp_object_Variable_1) == 0x000128, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, Temp_real_Variable_2) == 0x000130, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, Temp_real_Variable_2_0) == 0x000138, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::Temp_real_Variable_2_0' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, Temp_real_Variable_3) == 0x000140, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, Temp_bool_Variable) == 0x000148, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, Temp_real_Variable_3_0) == 0x000150, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::Temp_real_Variable_3_0' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000158, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000160, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, CallFunc_MakeVector2D_ReturnValue_1) == 0x000168, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, CallFunc_GetGameInstance_ReturnValue) == 0x000178, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, CallFunc_K2_GetPawn_ReturnValue) == 0x000180, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, K2Node_DynamicCast_AsBP_Game_Instance_Main) == 0x000188, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::K2Node_DynamicCast_AsBP_Game_Instance_Main' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, K2Node_DynamicCast_bSuccess) == 0x000190, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, K2Node_EnhancedInputActionEvent_ActionValue_3) == 0x000198, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::K2Node_EnhancedInputActionEvent_ActionValue_3' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, K2Node_EnhancedInputActionEvent_ElapsedTime_3) == 0x0001B8, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::K2Node_EnhancedInputActionEvent_ElapsedTime_3' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, K2Node_EnhancedInputActionEvent_TriggeredTime_3) == 0x0001BC, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::K2Node_EnhancedInputActionEvent_TriggeredTime_3' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, K2Node_EnhancedInputActionEvent_SourceAction_3) == 0x0001C0, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::K2Node_EnhancedInputActionEvent_SourceAction_3' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, CallFunc_GetHUD_ReturnValue) == 0x0001C8, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, K2Node_DynamicCast_AsBP_Granny_HUD) == 0x0001D0, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::K2Node_DynamicCast_AsBP_Granny_HUD' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, K2Node_DynamicCast_bSuccess_1) == 0x0001D8, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, Temp_real_Variable_2) == 0x0001E0, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, Temp_real_Variable_1_2) == 0x0001E8, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::Temp_real_Variable_1_2' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, CallFunc_Conv_InputActionValueToAxis2D_ReturnValue_2) == 0x0001F0, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::CallFunc_Conv_InputActionValueToAxis2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, CallFunc_GetAllActorsOfClass_OutActors) == 0x000200, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, CallFunc_K2_GetPawn_ReturnValue_1) == 0x000210, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::CallFunc_K2_GetPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, CallFunc_Array_Random_OutItem) == 0x000218, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, CallFunc_Array_Random_OutIndex) == 0x000220, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, CallFunc_GetObjectClass_ReturnValue) == 0x000228, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000230, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, CallFunc_K2_GetPawn_ReturnValue_2) == 0x000238, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::CallFunc_K2_GetPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, CallFunc_GetObjectClass_ReturnValue_1) == 0x000240, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::CallFunc_GetObjectClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, CallFunc_EqualEqual_ClassClass_ReturnValue_1) == 0x000248, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::CallFunc_EqualEqual_ClassClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, CallFunc_BooleanOR_ReturnValue) == 0x000249, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, CallFunc_AddYawInput_Val_ImplicitCast) == 0x00024C, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::CallFunc_AddYawInput_Val_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController, CallFunc_AddPitchInput_Val_ImplicitCast) == 0x000250, "Member 'BP_GrannyController_C_ExecuteUbergraph_BP_GrannyController::CallFunc_AddPitchInput_Val_ImplicitCast' has a wrong offset!");

// Function BP_GrannyController.BP_GrannyController_C.AddInputMapping
// 0x0028 (0x0028 - 0x0000)
struct BP_GrannyController_C_AddInputMapping final
{
public:
	struct FModifyContextOptions                  Temp_struct_Variable;                              // 0x0000(0x0001)(ConstParm, NoDestructor)
	uint8                                         Pad_280D[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnhancedInputLocalPlayerSubsystem*     CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_280E[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IEnhancedInputSubsystemInterface> CallFunc_AddMappingContext_self_CastInput;         // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GrannyController_C_AddInputMapping) == 0x000008, "Wrong alignment on BP_GrannyController_C_AddInputMapping");
static_assert(sizeof(BP_GrannyController_C_AddInputMapping) == 0x000028, "Wrong size on BP_GrannyController_C_AddInputMapping");
static_assert(offsetof(BP_GrannyController_C_AddInputMapping, Temp_struct_Variable) == 0x000000, "Member 'BP_GrannyController_C_AddInputMapping::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_GrannyController_C_AddInputMapping, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue) == 0x000008, "Member 'BP_GrannyController_C_AddInputMapping::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue' has a wrong offset!");
