#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GrannyHUD

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_GrannyHUD.BP_GrannyHUD_C.ShowNote
// 0x0018 (0x0018 - 0x0000)
struct BP_GrannyHUD_C_ShowNote final
{
public:
	class FText                                   NoteText;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_GrannyHUD_C_ShowNote) == 0x000008, "Wrong alignment on BP_GrannyHUD_C_ShowNote");
static_assert(sizeof(BP_GrannyHUD_C_ShowNote) == 0x000018, "Wrong size on BP_GrannyHUD_C_ShowNote");
static_assert(offsetof(BP_GrannyHUD_C_ShowNote, NoteText) == 0x000000, "Member 'BP_GrannyHUD_C_ShowNote::NoteText' has a wrong offset!");

// Function BP_GrannyHUD.BP_GrannyHUD_C.PrintDebugString
// 0x0030 (0x0030 - 0x0000)
struct BP_GrannyHUD_C_PrintDebugString final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          PrintToLog;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BBC[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Text_Color;                                        // 0x0014(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BBD[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Duration;                                          // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GrannyHUD_C_PrintDebugString) == 0x000008, "Wrong alignment on BP_GrannyHUD_C_PrintDebugString");
static_assert(sizeof(BP_GrannyHUD_C_PrintDebugString) == 0x000030, "Wrong size on BP_GrannyHUD_C_PrintDebugString");
static_assert(offsetof(BP_GrannyHUD_C_PrintDebugString, String) == 0x000000, "Member 'BP_GrannyHUD_C_PrintDebugString::String' has a wrong offset!");
static_assert(offsetof(BP_GrannyHUD_C_PrintDebugString, PrintToLog) == 0x000010, "Member 'BP_GrannyHUD_C_PrintDebugString::PrintToLog' has a wrong offset!");
static_assert(offsetof(BP_GrannyHUD_C_PrintDebugString, Text_Color) == 0x000014, "Member 'BP_GrannyHUD_C_PrintDebugString::Text_Color' has a wrong offset!");
static_assert(offsetof(BP_GrannyHUD_C_PrintDebugString, Duration) == 0x000028, "Member 'BP_GrannyHUD_C_PrintDebugString::Duration' has a wrong offset!");

// Function BP_GrannyHUD.BP_GrannyHUD_C.ExecuteUbergraph_BP_GrannyHUD
// 0x00B8 (0x00B8 - 0x0000)
struct BP_GrannyHUD_C_ExecuteUbergraph_BP_GrannyHUD final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BBE[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_HintItems_C*                       CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Note_C*                            CallFunc_Create_ReturnValue_1;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_DebugCanvas_C*                     CallFunc_Create_ReturnValue_2;                     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_WriteText;                      // 0x0020(0x0018)()
	class UWBP_Notification_C*                    CallFunc_Create_ReturnValue_3;                     // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_String;                         // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_PrintToLog;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BBF[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_CustomEvent_Text_Color;                     // 0x005C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC0[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_Duration;                       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_NoteText;                       // 0x0088(0x0018)()
	class ABP_Player_C*                           K2Node_DynamicCast_AsBP_Player;                    // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC1[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_GameCanvas_C*                      CallFunc_Create_ReturnValue_4;                     // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GrannyHUD_C_ExecuteUbergraph_BP_GrannyHUD) == 0x000008, "Wrong alignment on BP_GrannyHUD_C_ExecuteUbergraph_BP_GrannyHUD");
static_assert(sizeof(BP_GrannyHUD_C_ExecuteUbergraph_BP_GrannyHUD) == 0x0000B8, "Wrong size on BP_GrannyHUD_C_ExecuteUbergraph_BP_GrannyHUD");
static_assert(offsetof(BP_GrannyHUD_C_ExecuteUbergraph_BP_GrannyHUD, EntryPoint) == 0x000000, "Member 'BP_GrannyHUD_C_ExecuteUbergraph_BP_GrannyHUD::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GrannyHUD_C_ExecuteUbergraph_BP_GrannyHUD, CallFunc_Create_ReturnValue) == 0x000008, "Member 'BP_GrannyHUD_C_ExecuteUbergraph_BP_GrannyHUD::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrannyHUD_C_ExecuteUbergraph_BP_GrannyHUD, CallFunc_Create_ReturnValue_1) == 0x000010, "Member 'BP_GrannyHUD_C_ExecuteUbergraph_BP_GrannyHUD::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GrannyHUD_C_ExecuteUbergraph_BP_GrannyHUD, CallFunc_Create_ReturnValue_2) == 0x000018, "Member 'BP_GrannyHUD_C_ExecuteUbergraph_BP_GrannyHUD::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GrannyHUD_C_ExecuteUbergraph_BP_GrannyHUD, K2Node_CustomEvent_WriteText) == 0x000020, "Member 'BP_GrannyHUD_C_ExecuteUbergraph_BP_GrannyHUD::K2Node_CustomEvent_WriteText' has a wrong offset!");
static_assert(offsetof(BP_GrannyHUD_C_ExecuteUbergraph_BP_GrannyHUD, CallFunc_Create_ReturnValue_3) == 0x000038, "Member 'BP_GrannyHUD_C_ExecuteUbergraph_BP_GrannyHUD::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_GrannyHUD_C_ExecuteUbergraph_BP_GrannyHUD, CallFunc_AddChild_ReturnValue) == 0x000040, "Member 'BP_GrannyHUD_C_ExecuteUbergraph_BP_GrannyHUD::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrannyHUD_C_ExecuteUbergraph_BP_GrannyHUD, K2Node_CustomEvent_String) == 0x000048, "Member 'BP_GrannyHUD_C_ExecuteUbergraph_BP_GrannyHUD::K2Node_CustomEvent_String' has a wrong offset!");
static_assert(offsetof(BP_GrannyHUD_C_ExecuteUbergraph_BP_GrannyHUD, K2Node_CustomEvent_PrintToLog) == 0x000058, "Member 'BP_GrannyHUD_C_ExecuteUbergraph_BP_GrannyHUD::K2Node_CustomEvent_PrintToLog' has a wrong offset!");
static_assert(offsetof(BP_GrannyHUD_C_ExecuteUbergraph_BP_GrannyHUD, K2Node_CustomEvent_Text_Color) == 0x00005C, "Member 'BP_GrannyHUD_C_ExecuteUbergraph_BP_GrannyHUD::K2Node_CustomEvent_Text_Color' has a wrong offset!");
static_assert(offsetof(BP_GrannyHUD_C_ExecuteUbergraph_BP_GrannyHUD, K2Node_CustomEvent_Duration) == 0x000070, "Member 'BP_GrannyHUD_C_ExecuteUbergraph_BP_GrannyHUD::K2Node_CustomEvent_Duration' has a wrong offset!");
static_assert(offsetof(BP_GrannyHUD_C_ExecuteUbergraph_BP_GrannyHUD, CallFunc_GetPlayerController_ReturnValue) == 0x000078, "Member 'BP_GrannyHUD_C_ExecuteUbergraph_BP_GrannyHUD::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrannyHUD_C_ExecuteUbergraph_BP_GrannyHUD, CallFunc_K2_GetPawn_ReturnValue) == 0x000080, "Member 'BP_GrannyHUD_C_ExecuteUbergraph_BP_GrannyHUD::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GrannyHUD_C_ExecuteUbergraph_BP_GrannyHUD, K2Node_CustomEvent_NoteText) == 0x000088, "Member 'BP_GrannyHUD_C_ExecuteUbergraph_BP_GrannyHUD::K2Node_CustomEvent_NoteText' has a wrong offset!");
static_assert(offsetof(BP_GrannyHUD_C_ExecuteUbergraph_BP_GrannyHUD, K2Node_DynamicCast_AsBP_Player) == 0x0000A0, "Member 'BP_GrannyHUD_C_ExecuteUbergraph_BP_GrannyHUD::K2Node_DynamicCast_AsBP_Player' has a wrong offset!");
static_assert(offsetof(BP_GrannyHUD_C_ExecuteUbergraph_BP_GrannyHUD, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'BP_GrannyHUD_C_ExecuteUbergraph_BP_GrannyHUD::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GrannyHUD_C_ExecuteUbergraph_BP_GrannyHUD, CallFunc_Create_ReturnValue_4) == 0x0000B0, "Member 'BP_GrannyHUD_C_ExecuteUbergraph_BP_GrannyHUD::CallFunc_Create_ReturnValue_4' has a wrong offset!");

// Function BP_GrannyHUD.BP_GrannyHUD_C.CallNotification
// 0x0018 (0x0018 - 0x0000)
struct BP_GrannyHUD_C_CallNotification final
{
public:
	class FText                                   WriteText;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_GrannyHUD_C_CallNotification) == 0x000008, "Wrong alignment on BP_GrannyHUD_C_CallNotification");
static_assert(sizeof(BP_GrannyHUD_C_CallNotification) == 0x000018, "Wrong size on BP_GrannyHUD_C_CallNotification");
static_assert(offsetof(BP_GrannyHUD_C_CallNotification, WriteText) == 0x000000, "Member 'BP_GrannyHUD_C_CallNotification::WriteText' has a wrong offset!");

}

