#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HideBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_InteractableBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HideBase.BP_HideBase_C
// 0x0048 (0x0338 - 0x02F0)
class ABP_HideBase_C final : public ABP_InteractableBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_HideBase_C;                      // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        Baza;                                              // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Low;                                               // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Hidding;                                           // 0x0311(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249E[0x6];                                     // 0x0312(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        InSpeedMult;                                       // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OutSpeedMult;                                      // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TeleportNaBazu;                                    // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249F[0x7];                                     // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CameraMoveLimit;                                   // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UNHIDE();
	void Interact(class ABP_Player_C* Player, const struct FHitResult& Hit);
	void HideAnimFinished_Event(bool PlayerHide);
	void GetGranny(class ABP_Granny_C** Granny);
	void ExecuteUbergraph_BP_HideBase(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HideBase_C">();
	}
	static class ABP_HideBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_HideBase_C>();
	}
};
static_assert(alignof(ABP_HideBase_C) == 0x000008, "Wrong alignment on ABP_HideBase_C");
static_assert(sizeof(ABP_HideBase_C) == 0x000338, "Wrong size on ABP_HideBase_C");
static_assert(offsetof(ABP_HideBase_C, UberGraphFrame_BP_HideBase_C) == 0x0002F0, "Member 'ABP_HideBase_C::UberGraphFrame_BP_HideBase_C' has a wrong offset!");
static_assert(offsetof(ABP_HideBase_C, Baza) == 0x0002F8, "Member 'ABP_HideBase_C::Baza' has a wrong offset!");
static_assert(offsetof(ABP_HideBase_C, Box) == 0x000300, "Member 'ABP_HideBase_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_HideBase_C, Scene) == 0x000308, "Member 'ABP_HideBase_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_HideBase_C, Low) == 0x000310, "Member 'ABP_HideBase_C::Low' has a wrong offset!");
static_assert(offsetof(ABP_HideBase_C, Hidding) == 0x000311, "Member 'ABP_HideBase_C::Hidding' has a wrong offset!");
static_assert(offsetof(ABP_HideBase_C, InSpeedMult) == 0x000318, "Member 'ABP_HideBase_C::InSpeedMult' has a wrong offset!");
static_assert(offsetof(ABP_HideBase_C, OutSpeedMult) == 0x000320, "Member 'ABP_HideBase_C::OutSpeedMult' has a wrong offset!");
static_assert(offsetof(ABP_HideBase_C, TeleportNaBazu) == 0x000328, "Member 'ABP_HideBase_C::TeleportNaBazu' has a wrong offset!");
static_assert(offsetof(ABP_HideBase_C, CameraMoveLimit) == 0x000330, "Member 'ABP_HideBase_C::CameraMoveLimit' has a wrong offset!");

}

