#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ItemBase.BP_ItemBase_C.Use
// 0x0010 (0x0010 - 0x0000)
struct BP_ItemBase_C_Use final
{
public:
	class ABP_Player_C*                           Param_Player;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Start;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemBase_C_Use) == 0x000008, "Wrong alignment on BP_ItemBase_C_Use");
static_assert(sizeof(BP_ItemBase_C_Use) == 0x000010, "Wrong size on BP_ItemBase_C_Use");
static_assert(offsetof(BP_ItemBase_C_Use, Param_Player) == 0x000000, "Member 'BP_ItemBase_C_Use::Param_Player' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_Use, Start) == 0x000008, "Member 'BP_ItemBase_C_Use::Start' has a wrong offset!");

// Function BP_ItemBase.BP_ItemBase_C.Taken
// 0x0001 (0x0001 - 0x0000)
struct BP_ItemBase_C_Taken final
{
public:
	bool                                          ByGranny;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemBase_C_Taken) == 0x000001, "Wrong alignment on BP_ItemBase_C_Taken");
static_assert(sizeof(BP_ItemBase_C_Taken) == 0x000001, "Wrong size on BP_ItemBase_C_Taken");
static_assert(offsetof(BP_ItemBase_C_Taken, ByGranny) == 0x000000, "Member 'BP_ItemBase_C_Taken::ByGranny' has a wrong offset!");

// Function BP_ItemBase.BP_ItemBase_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ItemBase_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemBase_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ItemBase_C_ReceiveTick");
static_assert(sizeof(BP_ItemBase_C_ReceiveTick) == 0x000004, "Wrong size on BP_ItemBase_C_ReceiveTick");
static_assert(offsetof(BP_ItemBase_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_ItemBase_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_ItemBase.BP_ItemBase_C.InteractEnd
// 0x0008 (0x0008 - 0x0000)
struct BP_ItemBase_C_InteractEnd final
{
public:
	class ABP_Player_C*                           Param_Player;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemBase_C_InteractEnd) == 0x000008, "Wrong alignment on BP_ItemBase_C_InteractEnd");
static_assert(sizeof(BP_ItemBase_C_InteractEnd) == 0x000008, "Wrong size on BP_ItemBase_C_InteractEnd");
static_assert(offsetof(BP_ItemBase_C_InteractEnd, Param_Player) == 0x000000, "Member 'BP_ItemBase_C_InteractEnd::Param_Player' has a wrong offset!");

// Function BP_ItemBase.BP_ItemBase_C.InteractCanceled
// 0x0008 (0x0008 - 0x0000)
struct BP_ItemBase_C_InteractCanceled final
{
public:
	class ABP_Player_C*                           Param_Player;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemBase_C_InteractCanceled) == 0x000008, "Wrong alignment on BP_ItemBase_C_InteractCanceled");
static_assert(sizeof(BP_ItemBase_C_InteractCanceled) == 0x000008, "Wrong size on BP_ItemBase_C_InteractCanceled");
static_assert(offsetof(BP_ItemBase_C_InteractCanceled, Param_Player) == 0x000000, "Member 'BP_ItemBase_C_InteractCanceled::Param_Player' has a wrong offset!");

// Function BP_ItemBase.BP_ItemBase_C.Interact
// 0x00F0 (0x00F0 - 0x0000)
struct BP_ItemBase_C_Interact final
{
public:
	class ABP_Player_C*                           Param_Player;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x00E8)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_ItemBase_C_Interact) == 0x000008, "Wrong alignment on BP_ItemBase_C_Interact");
static_assert(sizeof(BP_ItemBase_C_Interact) == 0x0000F0, "Wrong size on BP_ItemBase_C_Interact");
static_assert(offsetof(BP_ItemBase_C_Interact, Param_Player) == 0x000000, "Member 'BP_ItemBase_C_Interact::Param_Player' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_Interact, Hit) == 0x000008, "Member 'BP_ItemBase_C_Interact::Hit' has a wrong offset!");

// Function BP_ItemBase.BP_ItemBase_C.ExecuteUbergraph_BP_ItemBase
// 0x0CC0 (0x0CC0 - 0x0000)
struct BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Player_C*                           K2Node_Event_Player_3;                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Player_C*                           K2Node_Event_Player_2;                             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0018(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Player_C*                           K2Node_Event_Player_1;                             // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0120(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ABP_Player_C*                           K2Node_Event_Player;                               // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Start;                                // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24AC[0x7];                                     // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0228(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0238(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0248(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_CameraTrace_OutHit;                       // 0x0258(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_CameraTrace_ReturnValue;                  // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24AD[0x3];                                     // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24AE[0x2];                                     // 0x034A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24AF[0x4];                                     // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0358(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0370(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0388(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x03A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x03B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x03C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x03C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24B0[0x4];                                     // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x03F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0408(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0420(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0430(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_ByGranny;                       // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             K2Node_Select_Default;                             // 0x0441(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0442(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24B1[0xD];                                     // 0x0443(0x000D)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0450(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24B2[0x8];                                     // 0x04B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_1;     // 0x04C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0520(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24B3[0x4];                                     // 0x0524(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0528(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0540(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0558(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0570(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24B4[0xC];                                     // 0x0574(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0580(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_TInterpTo_ReturnValue;                    // 0x05E0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue;         // 0x0640(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x06A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x06B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x06D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x06E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0700(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0718(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0720(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0724(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24B5[0x3];                                     // 0x0725(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0728(0x0010)(ConstParm, ReferenceParm)
	uint8                                         Pad_24B6[0x8];                                     // 0x0738(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_SelectTransform_ReturnValue;              // 0x0740(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_2;                // 0x07A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_2;                // 0x07B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_2;                   // 0x07D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24B7[0x8];                                     // 0x07E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x07F0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_3;    // 0x0850(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0868(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_CustomEvent_HitComponent;                   // 0x0950(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x0958(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OtherComp;                      // 0x0960(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_NormalImpulse;                  // 0x0968(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_CustomEvent_Hit;                            // 0x0980(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0A68(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x0A69(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24B8[0x2];                                     // 0x0A6A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x0A6C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0A70(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24B9[0x4];                                     // 0x0A74(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x0A78(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0A90(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0AA8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0AC0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0AD8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0AE0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0AE8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0AF0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_1;                // 0x0AF8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0B00(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x0B04(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0B08(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24BA[0x4];                                     // 0x0B0C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0B10(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0B28(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0B40(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0B48(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24BB[0x7];                                     // 0x0B49(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0B50(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0B60(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24BC[0x7];                                     // 0x0B61(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_Granny_C*>                   CallFunc_GetAllActorsOfClass_OutActors;            // 0x0B68(0x0010)(ReferenceParm)
	class ABP_Granny_C*                           CallFunc_Array_Get_Item;                           // 0x0B78(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0B80(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24BD[0x4];                                     // 0x0B84(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0B88(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0BA0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0BA1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24BE[0x6];                                     // 0x0BA2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_4;    // 0x0BA8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_5;    // 0x0BC0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, struct FHitResult& Hit)> K2Node_CreateDelegate_OutputDelegate;              // 0x0BD8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0BE8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_6;    // 0x0BF0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0C08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24BF[0x7];                                     // 0x0C09(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Vector_Distance_ReturnValue_1;            // 0x0C10(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0C18(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C0[0x7];                                     // 0x0C19(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0C20(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0C28(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FHitResult>                     CallFunc_LineTraceMultiForObjects_OutHits;         // 0x0C38(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceMultiForObjects_ReturnValue;     // 0x0C48(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C1[0x7];                                     // 0x0C49(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0C50(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0C58(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C2[0x4];                                     // 0x0C5C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue_1;            // 0x0C60(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0C68(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C3[0x4];                                     // 0x0C6C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0C70(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_2;            // 0x0C78(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue_1;        // 0x0C80(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0C90(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0C98(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0CA0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C4[0x3];                                     // 0x0CA1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_VariableSet_TargetArmLength_ImplicitCast;   // 0x0CA4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlaySoundAtLocation_VolumeMultiplier_ImplicitCast; // 0x0CA8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TInterpTo_DeltaTime_ImplicitCast;         // 0x0CAC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0CB0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomBoolWithWeight_Weight_ImplicitCast; // 0x0CB8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase) == 0x000010, "Wrong alignment on BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase");
static_assert(sizeof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase) == 0x000CC0, "Wrong size on BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, EntryPoint) == 0x000000, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, Temp_bool_Variable) == 0x000004, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, Temp_byte_Variable) == 0x000005, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, Temp_byte_Variable_1) == 0x000006, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, Temp_bool_Has_Been_Initd_Variable) == 0x000007, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_Event_Player_3) == 0x000008, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_Event_Player_3' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_Event_Player_2) == 0x000010, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_Event_Player_2' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000018, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000100, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_Event_Player_1) == 0x000118, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_Event_Player_1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_Event_Hit) == 0x000120, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_Event_Player) == 0x000208, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_Event_Player' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_Event_Start) == 0x000210, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_Event_Start' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_GetDisplayName_ReturnValue) == 0x000218, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_Concat_StrStr_ReturnValue) == 0x000228, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000238, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000248, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_CameraTrace_OutHit) == 0x000258, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_CameraTrace_OutHit' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_CameraTrace_ReturnValue) == 0x000340, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_CameraTrace_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_Event_DeltaSeconds) == 0x000344, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakHitResult_bBlockingHit) == 0x000348, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakHitResult_bInitialOverlap) == 0x000349, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakHitResult_Time) == 0x00034C, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakHitResult_Distance) == 0x000350, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakHitResult_Location) == 0x000358, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakHitResult_ImpactPoint) == 0x000370, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakHitResult_Normal) == 0x000388, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakHitResult_ImpactNormal) == 0x0003A0, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakHitResult_PhysMat) == 0x0003B8, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakHitResult_HitActor) == 0x0003C0, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakHitResult_HitComponent) == 0x0003C8, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakHitResult_HitBoneName) == 0x0003D0, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakHitResult_BoneName) == 0x0003D8, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakHitResult_HitItem) == 0x0003E0, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakHitResult_ElementIndex) == 0x0003E4, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakHitResult_FaceIndex) == 0x0003E8, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakHitResult_TraceStart) == 0x0003F0, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakHitResult_TraceEnd) == 0x000408, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_GetDisplayName_ReturnValue_1) == 0x000420, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000430, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_CustomEvent_ByGranny) == 0x000440, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_CustomEvent_ByGranny' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_Select_Default) == 0x000441, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000442, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000450, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0004B0, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_K2_GetComponentToWorld_ReturnValue_1) == 0x0004C0, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_K2_GetComponentToWorld_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, Temp_int_Loop_Counter_Variable) == 0x000520, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakTransform_Location) == 0x000528, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakTransform_Rotation) == 0x000540, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakTransform_Scale) == 0x000558, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_Add_IntInt_ReturnValue) == 0x000570, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_MakeTransform_ReturnValue) == 0x000580, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_TInterpTo_ReturnValue) == 0x0005E0, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_TInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_GetRelativeTransform_ReturnValue) == 0x000640, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_GetRelativeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakTransform_Location_1) == 0x0006A0, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakTransform_Rotation_1) == 0x0006B8, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakTransform_Scale_1) == 0x0006D0, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0006E8, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x000700, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_Vector_Distance_ReturnValue) == 0x000718, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, Temp_int_Array_Index_Variable) == 0x000720, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000724, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, Temp_object_Variable) == 0x000728, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_SelectTransform_ReturnValue) == 0x000740, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_SelectTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakTransform_Location_2) == 0x0007A0, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakTransform_Location_2' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakTransform_Rotation_2) == 0x0007B8, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakTransform_Rotation_2' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakTransform_Scale_2) == 0x0007D0, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakTransform_Scale_2' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_MakeTransform_ReturnValue_1) == 0x0007F0, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_K2_GetComponentLocation_ReturnValue_3) == 0x000850, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_K2_GetComponentLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000868, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_CustomEvent_HitComponent) == 0x000950, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_CustomEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_CustomEvent_OtherActor) == 0x000958, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_CustomEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_CustomEvent_OtherComp) == 0x000960, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_CustomEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_CustomEvent_NormalImpulse) == 0x000968, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_CustomEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_CustomEvent_Hit) == 0x000980, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_CustomEvent_Hit' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakHitResult_bBlockingHit_1) == 0x000A68, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x000A69, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakHitResult_Time_1) == 0x000A6C, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakHitResult_Distance_1) == 0x000A70, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakHitResult_Location_1) == 0x000A78, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakHitResult_ImpactPoint_1) == 0x000A90, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakHitResult_Normal_1) == 0x000AA8, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakHitResult_ImpactNormal_1) == 0x000AC0, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakHitResult_PhysMat_1) == 0x000AD8, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakHitResult_HitActor_1) == 0x000AE0, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakHitResult_HitComponent_1) == 0x000AE8, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakHitResult_HitBoneName_1) == 0x000AF0, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakHitResult_BoneName_1) == 0x000AF8, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakHitResult_BoneName_1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakHitResult_HitItem_1) == 0x000B00, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakHitResult_ElementIndex_1) == 0x000B04, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakHitResult_FaceIndex_1) == 0x000B08, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakHitResult_TraceStart_1) == 0x000B10, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakHitResult_TraceEnd_1) == 0x000B28, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_VSize_ReturnValue) == 0x000B40, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000B48, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000B50, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, Temp_bool_IsClosed_Variable) == 0x000B60, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_GetAllActorsOfClass_OutActors) == 0x000B68, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_Array_Get_Item) == 0x000B78, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_Array_Length_ReturnValue) == 0x000B80, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000B88, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_Less_IntInt_ReturnValue) == 0x000BA0, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_IsValid_ReturnValue) == 0x000BA1, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_K2_GetComponentLocation_ReturnValue_4) == 0x000BA8, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_K2_GetComponentLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_K2_GetComponentLocation_ReturnValue_5) == 0x000BC0, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_K2_GetComponentLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_CreateDelegate_OutputDelegate) == 0x000BD8, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000BE8, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_K2_GetComponentLocation_ReturnValue_6) == 0x000BF0, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_K2_GetComponentLocation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000C08, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_Vector_Distance_ReturnValue_1) == 0x000C10, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_Vector_Distance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BooleanAND_ReturnValue) == 0x000C18, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_MapRangeClamped_ReturnValue) == 0x000C20, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_MakeArray_Array) == 0x000C28, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_LineTraceMultiForObjects_OutHits) == 0x000C38, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_LineTraceMultiForObjects_OutHits' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_LineTraceMultiForObjects_ReturnValue) == 0x000C48, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_LineTraceMultiForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000C50, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_Array_Length_ReturnValue_1) == 0x000C58, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_MapRangeClamped_ReturnValue_1) == 0x000C60, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000C68, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
