#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemSpawnPoint

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ST_ItemPosition_structs.hpp"


namespace SDK::Params
{

// Function BP_ItemSpawnPoint.BP_ItemSpawnPoint_C.SpawnItem
// 0x0008 (0x0008 - 0x0000)
struct BP_ItemSpawnPoint_C_SpawnItem final
{
public:
	class UClass*                                 Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemSpawnPoint_C_SpawnItem) == 0x000008, "Wrong alignment on BP_ItemSpawnPoint_C_SpawnItem");
static_assert(sizeof(BP_ItemSpawnPoint_C_SpawnItem) == 0x000008, "Wrong size on BP_ItemSpawnPoint_C_SpawnItem");
static_assert(offsetof(BP_ItemSpawnPoint_C_SpawnItem, Item) == 0x000000, "Member 'BP_ItemSpawnPoint_C_SpawnItem::Item' has a wrong offset!");

// Function BP_ItemSpawnPoint.BP_ItemSpawnPoint_C.ExecuteUbergraph_BP_ItemSpawnPoint
// 0x03D0 (0x03D0 - 0x0000)
struct BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2845[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable;                              // 0x0010(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GrannyGamemode_C*                   K2Node_DynamicCast_AsBP_Granny_Gamemode;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2846[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2847[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_CustomEvent_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         CallFunc_BreakStructArray_ItemArr;                 // 0x0050(0x0010)(ReferenceParm)
	TArray<struct FTransform>                     CallFunc_BreakStructArray_PositionsArr;            // 0x0060(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2848[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         CallFunc_BreakStructArray_ItemArr_1;               // 0x0078(0x0010)(ReferenceParm)
	TArray<struct FTransform>                     CallFunc_BreakStructArray_PositionsArr_1;          // 0x0088(0x0010)(ReferenceParm)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2849[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284A[0x8];                                     // 0x00E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x00F0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284B[0x4];                                     // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284C[0x4];                                     // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x01C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284D[0x4];                                     // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_AddComponent_ReturnValue;                 // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284E[0x3];                                     // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284F[0x4];                                     // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_RandomFromStream_OutItem;           // 0x0240(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_RandomFromStream_OutIndex;          // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2850[0x4];                                     // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_Array_Get_Item_1;                         // 0x0268(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0270(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0288(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x02A0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2851[0x4];                                     // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ItemBase_C*                         CallFunc_FinishSpawningActor_ReturnValue;          // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2852[0x7];                                     // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_1;                // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GrannyGamemode_C*                   K2Node_DynamicCast_AsBP_Granny_Gamemode_1;         // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2853[0x7];                                     // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_RandomFromStream_OutItem_1;         // 0x0338(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_RandomFromStream_OutIndex_1;        // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2854[0x4];                                     // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0348(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x0360(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x03C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ItemBase_C*                         CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint) == 0x000010, "Wrong alignment on BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint");
static_assert(sizeof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint) == 0x0003D0, "Wrong size on BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, EntryPoint) == 0x000000, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, CallFunc_GetGameMode_ReturnValue) == 0x000008, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, Temp_struct_Variable) == 0x000010, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, K2Node_DynamicCast_AsBP_Granny_Gamemode) == 0x000028, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::K2Node_DynamicCast_AsBP_Granny_Gamemode' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, Temp_int_Array_Index_Variable) == 0x000034, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, Temp_int_Array_Index_Variable_1) == 0x000040, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, K2Node_CustomEvent_Item) == 0x000048, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::K2Node_CustomEvent_Item' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, CallFunc_BreakStructArray_ItemArr) == 0x000050, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::CallFunc_BreakStructArray_ItemArr' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, CallFunc_BreakStructArray_PositionsArr) == 0x000060, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::CallFunc_BreakStructArray_PositionsArr' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, CallFunc_Array_Find_ReturnValue) == 0x000070, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, CallFunc_BreakStructArray_ItemArr_1) == 0x000078, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::CallFunc_BreakStructArray_ItemArr_1' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, CallFunc_BreakStructArray_PositionsArr_1) == 0x000088, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::CallFunc_BreakStructArray_PositionsArr_1' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000098, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, CallFunc_BreakTransform_Location) == 0x0000A0, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, CallFunc_BreakTransform_Rotation) == 0x0000B8, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, CallFunc_BreakTransform_Scale) == 0x0000D0, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, CallFunc_GetTransform_ReturnValue) == 0x0000F0, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, CallFunc_BreakTransform_Location_1) == 0x000150, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, CallFunc_BreakTransform_Rotation_1) == 0x000168, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, CallFunc_BreakTransform_Scale_1) == 0x000180, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, CallFunc_Array_Add_ReturnValue) == 0x000198, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, CallFunc_Array_Get_Item) == 0x0001A0, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, CallFunc_Array_Length_ReturnValue) == 0x0001B8, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, CallFunc_MakeTransform_ReturnValue) == 0x0001C0, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, Temp_int_Loop_Counter_Variable_1) == 0x000220, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, CallFunc_AddComponent_ReturnValue) == 0x000228, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, CallFunc_Less_IntInt_ReturnValue) == 0x000230, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, CallFunc_Add_IntInt_ReturnValue_1) == 0x000234, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, CallFunc_Array_Add_ReturnValue_1) == 0x000238, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, CallFunc_Array_RandomFromStream_OutItem) == 0x000240, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::CallFunc_Array_RandomFromStream_OutItem' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, CallFunc_Array_RandomFromStream_OutIndex) == 0x000248, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::CallFunc_Array_RandomFromStream_OutIndex' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000250, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, CallFunc_Array_Get_Item_1) == 0x000268, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, CallFunc_Add_VectorVector_ReturnValue) == 0x000270, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000288, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, CallFunc_MakeTransform_ReturnValue_1) == 0x0002A0, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000300, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, CallFunc_Array_Length_ReturnValue_1) == 0x000308, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, CallFunc_FinishSpawningActor_ReturnValue) == 0x000310, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, CallFunc_Less_IntInt_ReturnValue_1) == 0x000318, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, CallFunc_GetGameMode_ReturnValue_1) == 0x000320, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::CallFunc_GetGameMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, K2Node_DynamicCast_AsBP_Granny_Gamemode_1) == 0x000328, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::K2Node_DynamicCast_AsBP_Granny_Gamemode_1' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, K2Node_DynamicCast_bSuccess_1) == 0x000330, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, CallFunc_Array_RandomFromStream_OutItem_1) == 0x000338, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::CallFunc_Array_RandomFromStream_OutItem_1' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, CallFunc_Array_RandomFromStream_OutIndex_1) == 0x000340, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::CallFunc_Array_RandomFromStream_OutIndex_1' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x000348, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, CallFunc_MakeTransform_ReturnValue_2) == 0x000360, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::CallFunc_MakeTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x0003C0, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x0003C8, "Member 'BP_ItemSpawnPoint_C_ExecuteUbergraph_BP_ItemSpawnPoint::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");

// Function BP_ItemSpawnPoint.BP_ItemSpawnPoint_C.BreakStructArray
// 0x00D0 (0x00D0 - 0x0000)
struct BP_ItemSpawnPoint_C_BreakStructArray final
{
public:
	TArray<class UClass*>                         ItemArr;                                           // 0x0000(0x0010)(Parm, OutParm)
	TArray<struct FTransform>                     PositionsArr;                                      // 0x0010(0x0010)(Parm, OutParm)
	TArray<struct FTransform>                     Positions;                                         // 0x0020(0x0010)(Edit, BlueprintVisible)
	TArray<class UClass*>                         Items;                                             // 0x0030(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_ItemPosition                       CallFunc_Array_Get_Item;                           // 0x0050(0x0070)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2855[0x3];                                     // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemSpawnPoint_C_BreakStructArray) == 0x000010, "Wrong alignment on BP_ItemSpawnPoint_C_BreakStructArray");
static_assert(sizeof(BP_ItemSpawnPoint_C_BreakStructArray) == 0x0000D0, "Wrong size on BP_ItemSpawnPoint_C_BreakStructArray");
static_assert(offsetof(BP_ItemSpawnPoint_C_BreakStructArray, ItemArr) == 0x000000, "Member 'BP_ItemSpawnPoint_C_BreakStructArray::ItemArr' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_BreakStructArray, PositionsArr) == 0x000010, "Member 'BP_ItemSpawnPoint_C_BreakStructArray::PositionsArr' has a wrong offset!");
static_assert(offsetof(BP_ItemSpawnPoint_C_BreakStructArray, Positions) == 0x000020, "Member 'BP_ItemSpawnPoint_C_BreakStructArray::Positions' has a wrong offset!");
