#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_CoreInteractable_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ItemBase.BP_ItemBase_C
// 0x0118 (0x03F0 - 0x02D8)
class ABP_ItemBase_C : public ABP_CoreInteractable_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Mesh;                                              // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Pivot;                                             // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        HandDistance;                                      // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SafeLocation;                                      // 0x02F8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ProbeSize;                                         // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ItemTaken;                                         // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24AA[0x7];                                     // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             StartMeshTransform;                                // 0x0320(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NewVar;                                            // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Animating;                                         // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24AB[0x7];                                     // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DebugName;                                         // 0x0390(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class USoundBase*                             DropSound;                                         // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        DropNeedForce;                                     // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Volume;                                            // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PlayerSpeedMult;                                   // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnTaken;                                           // 0x03C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class ABP_Player_C*                           Player;                                            // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               GRANNYHANDROTATION;                                // 0x03D8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void Use(class ABP_Player_C* Param_Player, bool Start);
	void TeleportToSafeLocation();
	void Taken(bool ByGranny);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void OnTaken__DelegateSignature();
	void ItemAnim();
	void InteractEnd(class ABP_Player_C* Param_Player);
	void InteractCanceled(class ABP_Player_C* Param_Player);
	void Interact(class ABP_Player_C* Param_Player, const struct FHitResult& Hit);
	void ExecuteUbergraph_BP_ItemBase(int32 EntryPoint);
	void Dropped();
	void CustomEvent(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void CalcSafeLocation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ItemBase_C">();
	}
	static class ABP_ItemBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ItemBase_C>();
	}
};
static_assert(alignof(ABP_ItemBase_C) == 0x000010, "Wrong alignment on ABP_ItemBase_C");
static_assert(sizeof(ABP_ItemBase_C) == 0x0003F0, "Wrong size on ABP_ItemBase_C");
static_assert(offsetof(ABP_ItemBase_C, UberGraphFrame) == 0x0002D8, "Member 'ABP_ItemBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ItemBase_C, Mesh) == 0x0002E0, "Member 'ABP_ItemBase_C::Mesh' has a wrong offset!");
static_assert(offsetof(ABP_ItemBase_C, Pivot) == 0x0002E8, "Member 'ABP_ItemBase_C::Pivot' has a wrong offset!");
static_assert(offsetof(ABP_ItemBase_C, HandDistance) == 0x0002F0, "Member 'ABP_ItemBase_C::HandDistance' has a wrong offset!");
static_assert(offsetof(ABP_ItemBase_C, SafeLocation) == 0x0002F8, "Member 'ABP_ItemBase_C::SafeLocation' has a wrong offset!");
static_assert(offsetof(ABP_ItemBase_C, ProbeSize) == 0x000310, "Member 'ABP_ItemBase_C::ProbeSize' has a wrong offset!");
static_assert(offsetof(ABP_ItemBase_C, ItemTaken) == 0x000318, "Member 'ABP_ItemBase_C::ItemTaken' has a wrong offset!");
static_assert(offsetof(ABP_ItemBase_C, StartMeshTransform) == 0x000320, "Member 'ABP_ItemBase_C::StartMeshTransform' has a wrong offset!");
static_assert(offsetof(ABP_ItemBase_C, NewVar) == 0x000380, "Member 'ABP_ItemBase_C::NewVar' has a wrong offset!");
static_assert(offsetof(ABP_ItemBase_C, Animating) == 0x000388, "Member 'ABP_ItemBase_C::Animating' has a wrong offset!");
static_assert(offsetof(ABP_ItemBase_C, DebugName) == 0x000390, "Member 'ABP_ItemBase_C::DebugName' has a wrong offset!");
static_assert(offsetof(ABP_ItemBase_C, DropSound) == 0x0003A0, "Member 'ABP_ItemBase_C::DropSound' has a wrong offset!");
static_assert(offsetof(ABP_ItemBase_C, DropNeedForce) == 0x0003A8, "Member 'ABP_ItemBase_C::DropNeedForce' has a wrong offset!");
static_assert(offsetof(ABP_ItemBase_C, Volume) == 0x0003B0, "Member 'ABP_ItemBase_C::Volume' has a wrong offset!");
static_assert(offsetof(ABP_ItemBase_C, PlayerSpeedMult) == 0x0003B8, "Member 'ABP_ItemBase_C::PlayerSpeedMult' has a wrong offset!");
static_assert(offsetof(ABP_ItemBase_C, OnTaken) == 0x0003C0, "Member 'ABP_ItemBase_C::OnTaken' has a wrong offset!");
static_assert(offsetof(ABP_ItemBase_C, Player) == 0x0003D0, "Member 'ABP_ItemBase_C::Player' has a wrong offset!");
static_assert(offsetof(ABP_ItemBase_C, GRANNYHANDROTATION) == 0x0003D8, "Member 'ABP_ItemBase_C::GRANNYHANDROTATION' has a wrong offset!");

}

