#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NotificationVolume

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_InteractableBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NotificationVolume.BP_NotificationVolume_C
// 0x0028 (0x0318 - 0x02F0)
class ABP_NotificationVolume_C final : public ABP_InteractableBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_NotificationVolume_C;            // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FText                                   Notification;                                      // 0x0300(0x0018)(Edit, BlueprintVisible)

public:
	void Interact(class ABP_Player_C* Player, const struct FHitResult& Hit);
	void ExecuteUbergraph_BP_NotificationVolume(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_NotificationVolume_C">();
	}
	static class ABP_NotificationVolume_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_NotificationVolume_C>();
	}
};
static_assert(alignof(ABP_NotificationVolume_C) == 0x000008, "Wrong alignment on ABP_NotificationVolume_C");
static_assert(sizeof(ABP_NotificationVolume_C) == 0x000318, "Wrong size on ABP_NotificationVolume_C");
static_assert(offsetof(ABP_NotificationVolume_C, UberGraphFrame_BP_NotificationVolume_C) == 0x0002F0, "Member 'ABP_NotificationVolume_C::UberGraphFrame_BP_NotificationVolume_C' has a wrong offset!");
static_assert(offsetof(ABP_NotificationVolume_C, Box) == 0x0002F8, "Member 'ABP_NotificationVolume_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_NotificationVolume_C, Notification) == 0x000300, "Member 'ABP_NotificationVolume_C::Notification' has a wrong offset!");

}

