#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PicturePart

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_PicturePart.BP_PicturePart_C.UserConstructionScript
// 0x0028 (0x0028 - 0x0000)
struct BP_PicturePart_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_226E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PicturePart_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_PicturePart_C_UserConstructionScript");
static_assert(sizeof(BP_PicturePart_C_UserConstructionScript) == 0x000028, "Wrong size on BP_PicturePart_C_UserConstructionScript");
static_assert(offsetof(BP_PicturePart_C_UserConstructionScript, Temp_int_Variable) == 0x000000, "Member 'BP_PicturePart_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_PicturePart_C_UserConstructionScript, Temp_object_Variable) == 0x000008, "Member 'BP_PicturePart_C_UserConstructionScript::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_PicturePart_C_UserConstructionScript, Temp_object_Variable_1) == 0x000010, "Member 'BP_PicturePart_C_UserConstructionScript::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PicturePart_C_UserConstructionScript, K2Node_Select_Default) == 0x000018, "Member 'BP_PicturePart_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_PicturePart_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000020, "Member 'BP_PicturePart_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function BP_PicturePart.BP_PicturePart_C.Use
// 0x0010 (0x0010 - 0x0000)
struct BP_PicturePart_C_Use final
{
public:
	class ABP_Player_C*                           Param_Player;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Start;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PicturePart_C_Use) == 0x000008, "Wrong alignment on BP_PicturePart_C_Use");
static_assert(sizeof(BP_PicturePart_C_Use) == 0x000010, "Wrong size on BP_PicturePart_C_Use");
static_assert(offsetof(BP_PicturePart_C_Use, Param_Player) == 0x000000, "Member 'BP_PicturePart_C_Use::Param_Player' has a wrong offset!");
static_assert(offsetof(BP_PicturePart_C_Use, Start) == 0x000008, "Member 'BP_PicturePart_C_Use::Start' has a wrong offset!");

// Function BP_PicturePart.BP_PicturePart_C.ExecuteUbergraph_BP_PicturePart
// 0x0018 (0x0018 - 0x0000)
struct BP_PicturePart_C_ExecuteUbergraph_BP_PicturePart final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_226F[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Player_C*                           K2Node_Event_Player;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Start;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PicturePart_C_ExecuteUbergraph_BP_PicturePart) == 0x000008, "Wrong alignment on BP_PicturePart_C_ExecuteUbergraph_BP_PicturePart");
static_assert(sizeof(BP_PicturePart_C_ExecuteUbergraph_BP_PicturePart) == 0x000018, "Wrong size on BP_PicturePart_C_ExecuteUbergraph_BP_PicturePart");
static_assert(offsetof(BP_PicturePart_C_ExecuteUbergraph_BP_PicturePart, EntryPoint) == 0x000000, "Member 'BP_PicturePart_C_ExecuteUbergraph_BP_PicturePart::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PicturePart_C_ExecuteUbergraph_BP_PicturePart, K2Node_Event_Player) == 0x000008, "Member 'BP_PicturePart_C_ExecuteUbergraph_BP_PicturePart::K2Node_Event_Player' has a wrong offset!");
static_assert(offsetof(BP_PicturePart_C_ExecuteUbergraph_BP_PicturePart, K2Node_Event_Start) == 0x000010, "Member 'BP_PicturePart_C_ExecuteUbergraph_BP_PicturePart::K2Node_Event_Start' has a wrong offset!");

}

