#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Rock

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Rock.BP_Rock_C.Use
// 0x0010 (0x0010 - 0x0000)
struct BP_Rock_C_Use final
{
public:
	class ABP_Player_C*                           Param_Player;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Start;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Rock_C_Use) == 0x000008, "Wrong alignment on BP_Rock_C_Use");
static_assert(sizeof(BP_Rock_C_Use) == 0x000010, "Wrong size on BP_Rock_C_Use");
static_assert(offsetof(BP_Rock_C_Use, Param_Player) == 0x000000, "Member 'BP_Rock_C_Use::Param_Player' has a wrong offset!");
static_assert(offsetof(BP_Rock_C_Use, Start) == 0x000008, "Member 'BP_Rock_C_Use::Start' has a wrong offset!");

// Function BP_Rock.BP_Rock_C.ExecuteUbergraph_BP_Rock
// 0x0138 (0x0138 - 0x0000)
struct BP_Rock_C_ExecuteUbergraph_BP_Rock final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_226A[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_226B[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_AddRelativeLocation_SweepHitResult;    // 0x0028(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ABP_Player_C*                           K2Node_Event_Player;                               // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Start;                                // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_226C[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Rock_C_ExecuteUbergraph_BP_Rock) == 0x000008, "Wrong alignment on BP_Rock_C_ExecuteUbergraph_BP_Rock");
static_assert(sizeof(BP_Rock_C_ExecuteUbergraph_BP_Rock) == 0x000138, "Wrong size on BP_Rock_C_ExecuteUbergraph_BP_Rock");
static_assert(offsetof(BP_Rock_C_ExecuteUbergraph_BP_Rock, EntryPoint) == 0x000000, "Member 'BP_Rock_C_ExecuteUbergraph_BP_Rock::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Rock_C_ExecuteUbergraph_BP_Rock, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'BP_Rock_C_ExecuteUbergraph_BP_Rock::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Rock_C_ExecuteUbergraph_BP_Rock, CallFunc_VLerp_ReturnValue) == 0x000008, "Member 'BP_Rock_C_ExecuteUbergraph_BP_Rock::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Rock_C_ExecuteUbergraph_BP_Rock, Temp_bool_Has_Been_Initd_Variable) == 0x000020, "Member 'BP_Rock_C_ExecuteUbergraph_BP_Rock::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Rock_C_ExecuteUbergraph_BP_Rock, CallFunc_K2_AddRelativeLocation_SweepHitResult) == 0x000028, "Member 'BP_Rock_C_ExecuteUbergraph_BP_Rock::CallFunc_K2_AddRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Rock_C_ExecuteUbergraph_BP_Rock, K2Node_Event_Player) == 0x000110, "Member 'BP_Rock_C_ExecuteUbergraph_BP_Rock::K2Node_Event_Player' has a wrong offset!");
static_assert(offsetof(BP_Rock_C_ExecuteUbergraph_BP_Rock, K2Node_Event_Start) == 0x000118, "Member 'BP_Rock_C_ExecuteUbergraph_BP_Rock::K2Node_Event_Start' has a wrong offset!");
static_assert(offsetof(BP_Rock_C_ExecuteUbergraph_BP_Rock, CallFunc_RandomUnitVector_ReturnValue) == 0x000120, "Member 'BP_Rock_C_ExecuteUbergraph_BP_Rock::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");

}

