#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RemoteControl

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_RemoteControl.BP_RemoteControl_C.Use
// 0x0010 (0x0010 - 0x0000)
struct BP_RemoteControl_C_Use final
{
public:
	class ABP_Player_C*                           Param_Player;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Start;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RemoteControl_C_Use) == 0x000008, "Wrong alignment on BP_RemoteControl_C_Use");
static_assert(sizeof(BP_RemoteControl_C_Use) == 0x000010, "Wrong size on BP_RemoteControl_C_Use");
static_assert(offsetof(BP_RemoteControl_C_Use, Param_Player) == 0x000000, "Member 'BP_RemoteControl_C_Use::Param_Player' has a wrong offset!");
static_assert(offsetof(BP_RemoteControl_C_Use, Start) == 0x000008, "Member 'BP_RemoteControl_C_Use::Start' has a wrong offset!");

// Function BP_RemoteControl.BP_RemoteControl_C.Interact
// 0x00F0 (0x00F0 - 0x0000)
struct BP_RemoteControl_C_Interact final
{
public:
	class ABP_Player_C*                           Param_Player;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x00E8)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_RemoteControl_C_Interact) == 0x000008, "Wrong alignment on BP_RemoteControl_C_Interact");
static_assert(sizeof(BP_RemoteControl_C_Interact) == 0x0000F0, "Wrong size on BP_RemoteControl_C_Interact");
static_assert(offsetof(BP_RemoteControl_C_Interact, Param_Player) == 0x000000, "Member 'BP_RemoteControl_C_Interact::Param_Player' has a wrong offset!");
static_assert(offsetof(BP_RemoteControl_C_Interact, Hit) == 0x000008, "Member 'BP_RemoteControl_C_Interact::Hit' has a wrong offset!");

// Function BP_RemoteControl.BP_RemoteControl_C.ExecuteUbergraph_BP_RemoteControl
// 0x01A8 (0x01A8 - 0x0000)
struct BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2264[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2265[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_RemoteControlUi_C*                 K2Node_DynamicCast_AsWBP_Remote_Control_Ui;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2266[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Player_C*                           K2Node_Event_Player_1;                             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Start;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2267[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Player_C*                           K2Node_Event_Player;                               // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0040(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<class ABP_RemoteDoor_C*>               CallFunc_GetAllActorsOfClass_OutActors;            // 0x0128(0x0010)(ReferenceParm)
	class ABP_RemoteDoor_C*                       CallFunc_Array_Get_Item;                           // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2268[0x7];                                     // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue_1;                  // 0x0190(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_RemoteControlUi_C*                 K2Node_DynamicCast_AsWBP_Remote_Control_Ui_1;      // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl) == 0x000008, "Wrong alignment on BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl");
static_assert(sizeof(BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl) == 0x0001A8, "Wrong size on BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl");
static_assert(offsetof(BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl, EntryPoint) == 0x000000, "Member 'BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl, CallFunc_GetWidget_ReturnValue) == 0x000008, "Member 'BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl, Temp_bool_Has_Been_Initd_Variable) == 0x000010, "Member 'BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl, K2Node_DynamicCast_AsWBP_Remote_Control_Ui) == 0x000018, "Member 'BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl::K2Node_DynamicCast_AsWBP_Remote_Control_Ui' has a wrong offset!");
static_assert(offsetof(BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl, Temp_bool_IsClosed_Variable) == 0x000021, "Member 'BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl, K2Node_Event_Player_1) == 0x000028, "Member 'BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl::K2Node_Event_Player_1' has a wrong offset!");
static_assert(offsetof(BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl, K2Node_Event_Start) == 0x000030, "Member 'BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl::K2Node_Event_Start' has a wrong offset!");
static_assert(offsetof(BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl, K2Node_Event_Player) == 0x000038, "Member 'BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl::K2Node_Event_Player' has a wrong offset!");
static_assert(offsetof(BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl, K2Node_Event_Hit) == 0x000040, "Member 'BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl, CallFunc_GetAllActorsOfClass_OutActors) == 0x000128, "Member 'BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl, CallFunc_Array_Get_Item) == 0x000138, "Member 'BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000140, "Member 'BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000158, "Member 'BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl, CallFunc_Vector_Distance_ReturnValue) == 0x000170, "Member 'BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000178, "Member 'BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000180, "Member 'BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl, CallFunc_GetWidget_ReturnValue_1) == 0x000190, "Member 'BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl::CallFunc_GetWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl, K2Node_DynamicCast_AsWBP_Remote_Control_Ui_1) == 0x000198, "Member 'BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl::K2Node_DynamicCast_AsWBP_Remote_Control_Ui_1' has a wrong offset!");
static_assert(offsetof(BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl, K2Node_DynamicCast_bSuccess_1) == 0x0001A0, "Member 'BP_RemoteControl_C_ExecuteUbergraph_BP_RemoteControl::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

