#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Rock

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_ItemBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Rock.BP_Rock_C
// 0x0030 (0x0420 - 0x03F0)
class ABP_Rock_C final : public ABP_ItemBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Rock_C;                          // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_NewTrack_0_E63D6023454D4E01C485C88D59545A39; // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_E63D6023454D4E01C485C88D59545A39; // 0x03FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2269[0x3];                                     // 0x03FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NewVar_0_0;                                        // 0x0408(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Use(class ABP_Player_C* Param_Player, bool Start);
	void Timeline__UpdateFunc();
	void Timeline__FinishedFunc();
	void ExecuteUbergraph_BP_Rock(int32 EntryPoint);
	void AddPlayerAnimation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Rock_C">();
	}
	static class ABP_Rock_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Rock_C>();
	}
};
static_assert(alignof(ABP_Rock_C) == 0x000010, "Wrong alignment on ABP_Rock_C");
static_assert(sizeof(ABP_Rock_C) == 0x000420, "Wrong size on ABP_Rock_C");
static_assert(offsetof(ABP_Rock_C, UberGraphFrame_BP_Rock_C) == 0x0003F0, "Member 'ABP_Rock_C::UberGraphFrame_BP_Rock_C' has a wrong offset!");
static_assert(offsetof(ABP_Rock_C, Timeline_NewTrack_0_E63D6023454D4E01C485C88D59545A39) == 0x0003F8, "Member 'ABP_Rock_C::Timeline_NewTrack_0_E63D6023454D4E01C485C88D59545A39' has a wrong offset!");
static_assert(offsetof(ABP_Rock_C, Timeline__Direction_E63D6023454D4E01C485C88D59545A39) == 0x0003FC, "Member 'ABP_Rock_C::Timeline__Direction_E63D6023454D4E01C485C88D59545A39' has a wrong offset!");
static_assert(offsetof(ABP_Rock_C, Timeline) == 0x000400, "Member 'ABP_Rock_C::Timeline' has a wrong offset!");
static_assert(offsetof(ABP_Rock_C, NewVar_0_0) == 0x000408, "Member 'ABP_Rock_C::NewVar_0_0' has a wrong offset!");

}

