#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RemoteDoor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_RemoteDoor.BP_RemoteDoor_C.Interact
// 0x00F0 (0x00F0 - 0x0000)
struct BP_RemoteDoor_C_Interact final
{
public:
	class ABP_Player_C*                           Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x00E8)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_RemoteDoor_C_Interact) == 0x000008, "Wrong alignment on BP_RemoteDoor_C_Interact");
static_assert(sizeof(BP_RemoteDoor_C_Interact) == 0x0000F0, "Wrong size on BP_RemoteDoor_C_Interact");
static_assert(offsetof(BP_RemoteDoor_C_Interact, Player) == 0x000000, "Member 'BP_RemoteDoor_C_Interact::Player' has a wrong offset!");
static_assert(offsetof(BP_RemoteDoor_C_Interact, Hit) == 0x000008, "Member 'BP_RemoteDoor_C_Interact::Hit' has a wrong offset!");

// Function BP_RemoteDoor.BP_RemoteDoor_C.ExecuteUbergraph_BP_RemoteDoor
// 0x0280 (0x0280 - 0x0000)
struct BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_253F[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2540[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2541[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2542[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Player_C*                           K2Node_Event_Player;                               // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0068(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0150(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0238(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2543[0x4];                                     // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ItemBase_C*                         K2Node_DynamicCast_AsBP_Item_Base;                 // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2544[0x6];                                     // 0x0262(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor) == 0x000008, "Wrong alignment on BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor");
static_assert(sizeof(BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor) == 0x000280, "Wrong size on BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor");
static_assert(offsetof(BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor, EntryPoint) == 0x000000, "Member 'BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor, CallFunc_SelectColor_ReturnValue) == 0x000004, "Member 'BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor, CallFunc_Lerp_ReturnValue) == 0x000018, "Member 'BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor, CallFunc_MakeRotator_ReturnValue) == 0x000020, "Member 'BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor, Temp_bool_Has_Been_Initd_Variable) == 0x000038, "Member 'BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor, K2Node_CreateDelegate_OutputDelegate) == 0x00003C, "Member 'BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000050, "Member 'BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor, Temp_bool_IsClosed_Variable) == 0x000058, "Member 'BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor, K2Node_Event_Player) == 0x000060, "Member 'BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor::K2Node_Event_Player' has a wrong offset!");
static_assert(offsetof(BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor, K2Node_Event_Hit) == 0x000068, "Member 'BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000150, "Member 'BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000238, "Member 'BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor, CallFunc_Array_Get_Item) == 0x000248, "Member 'BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor, CallFunc_Array_Length_ReturnValue) == 0x000250, "Member 'BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor, K2Node_DynamicCast_AsBP_Item_Base) == 0x000258, "Member 'BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor::K2Node_DynamicCast_AsBP_Item_Base' has a wrong offset!");
static_assert(offsetof(BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor, K2Node_DynamicCast_bSuccess) == 0x000260, "Member 'BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor, CallFunc_Greater_IntInt_ReturnValue) == 0x000261, "Member 'BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000268, "Member 'BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor, CallFunc_Lerp_Alpha_ImplicitCast) == 0x000270, "Member 'BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000278, "Member 'BP_RemoteDoor_C_ExecuteUbergraph_BP_RemoteDoor::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");

}

