#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SaveGame

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SaveGame.BP_SaveGame_C
// 0x0018 (0x0040 - 0x0028)
class UBP_SaveGame_C final : public USaveGame
{
public:
	bool                                          GameCompleted;                                     // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224D[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumCompleted;                                      // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumCompletedNormal;                                // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumCompletedHard;                                  // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumCompletedExtreme;                               // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SaveGame_C">();
	}
	static class UBP_SaveGame_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SaveGame_C>();
	}
};
static_assert(alignof(UBP_SaveGame_C) == 0x000008, "Wrong alignment on UBP_SaveGame_C");
static_assert(sizeof(UBP_SaveGame_C) == 0x000040, "Wrong size on UBP_SaveGame_C");
static_assert(offsetof(UBP_SaveGame_C, GameCompleted) == 0x000028, "Member 'UBP_SaveGame_C::GameCompleted' has a wrong offset!");
static_assert(offsetof(UBP_SaveGame_C, NumCompleted) == 0x00002C, "Member 'UBP_SaveGame_C::NumCompleted' has a wrong offset!");
static_assert(offsetof(UBP_SaveGame_C, NumCompletedNormal) == 0x000030, "Member 'UBP_SaveGame_C::NumCompletedNormal' has a wrong offset!");
static_assert(offsetof(UBP_SaveGame_C, NumCompletedHard) == 0x000034, "Member 'UBP_SaveGame_C::NumCompletedHard' has a wrong offset!");
static_assert(offsetof(UBP_SaveGame_C, NumCompletedExtreme) == 0x000038, "Member 'UBP_SaveGame_C::NumCompletedExtreme' has a wrong offset!");

}

