#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SafeKey

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_SafeKey.BP_SafeKey_C.Taken
// 0x0001 (0x0001 - 0x0000)
struct BP_SafeKey_C_Taken final
{
public:
	bool                                          ByGranny;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SafeKey_C_Taken) == 0x000001, "Wrong alignment on BP_SafeKey_C_Taken");
static_assert(sizeof(BP_SafeKey_C_Taken) == 0x000001, "Wrong size on BP_SafeKey_C_Taken");
static_assert(offsetof(BP_SafeKey_C_Taken, ByGranny) == 0x000000, "Member 'BP_SafeKey_C_Taken::ByGranny' has a wrong offset!");

// Function BP_SafeKey.BP_SafeKey_C.ExecuteUbergraph_BP_SafeKey
// 0x0008 (0x0008 - 0x0000)
struct BP_SafeKey_C_ExecuteUbergraph_BP_SafeKey final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_ByGranny;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SafeKey_C_ExecuteUbergraph_BP_SafeKey) == 0x000004, "Wrong alignment on BP_SafeKey_C_ExecuteUbergraph_BP_SafeKey");
static_assert(sizeof(BP_SafeKey_C_ExecuteUbergraph_BP_SafeKey) == 0x000008, "Wrong size on BP_SafeKey_C_ExecuteUbergraph_BP_SafeKey");
static_assert(offsetof(BP_SafeKey_C_ExecuteUbergraph_BP_SafeKey, EntryPoint) == 0x000000, "Member 'BP_SafeKey_C_ExecuteUbergraph_BP_SafeKey::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SafeKey_C_ExecuteUbergraph_BP_SafeKey, K2Node_Event_ByGranny) == 0x000004, "Member 'BP_SafeKey_C_ExecuteUbergraph_BP_SafeKey::K2Node_Event_ByGranny' has a wrong offset!");

}

