#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TreasureChest

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_TreasureChest.BP_TreasureChest_C.Interact
// 0x00F0 (0x00F0 - 0x0000)
struct BP_TreasureChest_C_Interact final
{
public:
	class ABP_Player_C*                           Param_Player;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x00E8)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_TreasureChest_C_Interact) == 0x000008, "Wrong alignment on BP_TreasureChest_C_Interact");
static_assert(sizeof(BP_TreasureChest_C_Interact) == 0x0000F0, "Wrong size on BP_TreasureChest_C_Interact");
static_assert(offsetof(BP_TreasureChest_C_Interact, Param_Player) == 0x000000, "Member 'BP_TreasureChest_C_Interact::Param_Player' has a wrong offset!");
static_assert(offsetof(BP_TreasureChest_C_Interact, Hit) == 0x000008, "Member 'BP_TreasureChest_C_Interact::Hit' has a wrong offset!");

// Function BP_TreasureChest.BP_TreasureChest_C.GetAllNotUnscrewed
// 0x0058 (0x0058 - 0x0000)
struct BP_TreasureChest_C_GetAllNotUnscrewed final
{
public:
	TArray<class UStaticMeshComponent*>           NewLocalVar1;                                      // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UStaticMeshComponent*>           NewLocalVar;                                       // 0x0010(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25F9[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ComponentHasTag_ReturnValue;              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25FA[0x2];                                     // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TreasureChest_C_GetAllNotUnscrewed) == 0x000008, "Wrong alignment on BP_TreasureChest_C_GetAllNotUnscrewed");
static_assert(sizeof(BP_TreasureChest_C_GetAllNotUnscrewed) == 0x000058, "Wrong size on BP_TreasureChest_C_GetAllNotUnscrewed");
static_assert(offsetof(BP_TreasureChest_C_GetAllNotUnscrewed, NewLocalVar1) == 0x000000, "Member 'BP_TreasureChest_C_GetAllNotUnscrewed::NewLocalVar1' has a wrong offset!");
static_assert(offsetof(BP_TreasureChest_C_GetAllNotUnscrewed, NewLocalVar) == 0x000010, "Member 'BP_TreasureChest_C_GetAllNotUnscrewed::NewLocalVar' has a wrong offset!");
static_assert(offsetof(BP_TreasureChest_C_GetAllNotUnscrewed, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BP_TreasureChest_C_GetAllNotUnscrewed::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TreasureChest_C_GetAllNotUnscrewed, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'BP_TreasureChest_C_GetAllNotUnscrewed::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_TreasureChest_C_GetAllNotUnscrewed, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_TreasureChest_C_GetAllNotUnscrewed::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TreasureChest_C_GetAllNotUnscrewed, K2Node_MakeArray_Array) == 0x000030, "Member 'BP_TreasureChest_C_GetAllNotUnscrewed::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_TreasureChest_C_GetAllNotUnscrewed, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_TreasureChest_C_GetAllNotUnscrewed::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TreasureChest_C_GetAllNotUnscrewed, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_TreasureChest_C_GetAllNotUnscrewed::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TreasureChest_C_GetAllNotUnscrewed, CallFunc_ComponentHasTag_ReturnValue) == 0x00004C, "Member 'BP_TreasureChest_C_GetAllNotUnscrewed::CallFunc_ComponentHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TreasureChest_C_GetAllNotUnscrewed, CallFunc_Less_IntInt_ReturnValue) == 0x00004D, "Member 'BP_TreasureChest_C_GetAllNotUnscrewed::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TreasureChest_C_GetAllNotUnscrewed, CallFunc_Array_Add_ReturnValue) == 0x000050, "Member 'BP_TreasureChest_C_GetAllNotUnscrewed::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_TreasureChest.BP_TreasureChest_C.ExecuteUbergraph_BP_TreasureChest
// 0x0380 (0x0380 - 0x0000)
struct BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25FB[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25FC[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Player_C*                           K2Node_Event_Player;                               // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0030(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25FD[0x2];                                     // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25FE[0x4];                                     // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25FF[0x4];                                     // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ItemInHands_InHands;                      // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2600[0x7];                                     // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ItemBase_C*                         CallFunc_ItemInHands_ItemRef;                      // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2601[0x7];                                     // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0208(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2602[0x8];                                     // 0x0308(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x0310(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ExtraKey_C*                         CallFunc_FinishSpawningActor_ReturnValue;          // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest) == 0x000010, "Wrong alignment on BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest");
static_assert(sizeof(BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest) == 0x000380, "Wrong size on BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest");
static_assert(offsetof(BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest, EntryPoint) == 0x000000, "Member 'BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest, CallFunc_RLerp_ReturnValue) == 0x000008, "Member 'BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest, Temp_bool_Has_Been_Initd_Variable) == 0x000020, "Member 'BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest, K2Node_Event_Player) == 0x000028, "Member 'BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest::K2Node_Event_Player' has a wrong offset!");
static_assert(offsetof(BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest, K2Node_Event_Hit) == 0x000030, "Member 'BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest, CallFunc_BreakHitResult_bBlockingHit) == 0x000118, "Member 'BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest, CallFunc_BreakHitResult_bInitialOverlap) == 0x000119, "Member 'BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest, CallFunc_BreakHitResult_Time) == 0x00011C, "Member 'BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest, CallFunc_BreakHitResult_Distance) == 0x000120, "Member 'BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest, CallFunc_BreakHitResult_Location) == 0x000128, "Member 'BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest, CallFunc_BreakHitResult_ImpactPoint) == 0x000140, "Member 'BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest, CallFunc_BreakHitResult_Normal) == 0x000158, "Member 'BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest, CallFunc_BreakHitResult_ImpactNormal) == 0x000170, "Member 'BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest, CallFunc_BreakHitResult_PhysMat) == 0x000188, "Member 'BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest, CallFunc_BreakHitResult_HitActor) == 0x000190, "Member 'BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest, CallFunc_BreakHitResult_HitComponent) == 0x000198, "Member 'BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest, CallFunc_BreakHitResult_HitBoneName) == 0x0001A0, "Member 'BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest, CallFunc_BreakHitResult_BoneName) == 0x0001A8, "Member 'BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest, CallFunc_BreakHitResult_HitItem) == 0x0001B0, "Member 'BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest, CallFunc_BreakHitResult_ElementIndex) == 0x0001B4, "Member 'BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest, CallFunc_BreakHitResult_FaceIndex) == 0x0001B8, "Member 'BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest, CallFunc_BreakHitResult_TraceStart) == 0x0001C0, "Member 'BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest, CallFunc_BreakHitResult_TraceEnd) == 0x0001D8, "Member 'BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest, CallFunc_ItemInHands_InHands) == 0x0001F0, "Member 'BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest::CallFunc_ItemInHands_InHands' has a wrong offset!");
static_assert(offsetof(BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest, CallFunc_ItemInHands_ItemRef) == 0x0001F8, "Member 'BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest::CallFunc_ItemInHands_ItemRef' has a wrong offset!");
static_assert(offsetof(BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest, Temp_bool_IsClosed_Variable) == 0x000200, "Member 'BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000208, "Member 'BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0002F0, "Member 'BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x000310, "Member 'BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000370, "Member 'BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest, CallFunc_FinishSpawningActor_ReturnValue) == 0x000378, "Member 'BP_TreasureChest_C_ExecuteUbergraph_BP_TreasureChest::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

