#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_Debug

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPFL_Debug.BPFL_Debug_C.KESFHLKJIRKOGJRUIFJDGVNRJ
// 0x0058 (0x0058 - 0x0000)
struct BPFL_Debug_C_KESFHLKJIRKOGJRUIFJDGVNRJ final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          PrintToLog;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2802[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Text_Color;                                        // 0x0014(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2803[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Duration;                                          // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GrannyHUD_C*                        K2Node_DynamicCast_AsBP_Granny_HUD;                // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_Debug_C_KESFHLKJIRKOGJRUIFJDGVNRJ) == 0x000008, "Wrong alignment on BPFL_Debug_C_KESFHLKJIRKOGJRUIFJDGVNRJ");
static_assert(sizeof(BPFL_Debug_C_KESFHLKJIRKOGJRUIFJDGVNRJ) == 0x000058, "Wrong size on BPFL_Debug_C_KESFHLKJIRKOGJRUIFJDGVNRJ");
static_assert(offsetof(BPFL_Debug_C_KESFHLKJIRKOGJRUIFJDGVNRJ, String) == 0x000000, "Member 'BPFL_Debug_C_KESFHLKJIRKOGJRUIFJDGVNRJ::String' has a wrong offset!");
static_assert(offsetof(BPFL_Debug_C_KESFHLKJIRKOGJRUIFJDGVNRJ, PrintToLog) == 0x000010, "Member 'BPFL_Debug_C_KESFHLKJIRKOGJRUIFJDGVNRJ::PrintToLog' has a wrong offset!");
static_assert(offsetof(BPFL_Debug_C_KESFHLKJIRKOGJRUIFJDGVNRJ, Text_Color) == 0x000014, "Member 'BPFL_Debug_C_KESFHLKJIRKOGJRUIFJDGVNRJ::Text_Color' has a wrong offset!");
static_assert(offsetof(BPFL_Debug_C_KESFHLKJIRKOGJRUIFJDGVNRJ, Duration) == 0x000028, "Member 'BPFL_Debug_C_KESFHLKJIRKOGJRUIFJDGVNRJ::Duration' has a wrong offset!");
static_assert(offsetof(BPFL_Debug_C_KESFHLKJIRKOGJRUIFJDGVNRJ, __WorldContext) == 0x000030, "Member 'BPFL_Debug_C_KESFHLKJIRKOGJRUIFJDGVNRJ::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_Debug_C_KESFHLKJIRKOGJRUIFJDGVNRJ, CallFunc_GetPlayerController_ReturnValue) == 0x000038, "Member 'BPFL_Debug_C_KESFHLKJIRKOGJRUIFJDGVNRJ::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Debug_C_KESFHLKJIRKOGJRUIFJDGVNRJ, CallFunc_GetHUD_ReturnValue) == 0x000040, "Member 'BPFL_Debug_C_KESFHLKJIRKOGJRUIFJDGVNRJ::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Debug_C_KESFHLKJIRKOGJRUIFJDGVNRJ, K2Node_DynamicCast_AsBP_Granny_HUD) == 0x000048, "Member 'BPFL_Debug_C_KESFHLKJIRKOGJRUIFJDGVNRJ::K2Node_DynamicCast_AsBP_Granny_HUD' has a wrong offset!");
static_assert(offsetof(BPFL_Debug_C_KESFHLKJIRKOGJRUIFJDGVNRJ, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BPFL_Debug_C_KESFHLKJIRKOGJRUIFJDGVNRJ::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

