#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ClickableText

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "EClickableTextEffectType_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK::Params
{

// Function ClickableText.ClickableText_C.Tick
// 0x0048 (0x0048 - 0x0000)
struct ClickableText_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ClickableText_C_Tick) == 0x000008, "Wrong alignment on ClickableText_C_Tick");
static_assert(sizeof(ClickableText_C_Tick) == 0x000048, "Wrong size on ClickableText_C_Tick");
static_assert(offsetof(ClickableText_C_Tick, MyGeometry) == 0x000000, "Member 'ClickableText_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(ClickableText_C_Tick, InDeltaTime) == 0x000040, "Member 'ClickableText_C_Tick::InDeltaTime' has a wrong offset!");

// Function ClickableText.ClickableText_C.SetButtonParams
// 0x0048 (0x0048 - 0x0000)
struct ClickableText_C_SetButtonParams final
{
public:
	class FText                                   Param_Text;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FSlateColor                            Param_DefaultColor;                                // 0x0018(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FSlateColor                            Param_SelectedColor;                               // 0x002C(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm)
	EClickableTextEffectType                      Param_HoverEffect;                                 // 0x0040(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  Param_Justification;                               // 0x0041(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ClickableText_C_SetButtonParams) == 0x000008, "Wrong alignment on ClickableText_C_SetButtonParams");
static_assert(sizeof(ClickableText_C_SetButtonParams) == 0x000048, "Wrong size on ClickableText_C_SetButtonParams");
static_assert(offsetof(ClickableText_C_SetButtonParams, Param_Text) == 0x000000, "Member 'ClickableText_C_SetButtonParams::Param_Text' has a wrong offset!");
static_assert(offsetof(ClickableText_C_SetButtonParams, Param_DefaultColor) == 0x000018, "Member 'ClickableText_C_SetButtonParams::Param_DefaultColor' has a wrong offset!");
static_assert(offsetof(ClickableText_C_SetButtonParams, Param_SelectedColor) == 0x00002C, "Member 'ClickableText_C_SetButtonParams::Param_SelectedColor' has a wrong offset!");
static_assert(offsetof(ClickableText_C_SetButtonParams, Param_HoverEffect) == 0x000040, "Member 'ClickableText_C_SetButtonParams::Param_HoverEffect' has a wrong offset!");
static_assert(offsetof(ClickableText_C_SetButtonParams, Param_Justification) == 0x000041, "Member 'ClickableText_C_SetButtonParams::Param_Justification' has a wrong offset!");

// Function ClickableText.ClickableText_C.RetainerEffects
// 0x0060 (0x0060 - 0x0000)
struct ClickableText_C_RetainerEffects final
{
public:
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_1; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue_1;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_InterpSpeed_ImplicitCast;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_InterpSpeed_ImplicitCast_1;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Current_ImplicitCast;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Current_ImplicitCast_1;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ClickableText_C_RetainerEffects) == 0x000008, "Wrong alignment on ClickableText_C_RetainerEffects");
static_assert(sizeof(ClickableText_C_RetainerEffects) == 0x000060, "Wrong size on ClickableText_C_RetainerEffects");
static_assert(offsetof(ClickableText_C_RetainerEffects, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000000, "Member 'ClickableText_C_RetainerEffects::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClickableText_C_RetainerEffects, CallFunc_SelectFloat_ReturnValue) == 0x000008, "Member 'ClickableText_C_RetainerEffects::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClickableText_C_RetainerEffects, CallFunc_SelectFloat_ReturnValue_1) == 0x000010, "Member 'ClickableText_C_RetainerEffects::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClickableText_C_RetainerEffects, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x000018, "Member 'ClickableText_C_RetainerEffects::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClickableText_C_RetainerEffects, CallFunc_K2_GetScalarParameterValue_ReturnValue) == 0x000020, "Member 'ClickableText_C_RetainerEffects::CallFunc_K2_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClickableText_C_RetainerEffects, CallFunc_K2_GetScalarParameterValue_ReturnValue_1) == 0x000024, "Member 'ClickableText_C_RetainerEffects::CallFunc_K2_GetScalarParameterValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClickableText_C_RetainerEffects, CallFunc_FInterpTo_ReturnValue) == 0x000028, "Member 'ClickableText_C_RetainerEffects::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClickableText_C_RetainerEffects, CallFunc_FInterpTo_ReturnValue_1) == 0x000030, "Member 'ClickableText_C_RetainerEffects::CallFunc_FInterpTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClickableText_C_RetainerEffects, CallFunc_FInterpTo_InterpSpeed_ImplicitCast) == 0x000038, "Member 'ClickableText_C_RetainerEffects::CallFunc_FInterpTo_InterpSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ClickableText_C_RetainerEffects, CallFunc_FInterpTo_InterpSpeed_ImplicitCast_1) == 0x000040, "Member 'ClickableText_C_RetainerEffects::CallFunc_FInterpTo_InterpSpeed_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ClickableText_C_RetainerEffects, CallFunc_FInterpTo_Current_ImplicitCast) == 0x000048, "Member 'ClickableText_C_RetainerEffects::CallFunc_FInterpTo_Current_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ClickableText_C_RetainerEffects, CallFunc_FInterpTo_Current_ImplicitCast_1) == 0x000050, "Member 'ClickableText_C_RetainerEffects::CallFunc_FInterpTo_Current_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ClickableText_C_RetainerEffects, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000058, "Member 'ClickableText_C_RetainerEffects::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ClickableText_C_RetainerEffects, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x00005C, "Member 'ClickableText_C_RetainerEffects::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");

// Function ClickableText.ClickableText_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ClickableText_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ClickableText_C_PreConstruct) == 0x000001, "Wrong alignment on ClickableText_C_PreConstruct");
static_assert(sizeof(ClickableText_C_PreConstruct) == 0x000001, "Wrong size on ClickableText_C_PreConstruct");
static_assert(offsetof(ClickableText_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ClickableText_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ClickableText.ClickableText_C.OnClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ClickableText_C_OnClick__DelegateSignature final
{
public:
	class UClickableText_C*                       Param_Text;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ClickableText_C_OnClick__DelegateSignature) == 0x000008, "Wrong alignment on ClickableText_C_OnClick__DelegateSignature");
static_assert(sizeof(ClickableText_C_OnClick__DelegateSignature) == 0x000008, "Wrong size on ClickableText_C_OnClick__DelegateSignature");
static_assert(offsetof(ClickableText_C_OnClick__DelegateSignature, Param_Text) == 0x000000, "Member 'ClickableText_C_OnClick__DelegateSignature::Param_Text' has a wrong offset!");

// Function ClickableText.ClickableText_C.ExecuteUbergraph_ClickableText
// 0x0068 (0x0068 - 0x0000)
struct ClickableText_C_ExecuteUbergraph_ClickableText final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_283E[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0040)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_283F[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2840[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ClickableText_C_ExecuteUbergraph_ClickableText) == 0x000008, "Wrong alignment on ClickableText_C_ExecuteUbergraph_ClickableText");
static_assert(sizeof(ClickableText_C_ExecuteUbergraph_ClickableText) == 0x000068, "Wrong size on ClickableText_C_ExecuteUbergraph_ClickableText");
static_assert(offsetof(ClickableText_C_ExecuteUbergraph_ClickableText, EntryPoint) == 0x000000, "Member 'ClickableText_C_ExecuteUbergraph_ClickableText::EntryPoint' has a wrong offset!");
static_assert(offsetof(ClickableText_C_ExecuteUbergraph_ClickableText, K2Node_Event_IsDesignTime) == 0x000004, "Member 'ClickableText_C_ExecuteUbergraph_ClickableText::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ClickableText_C_ExecuteUbergraph_ClickableText, K2Node_Event_MyGeometry) == 0x000008, "Member 'ClickableText_C_ExecuteUbergraph_ClickableText::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(ClickableText_C_ExecuteUbergraph_ClickableText, K2Node_Event_InDeltaTime) == 0x000048, "Member 'ClickableText_C_ExecuteUbergraph_ClickableText::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(ClickableText_C_ExecuteUbergraph_ClickableText, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000050, "Member 'ClickableText_C_ExecuteUbergraph_ClickableText::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClickableText_C_ExecuteUbergraph_ClickableText, K2Node_SwitchEnum_CmpSuccess) == 0x000058, "Member 'ClickableText_C_ExecuteUbergraph_ClickableText::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ClickableText_C_ExecuteUbergraph_ClickableText, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000060, "Member 'ClickableText_C_ExecuteUbergraph_ClickableText::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");

// Function ClickableText.ClickableText_C.ColorEffects
// 0x0030 (0x0030 - 0x0000)
struct ClickableText_C_ColorEffects final
{
public:
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_CInterpTo_ReturnValue;                    // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CInterpTo_DeltaTime_ImplicitCast;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ClickableText_C_ColorEffects) == 0x000008, "Wrong alignment on ClickableText_C_ColorEffects");
static_assert(sizeof(ClickableText_C_ColorEffects) == 0x000030, "Wrong size on ClickableText_C_ColorEffects");
static_assert(offsetof(ClickableText_C_ColorEffects, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000000, "Member 'ClickableText_C_ColorEffects::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClickableText_C_ColorEffects, CallFunc_SelectColor_ReturnValue) == 0x000008, "Member 'ClickableText_C_ColorEffects::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClickableText_C_ColorEffects, CallFunc_CInterpTo_ReturnValue) == 0x000018, "Member 'ClickableText_C_ColorEffects::CallFunc_CInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClickableText_C_ColorEffects, CallFunc_CInterpTo_DeltaTime_ImplicitCast) == 0x000028, "Member 'ClickableText_C_ColorEffects::CallFunc_CInterpTo_DeltaTime_ImplicitCast' has a wrong offset!");

// Function ClickableText.ClickableText_C.ChangeText
// 0x0018 (0x0018 - 0x0000)
struct ClickableText_C_ChangeText final
{
public:
	class FText                                   Param_Text;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(ClickableText_C_ChangeText) == 0x000008, "Wrong alignment on ClickableText_C_ChangeText");
static_assert(sizeof(ClickableText_C_ChangeText) == 0x000018, "Wrong size on ClickableText_C_ChangeText");
static_assert(offsetof(ClickableText_C_ChangeText, Param_Text) == 0x000000, "Member 'ClickableText_C_ChangeText::Param_Text' has a wrong offset!");

// Function ClickableText.ClickableText_C.AdditionalEffects
// 0x00C8 (0x00C8 - 0x0000)
struct ClickableText_C_AdditionalEffects final
{
public:
	double                                        CallFunc_BreakVector2D_X;                          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2841[0x5];                                     // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWidgetTransform                       K2Node_MakeStruct_WidgetTransform;                 // 0x0050(0x0038)(NoDestructor)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2842[0x6];                                     // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue_1;                  // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_InterpSpeed_ImplicitCast;       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_InterpSpeed_ImplicitCast_1;     // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ClickableText_C_AdditionalEffects) == 0x000008, "Wrong alignment on ClickableText_C_AdditionalEffects");
static_assert(sizeof(ClickableText_C_AdditionalEffects) == 0x0000C8, "Wrong size on ClickableText_C_AdditionalEffects");
static_assert(offsetof(ClickableText_C_AdditionalEffects, CallFunc_BreakVector2D_X) == 0x000000, "Member 'ClickableText_C_AdditionalEffects::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(ClickableText_C_AdditionalEffects, CallFunc_BreakVector2D_Y) == 0x000008, "Member 'ClickableText_C_AdditionalEffects::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(ClickableText_C_AdditionalEffects, CallFunc_BreakVector2D_X_1) == 0x000010, "Member 'ClickableText_C_AdditionalEffects::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(ClickableText_C_AdditionalEffects, CallFunc_BreakVector2D_Y_1) == 0x000018, "Member 'ClickableText_C_AdditionalEffects::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(ClickableText_C_AdditionalEffects, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000020, "Member 'ClickableText_C_AdditionalEffects::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClickableText_C_AdditionalEffects, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000028, "Member 'ClickableText_C_AdditionalEffects::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClickableText_C_AdditionalEffects, K2Node_SwitchEnum_CmpSuccess) == 0x000029, "Member 'ClickableText_C_AdditionalEffects::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ClickableText_C_AdditionalEffects, CallFunc_BooleanAND_ReturnValue) == 0x00002A, "Member 'ClickableText_C_AdditionalEffects::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClickableText_C_AdditionalEffects, CallFunc_SelectFloat_ReturnValue) == 0x000030, "Member 'ClickableText_C_AdditionalEffects::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClickableText_C_AdditionalEffects, CallFunc_FInterpTo_ReturnValue) == 0x000038, "Member 'ClickableText_C_AdditionalEffects::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClickableText_C_AdditionalEffects, CallFunc_MakeVector2D_ReturnValue) == 0x000040, "Member 'ClickableText_C_AdditionalEffects::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(ClickableText_C_AdditionalEffects, K2Node_MakeStruct_WidgetTransform) == 0x000050, "Member 'ClickableText_C_AdditionalEffects::K2Node_MakeStruct_WidgetTransform' has a wrong offset!");
static_assert(offsetof(ClickableText_C_AdditionalEffects, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x000088, "Member 'ClickableText_C_AdditionalEffects::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClickableText_C_AdditionalEffects, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000090, "Member 'ClickableText_C_AdditionalEffects::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClickableText_C_AdditionalEffects, CallFunc_BooleanAND_ReturnValue_1) == 0x000091, "Member 'ClickableText_C_AdditionalEffects::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClickableText_C_AdditionalEffects, CallFunc_SelectFloat_ReturnValue_1) == 0x000098, "Member 'ClickableText_C_AdditionalEffects::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClickableText_C_AdditionalEffects, CallFunc_FInterpTo_ReturnValue_1) == 0x0000A0, "Member 'ClickableText_C_AdditionalEffects::CallFunc_FInterpTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClickableText_C_AdditionalEffects, CallFunc_MakeVector2D_ReturnValue_1) == 0x0000A8, "Member 'ClickableText_C_AdditionalEffects::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ClickableText_C_AdditionalEffects, CallFunc_FInterpTo_InterpSpeed_ImplicitCast) == 0x0000B8, "Member 'ClickableText_C_AdditionalEffects::CallFunc_FInterpTo_InterpSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ClickableText_C_AdditionalEffects, CallFunc_FInterpTo_InterpSpeed_ImplicitCast_1) == 0x0000C0, "Member 'ClickableText_C_AdditionalEffects::CallFunc_FInterpTo_InterpSpeed_ImplicitCast_1' has a wrong offset!");

}

