#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Granny

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class Granny.AiCameraComponent
// 0x0030 (0x0A60 - 0x0A30)
class UAiCameraComponent : public UCameraComponent
{
public:
	struct FIntPoint                              Quality;                                           // 0x0A30(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Distance;                                          // 0x0A38(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C76[0x4];                                     // 0x0A3C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Range;                                             // 0x0A40(0x0010)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             TraceChannelProperty;                              // 0x0A50(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          FilterActorsByPawns;                               // 0x0A51(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DrawDebugLines;                                    // 0x0A52(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C77[0xD];                                     // 0x0A53(0x000D)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	TArray<class AActor*> ScanActorsInCamera();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AiCameraComponent">();
	}
	static class UAiCameraComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAiCameraComponent>();
	}
};
static_assert(alignof(UAiCameraComponent) == 0x000010, "Wrong alignment on UAiCameraComponent");
static_assert(sizeof(UAiCameraComponent) == 0x000A60, "Wrong size on UAiCameraComponent");
static_assert(offsetof(UAiCameraComponent, Quality) == 0x000A30, "Member 'UAiCameraComponent::Quality' has a wrong offset!");
static_assert(offsetof(UAiCameraComponent, Distance) == 0x000A38, "Member 'UAiCameraComponent::Distance' has a wrong offset!");
static_assert(offsetof(UAiCameraComponent, Range) == 0x000A40, "Member 'UAiCameraComponent::Range' has a wrong offset!");
static_assert(offsetof(UAiCameraComponent, TraceChannelProperty) == 0x000A50, "Member 'UAiCameraComponent::TraceChannelProperty' has a wrong offset!");
static_assert(offsetof(UAiCameraComponent, FilterActorsByPawns) == 0x000A51, "Member 'UAiCameraComponent::FilterActorsByPawns' has a wrong offset!");
static_assert(offsetof(UAiCameraComponent, DrawDebugLines) == 0x000A52, "Member 'UAiCameraComponent::DrawDebugLines' has a wrong offset!");

// Class Granny.GrannyInstance
// 0x0000 (0x01C0 - 0x01C0)
class UGrannyInstance : public UGameInstance
{
public:
	TArray<class FString> GetCommandArrayFromFile(const class FString& Path);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GrannyInstance">();
	}
	static class UGrannyInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGrannyInstance>();
	}
};
static_assert(alignof(UGrannyInstance) == 0x000008, "Wrong alignment on UGrannyInstance");
static_assert(sizeof(UGrannyInstance) == 0x0001C0, "Wrong size on UGrannyInstance");

// Class Granny.MainBFL
// 0x0000 (0x0028 - 0x0028)
class UMainBFL final : public UBlueprintFunctionLibrary
{
public:
	static TArray<struct FLinearColor> GetLuminancePixelPercent(const TArray<struct FLinearColor>& InPixels, float NearlyEqualTo, float Tolerance);
	static TArray<class AActor*> ShuffleArray(const TArray<class AActor*>& MyArray, float Seed);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MainBFL">();
	}
	static class UMainBFL* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainBFL>();
	}
};
static_assert(alignof(UMainBFL) == 0x000008, "Wrong alignment on UMainBFL");
static_assert(sizeof(UMainBFL) == 0x000028, "Wrong size on UMainBFL");

}

