#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NamedSetting

#include "Basic.hpp"

#include "ESettingLevel_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK::Params
{

// Function NamedSetting.NamedSetting_C.ValueToText
// 0x00B8 (0x00B8 - 0x0000)
struct NamedSetting_C_ValueToText final
{
public:
	ESettingLevel                                 Param_Index;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2880[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Param_Text;                                        // 0x0008(0x0018)(Parm, OutParm)
	ESettingLevel                                 Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2881[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0028(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0040(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0058(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0070(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0088(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x00A0(0x0018)()
};
static_assert(alignof(NamedSetting_C_ValueToText) == 0x000008, "Wrong alignment on NamedSetting_C_ValueToText");
static_assert(sizeof(NamedSetting_C_ValueToText) == 0x0000B8, "Wrong size on NamedSetting_C_ValueToText");
static_assert(offsetof(NamedSetting_C_ValueToText, Param_Index) == 0x000000, "Member 'NamedSetting_C_ValueToText::Param_Index' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_ValueToText, Param_Text) == 0x000008, "Member 'NamedSetting_C_ValueToText::Param_Text' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_ValueToText, Temp_byte_Variable) == 0x000020, "Member 'NamedSetting_C_ValueToText::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_ValueToText, Temp_text_Variable) == 0x000028, "Member 'NamedSetting_C_ValueToText::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_ValueToText, Temp_text_Variable_1) == 0x000040, "Member 'NamedSetting_C_ValueToText::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_ValueToText, Temp_text_Variable_2) == 0x000058, "Member 'NamedSetting_C_ValueToText::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_ValueToText, Temp_text_Variable_3) == 0x000070, "Member 'NamedSetting_C_ValueToText::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_ValueToText, Temp_text_Variable_4) == 0x000088, "Member 'NamedSetting_C_ValueToText::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_ValueToText, K2Node_Select_Default) == 0x0000A0, "Member 'NamedSetting_C_ValueToText::K2Node_Select_Default' has a wrong offset!");

// Function NamedSetting.NamedSetting_C.Tick
// 0x0048 (0x0048 - 0x0000)
struct NamedSetting_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NamedSetting_C_Tick) == 0x000008, "Wrong alignment on NamedSetting_C_Tick");
static_assert(sizeof(NamedSetting_C_Tick) == 0x000048, "Wrong size on NamedSetting_C_Tick");
static_assert(offsetof(NamedSetting_C_Tick, MyGeometry) == 0x000000, "Member 'NamedSetting_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_Tick, InDeltaTime) == 0x000040, "Member 'NamedSetting_C_Tick::InDeltaTime' has a wrong offset!");

// Function NamedSetting.NamedSetting_C.SettingInit
// 0x01A8 (0x01A8 - 0x0000)
struct NamedSetting_C_SettingInit final
{
public:
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShadingQuality_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2882[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_ValueToText_Text;                         // 0x0010(0x0018)()
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_1;        // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetFoliageQuality_ReturnValue;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_1;              // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2883[0x2];                                     // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_2;        // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_ValueToText_Text_1;                       // 0x0040(0x0018)()
	int32                                         CallFunc_GetVisualEffectQuality_ReturnValue;       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_2;             // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_2;              // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2884[0x2];                                     // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_ValueToText_Text_2;                       // 0x0060(0x0018)()
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_3;        // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTextureQuality_ReturnValue;            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_3;             // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_3;              // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2885[0x2];                                     // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_4;        // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetReflectionQuality_ReturnValue;         // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2886[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_ValueToText_Text_3;                       // 0x0098(0x0018)()
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_4;             // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_4;              // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2887[0x6];                                     // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_ValueToText_Text_4;                       // 0x00B8(0x0018)()
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_5;        // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetGlobalIlluminationQuality_ReturnValue; // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_5;             // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_5;              // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2888[0x2];                                     // 0x00DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_6;        // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShadowQuality_ReturnValue;             // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2889[0x4];                                     // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_ValueToText_Text_5;                       // 0x00F0(0x0018)()
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_6;             // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_6;              // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_288A[0x6];                                     // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_ValueToText_Text_6;                       // 0x0110(0x0018)()
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_7;        // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPostProcessingQuality_ReturnValue;     // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_7;             // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_7;              // 0x0135(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_288B[0x2];                                     // 0x0136(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_8;        // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAntiAliasingQuality_ReturnValue;       // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_288C[0x4];                                     // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_ValueToText_Text_7;                       // 0x0148(0x0018)()
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_8;             // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_8;              // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_288D[0x6];                                     // 0x0162(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_ValueToText_Text_8;                       // 0x0168(0x0018)()
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_9;        // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetViewDistanceQuality_ReturnValue;       // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_9;             // 0x018D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_9;              // 0x018E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_288E[0x1];                                     // 0x018F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_ValueToText_Text_9;                       // 0x0190(0x0018)()
};
static_assert(alignof(NamedSetting_C_SettingInit) == 0x000008, "Wrong alignment on NamedSetting_C_SettingInit");
static_assert(sizeof(NamedSetting_C_SettingInit) == 0x0001A8, "Wrong size on NamedSetting_C_SettingInit");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_GetGameUserSettings_ReturnValue) == 0x000000, "Member 'NamedSetting_C_SettingInit::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_GetShadingQuality_ReturnValue) == 0x000008, "Member 'NamedSetting_C_SettingInit::CallFunc_GetShadingQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_Conv_IntToByte_ReturnValue) == 0x00000C, "Member 'NamedSetting_C_SettingInit::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_GetValidValue_ReturnValue) == 0x00000D, "Member 'NamedSetting_C_SettingInit::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_ValueToText_Text) == 0x000010, "Member 'NamedSetting_C_SettingInit::CallFunc_ValueToText_Text' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_GetGameUserSettings_ReturnValue_1) == 0x000028, "Member 'NamedSetting_C_SettingInit::CallFunc_GetGameUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_GetFoliageQuality_ReturnValue) == 0x000030, "Member 'NamedSetting_C_SettingInit::CallFunc_GetFoliageQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000034, "Member 'NamedSetting_C_SettingInit::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_GetValidValue_ReturnValue_1) == 0x000035, "Member 'NamedSetting_C_SettingInit::CallFunc_GetValidValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_GetGameUserSettings_ReturnValue_2) == 0x000038, "Member 'NamedSetting_C_SettingInit::CallFunc_GetGameUserSettings_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_ValueToText_Text_1) == 0x000040, "Member 'NamedSetting_C_SettingInit::CallFunc_ValueToText_Text_1' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_GetVisualEffectQuality_ReturnValue) == 0x000058, "Member 'NamedSetting_C_SettingInit::CallFunc_GetVisualEffectQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_Conv_IntToByte_ReturnValue_2) == 0x00005C, "Member 'NamedSetting_C_SettingInit::CallFunc_Conv_IntToByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_GetValidValue_ReturnValue_2) == 0x00005D, "Member 'NamedSetting_C_SettingInit::CallFunc_GetValidValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_ValueToText_Text_2) == 0x000060, "Member 'NamedSetting_C_SettingInit::CallFunc_ValueToText_Text_2' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_GetGameUserSettings_ReturnValue_3) == 0x000078, "Member 'NamedSetting_C_SettingInit::CallFunc_GetGameUserSettings_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_GetTextureQuality_ReturnValue) == 0x000080, "Member 'NamedSetting_C_SettingInit::CallFunc_GetTextureQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_Conv_IntToByte_ReturnValue_3) == 0x000084, "Member 'NamedSetting_C_SettingInit::CallFunc_Conv_IntToByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_GetValidValue_ReturnValue_3) == 0x000085, "Member 'NamedSetting_C_SettingInit::CallFunc_GetValidValue_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_GetGameUserSettings_ReturnValue_4) == 0x000088, "Member 'NamedSetting_C_SettingInit::CallFunc_GetGameUserSettings_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_GetReflectionQuality_ReturnValue) == 0x000090, "Member 'NamedSetting_C_SettingInit::CallFunc_GetReflectionQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_ValueToText_Text_3) == 0x000098, "Member 'NamedSetting_C_SettingInit::CallFunc_ValueToText_Text_3' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_Conv_IntToByte_ReturnValue_4) == 0x0000B0, "Member 'NamedSetting_C_SettingInit::CallFunc_Conv_IntToByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_GetValidValue_ReturnValue_4) == 0x0000B1, "Member 'NamedSetting_C_SettingInit::CallFunc_GetValidValue_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_ValueToText_Text_4) == 0x0000B8, "Member 'NamedSetting_C_SettingInit::CallFunc_ValueToText_Text_4' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_GetGameUserSettings_ReturnValue_5) == 0x0000D0, "Member 'NamedSetting_C_SettingInit::CallFunc_GetGameUserSettings_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_GetGlobalIlluminationQuality_ReturnValue) == 0x0000D8, "Member 'NamedSetting_C_SettingInit::CallFunc_GetGlobalIlluminationQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_Conv_IntToByte_ReturnValue_5) == 0x0000DC, "Member 'NamedSetting_C_SettingInit::CallFunc_Conv_IntToByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_GetValidValue_ReturnValue_5) == 0x0000DD, "Member 'NamedSetting_C_SettingInit::CallFunc_GetValidValue_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_GetGameUserSettings_ReturnValue_6) == 0x0000E0, "Member 'NamedSetting_C_SettingInit::CallFunc_GetGameUserSettings_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_GetShadowQuality_ReturnValue) == 0x0000E8, "Member 'NamedSetting_C_SettingInit::CallFunc_GetShadowQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_ValueToText_Text_5) == 0x0000F0, "Member 'NamedSetting_C_SettingInit::CallFunc_ValueToText_Text_5' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_Conv_IntToByte_ReturnValue_6) == 0x000108, "Member 'NamedSetting_C_SettingInit::CallFunc_Conv_IntToByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_GetValidValue_ReturnValue_6) == 0x000109, "Member 'NamedSetting_C_SettingInit::CallFunc_GetValidValue_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_ValueToText_Text_6) == 0x000110, "Member 'NamedSetting_C_SettingInit::CallFunc_ValueToText_Text_6' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_GetGameUserSettings_ReturnValue_7) == 0x000128, "Member 'NamedSetting_C_SettingInit::CallFunc_GetGameUserSettings_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_GetPostProcessingQuality_ReturnValue) == 0x000130, "Member 'NamedSetting_C_SettingInit::CallFunc_GetPostProcessingQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_Conv_IntToByte_ReturnValue_7) == 0x000134, "Member 'NamedSetting_C_SettingInit::CallFunc_Conv_IntToByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_GetValidValue_ReturnValue_7) == 0x000135, "Member 'NamedSetting_C_SettingInit::CallFunc_GetValidValue_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_GetGameUserSettings_ReturnValue_8) == 0x000138, "Member 'NamedSetting_C_SettingInit::CallFunc_GetGameUserSettings_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_GetAntiAliasingQuality_ReturnValue) == 0x000140, "Member 'NamedSetting_C_SettingInit::CallFunc_GetAntiAliasingQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_ValueToText_Text_7) == 0x000148, "Member 'NamedSetting_C_SettingInit::CallFunc_ValueToText_Text_7' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_Conv_IntToByte_ReturnValue_8) == 0x000160, "Member 'NamedSetting_C_SettingInit::CallFunc_Conv_IntToByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_GetValidValue_ReturnValue_8) == 0x000161, "Member 'NamedSetting_C_SettingInit::CallFunc_GetValidValue_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_ValueToText_Text_8) == 0x000168, "Member 'NamedSetting_C_SettingInit::CallFunc_ValueToText_Text_8' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_GetGameUserSettings_ReturnValue_9) == 0x000180, "Member 'NamedSetting_C_SettingInit::CallFunc_GetGameUserSettings_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_GetViewDistanceQuality_ReturnValue) == 0x000188, "Member 'NamedSetting_C_SettingInit::CallFunc_GetViewDistanceQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, K2Node_SwitchEnum_CmpSuccess) == 0x00018C, "Member 'NamedSetting_C_SettingInit::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_Conv_IntToByte_ReturnValue_9) == 0x00018D, "Member 'NamedSetting_C_SettingInit::CallFunc_Conv_IntToByte_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_GetValidValue_ReturnValue_9) == 0x00018E, "Member 'NamedSetting_C_SettingInit::CallFunc_GetValidValue_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingInit, CallFunc_ValueToText_Text_9) == 0x000190, "Member 'NamedSetting_C_SettingInit::CallFunc_ValueToText_Text_9' has a wrong offset!");

// Function NamedSetting.NamedSetting_C.SettingApply
// 0x0088 (0x0088 - 0x0000)
struct NamedSetting_C_SettingApply final
{
public:
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_1;        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_2;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_3;        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_4;        // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_5;        // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_6;        // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_7;        // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_8;        // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_6;             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_7;             // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_9;        // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_10;       // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_8;             // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_9;             // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NamedSetting_C_SettingApply) == 0x000008, "Wrong alignment on NamedSetting_C_SettingApply");
static_assert(sizeof(NamedSetting_C_SettingApply) == 0x000088, "Wrong size on NamedSetting_C_SettingApply");
static_assert(offsetof(NamedSetting_C_SettingApply, CallFunc_GetGameUserSettings_ReturnValue) == 0x000000, "Member 'NamedSetting_C_SettingApply::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingApply, CallFunc_GetGameUserSettings_ReturnValue_1) == 0x000008, "Member 'NamedSetting_C_SettingApply::CallFunc_GetGameUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingApply, CallFunc_GetGameUserSettings_ReturnValue_2) == 0x000010, "Member 'NamedSetting_C_SettingApply::CallFunc_GetGameUserSettings_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingApply, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000018, "Member 'NamedSetting_C_SettingApply::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingApply, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00001C, "Member 'NamedSetting_C_SettingApply::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingApply, CallFunc_GetGameUserSettings_ReturnValue_3) == 0x000020, "Member 'NamedSetting_C_SettingApply::CallFunc_GetGameUserSettings_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingApply, CallFunc_GetGameUserSettings_ReturnValue_4) == 0x000028, "Member 'NamedSetting_C_SettingApply::CallFunc_GetGameUserSettings_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingApply, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000030, "Member 'NamedSetting_C_SettingApply::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingApply, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000034, "Member 'NamedSetting_C_SettingApply::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingApply, CallFunc_GetGameUserSettings_ReturnValue_5) == 0x000038, "Member 'NamedSetting_C_SettingApply::CallFunc_GetGameUserSettings_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingApply, CallFunc_GetGameUserSettings_ReturnValue_6) == 0x000040, "Member 'NamedSetting_C_SettingApply::CallFunc_GetGameUserSettings_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingApply, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x000048, "Member 'NamedSetting_C_SettingApply::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingApply, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x00004C, "Member 'NamedSetting_C_SettingApply::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingApply, CallFunc_GetGameUserSettings_ReturnValue_7) == 0x000050, "Member 'NamedSetting_C_SettingApply::CallFunc_GetGameUserSettings_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingApply, CallFunc_GetGameUserSettings_ReturnValue_8) == 0x000058, "Member 'NamedSetting_C_SettingApply::CallFunc_GetGameUserSettings_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingApply, CallFunc_Conv_ByteToInt_ReturnValue_6) == 0x000060, "Member 'NamedSetting_C_SettingApply::CallFunc_Conv_ByteToInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingApply, CallFunc_Conv_ByteToInt_ReturnValue_7) == 0x000064, "Member 'NamedSetting_C_SettingApply::CallFunc_Conv_ByteToInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingApply, CallFunc_GetGameUserSettings_ReturnValue_9) == 0x000068, "Member 'NamedSetting_C_SettingApply::CallFunc_GetGameUserSettings_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingApply, CallFunc_GetGameUserSettings_ReturnValue_10) == 0x000070, "Member 'NamedSetting_C_SettingApply::CallFunc_GetGameUserSettings_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingApply, CallFunc_Conv_ByteToInt_ReturnValue_8) == 0x000078, "Member 'NamedSetting_C_SettingApply::CallFunc_Conv_ByteToInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingApply, CallFunc_Conv_ByteToInt_ReturnValue_9) == 0x00007C, "Member 'NamedSetting_C_SettingApply::CallFunc_Conv_ByteToInt_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SettingApply, K2Node_SwitchEnum_CmpSuccess) == 0x000080, "Member 'NamedSetting_C_SettingApply::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function NamedSetting.NamedSetting_C.SelectionHighlightController
// 0x00E0 (0x00E0 - 0x0000)
struct NamedSetting_C_SelectionHighlightController final
{
public:
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_288F[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue_2;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_1; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2890[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_1;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_2; // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2891[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FInterpTo_ReturnValue_1;                  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue_2;                  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2892[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue_3;       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2893[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_2;                // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2894[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FInterpTo_ReturnValue_3;                  // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Current_ImplicitCast;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Current_ImplicitCast_1;         // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2895[0x4];                                     // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FInterpTo_Current_ImplicitCast_2;         // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Current_ImplicitCast_3;         // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NamedSetting_C_SelectionHighlightController) == 0x000008, "Wrong alignment on NamedSetting_C_SelectionHighlightController");
static_assert(sizeof(NamedSetting_C_SelectionHighlightController) == 0x0000E0, "Wrong size on NamedSetting_C_SelectionHighlightController");
static_assert(offsetof(NamedSetting_C_SelectionHighlightController, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000000, "Member 'NamedSetting_C_SelectionHighlightController::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SelectionHighlightController, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x000008, "Member 'NamedSetting_C_SelectionHighlightController::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SelectionHighlightController, CallFunc_SelectFloat_ReturnValue) == 0x000010, "Member 'NamedSetting_C_SelectionHighlightController::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SelectionHighlightController, CallFunc_K2_GetScalarParameterValue_ReturnValue) == 0x000018, "Member 'NamedSetting_C_SelectionHighlightController::CallFunc_K2_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SelectionHighlightController, CallFunc_GetWorldDeltaSeconds_ReturnValue_2) == 0x000020, "Member 'NamedSetting_C_SelectionHighlightController::CallFunc_GetWorldDeltaSeconds_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SelectionHighlightController, CallFunc_BreakVector2D_X) == 0x000028, "Member 'NamedSetting_C_SelectionHighlightController::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SelectionHighlightController, CallFunc_BreakVector2D_Y) == 0x000030, "Member 'NamedSetting_C_SelectionHighlightController::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SelectionHighlightController, CallFunc_K2_GetScalarParameterValue_ReturnValue_1) == 0x000038, "Member 'NamedSetting_C_SelectionHighlightController::CallFunc_K2_GetScalarParameterValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SelectionHighlightController, CallFunc_MapRangeClamped_ReturnValue) == 0x000040, "Member 'NamedSetting_C_SelectionHighlightController::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SelectionHighlightController, CallFunc_FInterpTo_ReturnValue) == 0x000048, "Member 'NamedSetting_C_SelectionHighlightController::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SelectionHighlightController, CallFunc_MapRangeClamped_ReturnValue_1) == 0x000050, "Member 'NamedSetting_C_SelectionHighlightController::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SelectionHighlightController, CallFunc_SelectFloat_ReturnValue_1) == 0x000058, "Member 'NamedSetting_C_SelectionHighlightController::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SelectionHighlightController, CallFunc_K2_GetScalarParameterValue_ReturnValue_2) == 0x000060, "Member 'NamedSetting_C_SelectionHighlightController::CallFunc_K2_GetScalarParameterValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SelectionHighlightController, CallFunc_FInterpTo_ReturnValue_1) == 0x000068, "Member 'NamedSetting_C_SelectionHighlightController::CallFunc_FInterpTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SelectionHighlightController, CallFunc_FInterpTo_ReturnValue_2) == 0x000070, "Member 'NamedSetting_C_SelectionHighlightController::CallFunc_FInterpTo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SelectionHighlightController, CallFunc_IsHovered_ReturnValue) == 0x000078, "Member 'NamedSetting_C_SelectionHighlightController::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SelectionHighlightController, CallFunc_GetWorldDeltaSeconds_ReturnValue_3) == 0x000080, "Member 'NamedSetting_C_SelectionHighlightController::CallFunc_GetWorldDeltaSeconds_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SelectionHighlightController, CallFunc_BooleanOR_ReturnValue) == 0x000088, "Member 'NamedSetting_C_SelectionHighlightController::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SelectionHighlightController, CallFunc_SelectFloat_ReturnValue_2) == 0x000090, "Member 'NamedSetting_C_SelectionHighlightController::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SelectionHighlightController, CallFunc_GetRenderOpacity_ReturnValue) == 0x000098, "Member 'NamedSetting_C_SelectionHighlightController::CallFunc_GetRenderOpacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SelectionHighlightController, CallFunc_FInterpTo_ReturnValue_3) == 0x0000A0, "Member 'NamedSetting_C_SelectionHighlightController::CallFunc_FInterpTo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SelectionHighlightController, CallFunc_FInterpTo_Current_ImplicitCast) == 0x0000A8, "Member 'NamedSetting_C_SelectionHighlightController::CallFunc_FInterpTo_Current_ImplicitCast' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SelectionHighlightController, CallFunc_FInterpTo_Current_ImplicitCast_1) == 0x0000B0, "Member 'NamedSetting_C_SelectionHighlightController::CallFunc_FInterpTo_Current_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SelectionHighlightController, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x0000B8, "Member 'NamedSetting_C_SelectionHighlightController::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SelectionHighlightController, CallFunc_FInterpTo_Current_ImplicitCast_2) == 0x0000C0, "Member 'NamedSetting_C_SelectionHighlightController::CallFunc_FInterpTo_Current_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SelectionHighlightController, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x0000C8, "Member 'NamedSetting_C_SelectionHighlightController::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SelectionHighlightController, CallFunc_SetScalarParameterValue_Value_ImplicitCast_2) == 0x0000CC, "Member 'NamedSetting_C_SelectionHighlightController::CallFunc_SetScalarParameterValue_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SelectionHighlightController, CallFunc_FInterpTo_Current_ImplicitCast_3) == 0x0000D0, "Member 'NamedSetting_C_SelectionHighlightController::CallFunc_FInterpTo_Current_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_SelectionHighlightController, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x0000D8, "Member 'NamedSetting_C_SelectionHighlightController::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function NamedSetting.NamedSetting_C.ReturnLevel_Event
// 0x0010 (0x0010 - 0x0000)
struct NamedSetting_C_ReturnLevel_Event final
{
public:
	class USettingPopup_C*                        Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESettingLevel                                 Level;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NamedSetting_C_ReturnLevel_Event) == 0x000008, "Wrong alignment on NamedSetting_C_ReturnLevel_Event");
static_assert(sizeof(NamedSetting_C_ReturnLevel_Event) == 0x000010, "Wrong size on NamedSetting_C_ReturnLevel_Event");
static_assert(offsetof(NamedSetting_C_ReturnLevel_Event, Widget) == 0x000000, "Member 'NamedSetting_C_ReturnLevel_Event::Widget' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_ReturnLevel_Event, Level) == 0x000008, "Member 'NamedSetting_C_ReturnLevel_Event::Level' has a wrong offset!");

// Function NamedSetting.NamedSetting_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct NamedSetting_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NamedSetting_C_PreConstruct) == 0x000001, "Wrong alignment on NamedSetting_C_PreConstruct");
static_assert(sizeof(NamedSetting_C_PreConstruct) == 0x000001, "Wrong size on NamedSetting_C_PreConstruct");
static_assert(offsetof(NamedSetting_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'NamedSetting_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function NamedSetting.NamedSetting_C.OnValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct NamedSetting_C_OnValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Percent;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NamedSetting_C_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on NamedSetting_C_OnValueChanged__DelegateSignature");
static_assert(sizeof(NamedSetting_C_OnValueChanged__DelegateSignature) == 0x000010, "Wrong size on NamedSetting_C_OnValueChanged__DelegateSignature");
static_assert(offsetof(NamedSetting_C_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'NamedSetting_C_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(NamedSetting_C_OnValueChanged__DelegateSignature, Percent) == 0x000008, "Member 'NamedSetting_C_OnValueChanged__DelegateSignature::Percent' has a wrong offset!");

// Function NamedSetting.NamedSetting_C.ExecuteUbergraph_NamedSetting
// 0x0230 (0x0230 - 0x0000)
struct NamedSetting_C_ExecuteUbergraph_NamedSetting final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class USettingPopup_C* Widget, ESettingLevel Level)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2896[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_ValueToText_Text;                         // 0x0018(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2897[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0038(0x0040)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2898[0x2];                                     // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2899[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USettingPopup_C*                        CallFunc_Create_ReturnValue;                       // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289A[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClickableText_C*                       K2Node_ComponentBoundEvent_Text_1;                 // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_NearMainText;                   // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289B[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USettingPopup_C*                        K2Node_CustomEvent_Widget;                         // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESettingLevel                                 K2Node_CustomEvent_Level;                          // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289C[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue;              // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClickableText_C*                       K2Node_ComponentBoundEvent_Text;                   // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default;                             // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_1;                           // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x0130(0x0040)(ConstParm, IsPlainOldData, NoDestructor)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetLocalTopLeft_ReturnValue;              // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_LocalToViewport_PixelPosition;            // 0x0198(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
