#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewWidgetBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass NewWidgetBlueprint.NewWidgetBlueprint_C
// 0x0020 (0x0298 - 0x0278)
class UNewWidgetBlueprint_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_0;                                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_46;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_1;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_NewWidgetBlueprint(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NewWidgetBlueprint_C">();
	}
	static class UNewWidgetBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNewWidgetBlueprint_C>();
	}
};
static_assert(alignof(UNewWidgetBlueprint_C) == 0x000008, "Wrong alignment on UNewWidgetBlueprint_C");
static_assert(sizeof(UNewWidgetBlueprint_C) == 0x000298, "Wrong size on UNewWidgetBlueprint_C");
static_assert(offsetof(UNewWidgetBlueprint_C, UberGraphFrame) == 0x000278, "Member 'UNewWidgetBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UNewWidgetBlueprint_C, Image_0) == 0x000280, "Member 'UNewWidgetBlueprint_C::Image_0' has a wrong offset!");
static_assert(offsetof(UNewWidgetBlueprint_C, Image_46) == 0x000288, "Member 'UNewWidgetBlueprint_C::Image_46' has a wrong offset!");
static_assert(offsetof(UNewWidgetBlueprint_C, RetainerBox_1) == 0x000290, "Member 'UNewWidgetBlueprint_C::RetainerBox_1' has a wrong offset!");

}

