#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RopeCutting

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class RopeCutting.CC22
// 0x0540 (0x07E0 - 0x02A0)
class UCC22 final : public USceneComponent
{
public:
	bool                                          SpawnAtRuntime;                                    // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_193A[0x3];                                     // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxChainLength;                                    // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            ChainModel;                                        // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ChainLinkSize;                                     // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_193B[0x4];                                     // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                EndLocation;                                       // 0x02B8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseSplineComponent;                                // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_193C[0x3];                                     // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SplineComponentName;                               // 0x02D4(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SetSplineStartLocation;                            // 0x02DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_193D[0x3];                                     // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SplineStartLocation;                               // 0x02E0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SetSplineEndLocation;                              // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_193E[0x7];                                     // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SplineEndLocation;                                 // 0x0300(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          StartImmobilised;                                  // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IncreaseStartRigidity;                             // 0x0319(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EndImmobilised;                                    // 0x031A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IncreaseEndRigidity;                               // 0x031B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AttachStartMesh;                                   // 0x031C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_193F[0x3];                                     // 0x031D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   StartMesh;                                         // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   StartSocket;                                       // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   StartBone;                                         // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AttachEndMesh;                                     // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1940[0x3];                                     // 0x0339(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   EndMesh;                                           // 0x033C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   EndSocket;                                         // 0x0344(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   EndBone;                                           // 0x034C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CanCutChain;                                       // 0x0354(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1941[0x3];                                     // 0x0355(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CuttingForceThreshold;                             // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SwitchMeshOnCut;                                   // 0x035C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1942[0x3];                                     // 0x035D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CutChainModel;                                     // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableEmitterOnCut;                                // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1943[0x7];                                     // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        CutChainEmitter;                                   // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableSoundOnCut;                                  // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1944[0x7];                                     // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundCue*                              CutChainSound;                                     // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableVelocityTracking;                            // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableChainRattle;                                 // 0x0389(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1945[0x6];                                     // 0x038A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundCue*                              ChainRattleSound;                                  // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ChainRattleMinVelocity;                            // 0x0398(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ChainRattleRate;                                   // 0x039C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RattleMinimumChainLength;                          // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RattlePitchModulationMin;                          // 0x03A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RattlePitchModulationMax;                          // 0x03A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RattleVolumeModulationMin;                         // 0x03AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RattleVolumeModulationMax;                         // 0x03B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableChainAirWhip;                                // 0x03B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1946[0x3];                                     // 0x03B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundCue*                              ChainAirWhipSound;                                 // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ChainAirWhipMinVelocity;                           // 0x03C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ChainAirWhipRate;                                  // 0x03C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AirWhipPitchModulationMin;                         // 0x03C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AirWhipPitchModulationMax;                         // 0x03CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AirWhipVolumeModulationMin;                        // 0x03D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AirWhipVolumeModulationMax;                        // 0x03D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AirWhipMinimumChainLength;                         // 0x03D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ImpactForceThreshold;                              // 0x03DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableImpactSound;                                 // 0x03E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1947[0x7];                                     // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundCue*                              ImpactSound;                                       // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableImpactEmitter;                               // 0x03F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1948[0x7];                                     // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        ImpactEmitter;                                     // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CanGrab;                                           // 0x0400(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1949[0x3];                                     // 0x0401(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigidnessScale;                                    // 0x0404(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StabilizationThresholdMultiplier_CC;               // 0x0408(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PositionSolverIterationCount_CC;                   // 0x040C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VelocitySolverIterationCount_CC;                   // 0x0410(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          PhysicsEnabled;                                    // 0x0414(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DisableSelfCollision;                              // 0x0415(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OverrideRigidnessScale;                            // 0x0416(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_194A[0x1];                                     // 0x0417(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SetLinearDamping_Override;                         // 0x0418(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SetAngularDamping_Override;                        // 0x041C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SetMassScale_Override;                             // 0x0420(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InertiaTensorScale_Override;                       // 0x0424(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VelocityDrive_Override;                            // 0x0428(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngularDrive_Override;                             // 0x042C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngularSwing1Limit_Override;                       // 0x0430(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngularSwing2Limit_Override;                       // 0x0434(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngularTwistLimit_Override;                        // 0x0438(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsCut_CC;                                          // 0x043C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_194B[0x3];                                     // 0x043D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SplineLength_CC;                                   // 0x0440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         NumberOfUnits_CC;                                  // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          IsStartPrimitiveSkeletal_CC;                       // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          IsEndPrimitiveSkeletal_CC;                         // 0x0449(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          StartPrimitiveFound;                               // 0x044A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          EndPrimitiveFound;                                 // 0x044B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MeshBoundsSize;                                    // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         RigidityScaleMultiplier;                           // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          OnComponentHitFlowControl_CC;                      // 0x0454(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          HasGrabbed_CC;                                     // 0x0455(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_194C[0x2];                                     // 0x0456(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OriginalGrabDistance_CC;                           // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         DisableGrabDuration_CC;                            // 0x045C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         HitCounter_CC;                                     // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          AllowAirWhip_CC;                                   // 0x0464(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          AllowDelayLoops_CC;                                // 0x0465(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_194D[0x2];                                     // 0x0466(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SetLinearDamping_CC;                               // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         SetAngularDamping_CC;                              // 0x046C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         SetMassScale_CC;                                   // 0x0470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         InertiaTensorScale_CC;                             // 0x0474(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         VelocityDrive_CC;                                  // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AngularDrive_CC;                                   // 0x047C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AngularSwing1Limit_CC;                             // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AngularSwing2Limit_CC;                             // 0x0484(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AngularTwistLimit_CC;                              // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_194E[0x4];                                     // 0x048C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                FirstUnitOrigin_Loc_EMov_CC;                       // 0x0490(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FRotator                               FirstUnitOrigin_Rot_EMov_CC;                       // 0x04A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	struct FVector                                LastUnitOrigin_Loc_EMov_CC;                        // 0x04C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FRotator                               LastUnitOrigin_Rot_EMov_CC;                        // 0x04D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	struct FVector                                LastUnitTarget_Loc_EMov_CC;                        // 0x04F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FRotator                               LastUnitTarget_Rot_EMov_CC;                        // 0x0508(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	bool                                          Begin_EMov_CC;                                     // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          AllowFirstUnitRotate_Att_EMov_CC;                  // 0x0521(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          AllowFirstUnitRotate_Immobile_EMov_CC;             // 0x0522(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_194F[0x1];                                     // 0x0523(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LerpValue_EMov_CC;                                 // 0x0524(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         TimerDelay_EMov_CC;                                // 0x0528(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1950[0x4];                                     // 0x052C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                FirstUnitOrigin_Loc_SMov_CC;                       // 0x0530(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FRotator                               FirstUnitOrigin_Rot_SMov_CC;                       // 0x0548(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	struct FVector                                LastUnitOrigin_Loc_SMov_CC;                        // 0x0560(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FRotator                               LastUnitOrigin_Rot_SMov_CC;                        // 0x0578(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	struct FVector                                FirstUnitTarget_Loc_SMov_CC;                       // 0x0590(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FRotator                               FirstUnitTarget_Rot_SMov_CC;                       // 0x05A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	struct FRotator                               FirstUnitTarget_RotInvert_SMov_CC;                 // 0x05C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	bool                                          Begin_SMov_CC;                                     // 0x05D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          AllowFirstUnitRotate_Att_SMov_CC;                  // 0x05D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          AllowFirstUnitRotate_Immobile_SMov_CC;             // 0x05DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1951[0x1];                                     // 0x05DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LerpValue_SMov_CC;                                 // 0x05DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         TimerDelay_SMov_CC;                                // 0x05E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1952[0x4];                                     // 0x05E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   ChainMeshPR_CC;                                    // 0x05E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                   FalseChainMeshPR_CC;                               // 0x05F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                   First_ChainMeshPR_CC;                              // 0x05F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                   LastChainMeshPR_CC;                                // 0x0600(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPhysicsConstraintComponent*            PhysicsConstraintPR_CC;                            // 0x0608(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USplineComponent*                       BuildingSplinePR_CC;                               // 0x0610(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USplineComponent*                       DataSplinePR_CC;                                   // 0x0618(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USplineComponent*                       DataSplineDestroyPR_CC;                            // 0x0620(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPrimitiveComponent*                    StartPrimitive_CC;                                 // 0x0628(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPhysicsConstraintComponent*            StartPhyConstrPR_CC;                               // 0x0630(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USkeletalMeshComponent*                 StartSkeletalMesh_CC;                              // 0x0638(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPrimitiveComponent*                    EndPrimitive_CC;                                   // 0x0640(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPhysicsConstraintComponent*            EndPhyConstrPR_CC;                                 // 0x0648(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USkeletalMeshComponent*                 EndSkeletalMesh_CC;                                // 0x0650(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                   FirstUnitPinMeshPR_CC;                             // 0x0658(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPhysicsConstraintComponent*            FirstUnitPinPhyConstrPR_CC;                        // 0x0660(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                   LastUnitPinMeshPR_CC;                              // 0x0668(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPhysicsConstraintComponent*            LastUnitPinPhyConstrPR_CC;                         // 0x0670(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCC22Tracker*                           ChainTrackerPR_CC;                                 // 0x0678(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAudioComponent*                        ChainRattleSoundSpawn_CC;                          // 0x0680(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPhysicsConstraintComponent*            GrabPhyConstrPR_CC;                                // 0x0688(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UParticleSystemComponent*               CutChainEmitterSpawn_CC;                           // 0x0690(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAudioComponent*                        CutChainSoundSpawn_CC;                             // 0x0698(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UParticleSystemComponent*               WeakImpactEmitterSpawn_CC;                         // 0x06A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAudioComponent*                        WeakImpactSoundSpawn_CC;                           // 0x06A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class USplineComponent*>               SplineLookupArray_CC;                              // 0x06B0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class UPrimitiveComponent*>            StartPrimitiveLookupArray_CC;                      // 0x06C0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class FName>                           StartPrimitiveFNameArray_CC;                       // 0x06D0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class FName>                           StartPrimitiveBoneFNameArray_CC;                   // 0x06E0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class UPrimitiveComponent*>            EndPrimitiveLookupArray_CC;                        // 0x06F0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class FName>                           EndPrimitiveFNameArray_CC;                         // 0x0700(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class FName>                           EndPrimitiveBoneFNameArray_CC;                     // 0x0710(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class UStaticMeshComponent*>           ChainMeshArray_CC;                                 // 0x0720(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class UStaticMeshComponent*>           CutMeshArray_CC;                                   // 0x0730(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class UStaticMeshComponent*>           FalseChainMeshArray_CC;                            // 0x0740(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class UPhysicsConstraintComponent*>    PhysicsConstraintArray_CC;                         // 0x0750(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class UAudioComponent*>                RuntimeSoundArray_CC;                              // 0x0760(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class UParticleSystemComponent*>       RuntimeEmitterArray_CC;                            // 0x0770(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class UCC22Tracker*>                   TrackerArray_CC;                                   // 0x0780(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1953[0x38];                                    // 0x0790(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          AllowVelocityChecks_CC;                            // 0x07C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1954[0x17];                                    // 0x07C9(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AllowAirWhipFunction_CC();
	void AttachChainEnd_RC(class UPrimitiveComponent* MeshToAttach, class FName SocketName, class FName BoneName);
	void AttachChainStart_CC(class UPrimitiveComponent* MeshToAttach, class FName SocketName, class FName BoneName);
	void BeginConstruction_CC();
	void BreakChain_CC(class UPrimitiveComponent* ChainLinkHit);
	void BreakChainByNumber_CC(int32 ChainLinkHit);
	void BuildChain_CC();
	void CreateSimpleSpline_CC();
	const class FName CreateUniqueName_CC(const class FString& ComponentType, const int32 ComponentNumber);
	void DetachEndPrimitive_CC();
	void DetachStartPrimitive_CC();
	void DropChain_CC(float DisableGrabDuration);
	void EnsureProperReset_CC();
	void EventBeginDelayedFunction_CC();
	void GameBegun_CC();
	class UPhysicsConstraintComponent* GetEndPrimitiveConstraint_CC();
	class UStaticMeshComponent* GetFirstChainMesh_CC();
	class UStaticMeshComponent* GetLastChainMesh_CC();
	TArray<class UStaticMeshComponent*> GetMeshArray_CC();
	TArray<class UPhysicsConstraintComponent*> GetPhysicsConstraintArray_CC();
	class UPhysicsConstraintComponent* GetStartPrimitiveConstraint_CC();
	void GrabCheck();
	void GrabReset_CC();
	void ImmobiliseFirstChainLink_CC();
	void ImmobiliseLastChainLink_CC();
	void MobiliseFirstChainLink_CC();
	void MobiliseLastChainLink_CC();
	void MoveEndOfChain_CC(const struct FVector& MoveToLocation, float DurationOfMove, bool AllowStartRotationAttached, bool AllowStartRotationImmobilised);
	void MoveEndOfChainPassBack_CC();
	void MoveStartOfChain_CC(const struct FVector& MoveToLocation, float DurationOfMove, bool AllowEndRotationAttached, bool AllowEndRotationImmobilised);
	void MoveStartOfChainPassBack_CC();
	void OnAirWhipResetDelay_CC();
	void OnCompHit(class UPrimitiveComponent* HitComp, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void OnComponentHitFlowControl();
	void OnComponentHitReset();
	void OnEventBeginTimer();
	void OnGrabCheckLoop();
	void OnGrabResetDelay();
	void OnMoveEndOfChainTimer();
	void OnMoveStartOfChainTimer();
	void OnVelocityCheckDelay();
	void ResetChainAfterMove_CC(bool ImmobiliseStart, bool ImmobiliseEnd);
	void ScalePhysicsParameters_CC();
	void SpawnChainAtRuntime_CC();
	void VelocityCheck_CC();
	void WeakImpactChain_CC();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CC22">();
	}
	static class UCC22* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCC22>();
	}
};
static_assert(alignof(UCC22) == 0x000010, "Wrong alignment on UCC22");
static_assert(sizeof(UCC22) == 0x0007E0, "Wrong size on UCC22");
static_assert(offsetof(UCC22, SpawnAtRuntime) == 0x0002A0, "Member 'UCC22::SpawnAtRuntime' has a wrong offset!");
static_assert(offsetof(UCC22, MaxChainLength) == 0x0002A4, "Member 'UCC22::MaxChainLength' has a wrong offset!");
static_assert(offsetof(UCC22, ChainModel) == 0x0002A8, "Member 'UCC22::ChainModel' has a wrong offset!");
static_assert(offsetof(UCC22, ChainLinkSize) == 0x0002B0, "Member 'UCC22::ChainLinkSize' has a wrong offset!");
static_assert(offsetof(UCC22, EndLocation) == 0x0002B8, "Member 'UCC22::EndLocation' has a wrong offset!");
static_assert(offsetof(UCC22, UseSplineComponent) == 0x0002D0, "Member 'UCC22::UseSplineComponent' has a wrong offset!");
static_assert(offsetof(UCC22, SplineComponentName) == 0x0002D4, "Member 'UCC22::SplineComponentName' has a wrong offset!");
static_assert(offsetof(UCC22, SetSplineStartLocation) == 0x0002DC, "Member 'UCC22::SetSplineStartLocation' has a wrong offset!");
static_assert(offsetof(UCC22, SplineStartLocation) == 0x0002E0, "Member 'UCC22::SplineStartLocation' has a wrong offset!");
static_assert(offsetof(UCC22, SetSplineEndLocation) == 0x0002F8, "Member 'UCC22::SetSplineEndLocation' has a wrong offset!");
static_assert(offsetof(UCC22, SplineEndLocation) == 0x000300, "Member 'UCC22::SplineEndLocation' has a wrong offset!");
static_assert(offsetof(UCC22, StartImmobilised) == 0x000318, "Member 'UCC22::StartImmobilised' has a wrong offset!");
static_assert(offsetof(UCC22, IncreaseStartRigidity) == 0x000319, "Member 'UCC22::IncreaseStartRigidity' has a wrong offset!");
static_assert(offsetof(UCC22, EndImmobilised) == 0x00031A, "Member 'UCC22::EndImmobilised' has a wrong offset!");
static_assert(offsetof(UCC22, IncreaseEndRigidity) == 0x00031B, "Member 'UCC22::IncreaseEndRigidity' has a wrong offset!");
static_assert(offsetof(UCC22, AttachStartMesh) == 0x00031C, "Member 'UCC22::AttachStartMesh' has a wrong offset!");
static_assert(offsetof(UCC22, StartMesh) == 0x000320, "Member 'UCC22::StartMesh' has a wrong offset!");
static_assert(offsetof(UCC22, StartSocket) == 0x000328, "Member 'UCC22::StartSocket' has a wrong offset!");
static_assert(offsetof(UCC22, StartBone) == 0x000330, "Member 'UCC22::StartBone' has a wrong offset!");
static_assert(offsetof(UCC22, AttachEndMesh) == 0x000338, "Member 'UCC22::AttachEndMesh' has a wrong offset!");
static_assert(offsetof(UCC22, EndMesh) == 0x00033C, "Member 'UCC22::EndMesh' has a wrong offset!");
static_assert(offsetof(UCC22, EndSocket) == 0x000344, "Member 'UCC22::EndSocket' has a wrong offset!");
static_assert(offsetof(UCC22, EndBone) == 0x00034C, "Member 'UCC22::EndBone' has a wrong offset!");
static_assert(offsetof(UCC22, CanCutChain) == 0x000354, "Member 'UCC22::CanCutChain' has a wrong offset!");
static_assert(offsetof(UCC22, CuttingForceThreshold) == 0x000358, "Member 'UCC22::CuttingForceThreshold' has a wrong offset!");
static_assert(offsetof(UCC22, SwitchMeshOnCut) == 0x00035C, "Member 'UCC22::SwitchMeshOnCut' has a wrong offset!");
static_assert(offsetof(UCC22, CutChainModel) == 0x000360, "Member 'UCC22::CutChainModel' has a wrong offset!");
static_assert(offsetof(UCC22, EnableEmitterOnCut) == 0x000368, "Member 'UCC22::EnableEmitterOnCut' has a wrong offset!");
static_assert(offsetof(UCC22, CutChainEmitter) == 0x000370, "Member 'UCC22::CutChainEmitter' has a wrong offset!");
static_assert(offsetof(UCC22, EnableSoundOnCut) == 0x000378, "Member 'UCC22::EnableSoundOnCut' has a wrong offset!");
static_assert(offsetof(UCC22, CutChainSound) == 0x000380, "Member 'UCC22::CutChainSound' has a wrong offset!");
static_assert(offsetof(UCC22, EnableVelocityTracking) == 0x000388, "Member 'UCC22::EnableVelocityTracking' has a wrong offset!");
static_assert(offsetof(UCC22, EnableChainRattle) == 0x000389, "Member 'UCC22::EnableChainRattle' has a wrong offset!");
static_assert(offsetof(UCC22, ChainRattleSound) == 0x000390, "Member 'UCC22::ChainRattleSound' has a wrong offset!");
static_assert(offsetof(UCC22, ChainRattleMinVelocity) == 0x000398, "Member 'UCC22::ChainRattleMinVelocity' has a wrong offset!");
static_assert(offsetof(UCC22, ChainRattleRate) == 0x00039C, "Member 'UCC22::ChainRattleRate' has a wrong offset!");
static_assert(offsetof(UCC22, RattleMinimumChainLength) == 0x0003A0, "Member 'UCC22::RattleMinimumChainLength' has a wrong offset!");
static_assert(offsetof(UCC22, RattlePitchModulationMin) == 0x0003A4, "Member 'UCC22::RattlePitchModulationMin' has a wrong offset!");
static_assert(offsetof(UCC22, RattlePitchModulationMax) == 0x0003A8, "Member 'UCC22::RattlePitchModulationMax' has a wrong offset!");
static_assert(offsetof(UCC22, RattleVolumeModulationMin) == 0x0003AC, "Member 'UCC22::RattleVolumeModulationMin' has a wrong offset!");
static_assert(offsetof(UCC22, RattleVolumeModulationMax) == 0x0003B0, "Member 'UCC22::RattleVolumeModulationMax' has a wrong offset!");
static_assert(offsetof(UCC22, EnableChainAirWhip) == 0x0003B4, "Member 'UCC22::EnableChainAirWhip' has a wrong offset!");
static_assert(offsetof(UCC22, ChainAirWhipSound) == 0x0003B8, "Member 'UCC22::ChainAirWhipSound' has a wrong offset!");
static_assert(offsetof(UCC22, ChainAirWhipMinVelocity) == 0x0003C0, "Member 'UCC22::ChainAirWhipMinVelocity' has a wrong offset!");
static_assert(offsetof(UCC22, ChainAirWhipRate) == 0x0003C4, "Member 'UCC22::ChainAirWhipRate' has a wrong offset!");
static_assert(offsetof(UCC22, AirWhipPitchModulationMin) == 0x0003C8, "Member 'UCC22::AirWhipPitchModulationMin' has a wrong offset!");
static_assert(offsetof(UCC22, AirWhipPitchModulationMax) == 0x0003CC, "Member 'UCC22::AirWhipPitchModulationMax' has a wrong offset!");
static_assert(offsetof(UCC22, AirWhipVolumeModulationMin) == 0x0003D0, "Member 'UCC22::AirWhipVolumeModulationMin' has a wrong offset!");
static_assert(offsetof(UCC22, AirWhipVolumeModulationMax) == 0x0003D4, "Member 'UCC22::AirWhipVolumeModulationMax' has a wrong offset!");
static_assert(offsetof(UCC22, AirWhipMinimumChainLength) == 0x0003D8, "Member 'UCC22::AirWhipMinimumChainLength' has a wrong offset!");
static_assert(offsetof(UCC22, ImpactForceThreshold) == 0x0003DC, "Member 'UCC22::ImpactForceThreshold' has a wrong offset!");
static_assert(offsetof(UCC22, EnableImpactSound) == 0x0003E0, "Member 'UCC22::EnableImpactSound' has a wrong offset!");
static_assert(offsetof(UCC22, ImpactSound) == 0x0003E8, "Member 'UCC22::ImpactSound' has a wrong offset!");
static_assert(offsetof(UCC22, EnableImpactEmitter) == 0x0003F0, "Member 'UCC22::EnableImpactEmitter' has a wrong offset!");
static_assert(offsetof(UCC22, ImpactEmitter) == 0x0003F8, "Member 'UCC22::ImpactEmitter' has a wrong offset!");
static_assert(offsetof(UCC22, CanGrab) == 0x000400, "Member 'UCC22::CanGrab' has a wrong offset!");
static_assert(offsetof(UCC22, RigidnessScale) == 0x000404, "Member 'UCC22::RigidnessScale' has a wrong offset!");
static_assert(offsetof(UCC22, StabilizationThresholdMultiplier_CC) == 0x000408, "Member 'UCC22::StabilizationThresholdMultiplier_CC' has a wrong offset!");
static_assert(offsetof(UCC22, PositionSolverIterationCount_CC) == 0x00040C, "Member 'UCC22::PositionSolverIterationCount_CC' has a wrong offset!");
static_assert(offsetof(UCC22, VelocitySolverIterationCount_CC) == 0x000410, "Member 'UCC22::VelocitySolverIterationCount_CC' has a wrong offset!");
static_assert(offsetof(UCC22, PhysicsEnabled) == 0x000414, "Member 'UCC22::PhysicsEnabled' has a wrong offset!");
static_assert(offsetof(UCC22, DisableSelfCollision) == 0x000415, "Member 'UCC22::DisableSelfCollision' has a wrong offset!");
static_assert(offsetof(UCC22, OverrideRigidnessScale) == 0x000416, "Member 'UCC22::OverrideRigidnessScale' has a wrong offset!");
static_assert(offsetof(UCC22, SetLinearDamping_Override) == 0x000418, "Member 'UCC22::SetLinearDamping_Override' has a wrong offset!");
static_assert(offsetof(UCC22, SetAngularDamping_Override) == 0x00041C, "Member 'UCC22::SetAngularDamping_Override' has a wrong offset!");
static_assert(offsetof(UCC22, SetMassScale_Override) == 0x000420, "Member 'UCC22::SetMassScale_Override' has a wrong offset!");
static_assert(offsetof(UCC22, InertiaTensorScale_Override) == 0x000424, "Member 'UCC22::InertiaTensorScale_Override' has a wrong offset!");
static_assert(offsetof(UCC22, VelocityDrive_Override) == 0x000428, "Member 'UCC22::VelocityDrive_Override' has a wrong offset!");
static_assert(offsetof(UCC22, AngularDrive_Override) == 0x00042C, "Member 'UCC22::AngularDrive_Override' has a wrong offset!");
static_assert(offsetof(UCC22, AngularSwing1Limit_Override) == 0x000430, "Member 'UCC22::AngularSwing1Limit_Override' has a wrong offset!");
static_assert(offsetof(UCC22, AngularSwing2Limit_Override) == 0x000434, "Member 'UCC22::AngularSwing2Limit_Override' has a wrong offset!");
static_assert(offsetof(UCC22, AngularTwistLimit_Override) == 0x000438, "Member 'UCC22::AngularTwistLimit_Override' has a wrong offset!");
static_assert(offsetof(UCC22, IsCut_CC) == 0x00043C, "Member 'UCC22::IsCut_CC' has a wrong offset!");
static_assert(offsetof(UCC22, SplineLength_CC) == 0x000440, "Member 'UCC22::SplineLength_CC' has a wrong offset!");
static_assert(offsetof(UCC22, NumberOfUnits_CC) == 0x000444, "Member 'UCC22::NumberOfUnits_CC' has a wrong offset!");
static_assert(offsetof(UCC22, IsStartPrimitiveSkeletal_CC) == 0x000448, "Member 'UCC22::IsStartPrimitiveSkeletal_CC' has a wrong offset!");
static_assert(offsetof(UCC22, IsEndPrimitiveSkeletal_CC) == 0x000449, "Member 'UCC22::IsEndPrimitiveSkeletal_CC' has a wrong offset!");
static_assert(offsetof(UCC22, StartPrimitiveFound) == 0x00044A, "Member 'UCC22::StartPrimitiveFound' has a wrong offset!");
static_assert(offsetof(UCC22, EndPrimitiveFound) == 0x00044B, "Member 'UCC22::EndPrimitiveFound' has a wrong offset!");
static_assert(offsetof(UCC22, MeshBoundsSize) == 0x00044C, "Member 'UCC22::MeshBoundsSize' has a wrong offset!");
static_assert(offsetof(UCC22, RigidityScaleMultiplier) == 0x000450, "Member 'UCC22::RigidityScaleMultiplier' has a wrong offset!");
static_assert(offsetof(UCC22, OnComponentHitFlowControl_CC) == 0x000454, "Member 'UCC22::OnComponentHitFlowControl_CC' has a wrong offset!");
static_assert(offsetof(UCC22, HasGrabbed_CC) == 0x000455, "Member 'UCC22::HasGrabbed_CC' has a wrong offset!");
static_assert(offsetof(UCC22, OriginalGrabDistance_CC) == 0x000458, "Member 'UCC22::OriginalGrabDistance_CC' has a wrong offset!");
static_assert(offsetof(UCC22, DisableGrabDuration_CC) == 0x00045C, "Member 'UCC22::DisableGrabDuration_CC' has a wrong offset!");
static_assert(offsetof(UCC22, HitCounter_CC) == 0x000460, "Member 'UCC22::HitCounter_CC' has a wrong offset!");
static_assert(offsetof(UCC22, AllowAirWhip_CC) == 0x000464, "Member 'UCC22::AllowAirWhip_CC' has a wrong offset!");
static_assert(offsetof(UCC22, AllowDelayLoops_CC) == 0x000465, "Member 'UCC22::AllowDelayLoops_CC' has a wrong offset!");
static_assert(offsetof(UCC22, SetLinearDamping_CC) == 0x000468, "Member 'UCC22::SetLinearDamping_CC' has a wrong offset!");
static_assert(offsetof(UCC22, SetAngularDamping_CC) == 0x00046C, "Member 'UCC22::SetAngularDamping_CC' has a wrong offset!");
static_assert(offsetof(UCC22, SetMassScale_CC) == 0x000470, "Member 'UCC22::SetMassScale_CC' has a wrong offset!");
static_assert(offsetof(UCC22, InertiaTensorScale_CC) == 0x000474, "Member 'UCC22::InertiaTensorScale_CC' has a wrong offset!");
static_assert(offsetof(UCC22, VelocityDrive_CC) == 0x000478, "Member 'UCC22::VelocityDrive_CC' has a wrong offset!");
static_assert(offsetof(UCC22, AngularDrive_CC) == 0x00047C, "Member 'UCC22::AngularDrive_CC' has a wrong offset!");
static_assert(offsetof(UCC22, AngularSwing1Limit_CC) == 0x000480, "Member 'UCC22::AngularSwing1Limit_CC' has a wrong offset!");
static_assert(offsetof(UCC22, AngularSwing2Limit_CC) == 0x000484, "Member 'UCC22::AngularSwing2Limit_CC' has a wrong offset!");
static_assert(offsetof(UCC22, AngularTwistLimit_CC) == 0x000488, "Member 'UCC22::AngularTwistLimit_CC' has a wrong offset!");
static_assert(offsetof(UCC22, FirstUnitOrigin_Loc_EMov_CC) == 0x000490, "Member 'UCC22::FirstUnitOrigin_Loc_EMov_CC' has a wrong offset!");
static_assert(offsetof(UCC22, FirstUnitOrigin_Rot_EMov_CC) == 0x0004A8, "Member 'UCC22::FirstUnitOrigin_Rot_EMov_CC' has a wrong offset!");
static_assert(offsetof(UCC22, LastUnitOrigin_Loc_EMov_CC) == 0x0004C0, "Member 'UCC22::LastUnitOrigin_Loc_EMov_CC' has a wrong offset!");
static_assert(offsetof(UCC22, LastUnitOrigin_Rot_EMov_CC) == 0x0004D8, "Member 'UCC22::LastUnitOrigin_Rot_EMov_CC' has a wrong offset!");
static_assert(offsetof(UCC22, LastUnitTarget_Loc_EMov_CC) == 0x0004F0, "Member 'UCC22::LastUnitTarget_Loc_EMov_CC' has a wrong offset!");
static_assert(offsetof(UCC22, LastUnitTarget_Rot_EMov_CC) == 0x000508, "Member 'UCC22::LastUnitTarget_Rot_EMov_CC' has a wrong offset!");
static_assert(offsetof(UCC22, Begin_EMov_CC) == 0x000520, "Member 'UCC22::Begin_EMov_CC' has a wrong offset!");
static_assert(offsetof(UCC22, AllowFirstUnitRotate_Att_EMov_CC) == 0x000521, "Member 'UCC22::AllowFirstUnitRotate_Att_EMov_CC' has a wrong offset!");
static_assert(offsetof(UCC22, AllowFirstUnitRotate_Immobile_EMov_CC) == 0x000522, "Member 'UCC22::AllowFirstUnitRotate_Immobile_EMov_CC' has a wrong offset!");
static_assert(offsetof(UCC22, LerpValue_EMov_CC) == 0x000524, "Member 'UCC22::LerpValue_EMov_CC' has a wrong offset!");
static_assert(offsetof(UCC22, TimerDelay_EMov_CC) == 0x000528, "Member 'UCC22::TimerDelay_EMov_CC' has a wrong offset!");
static_assert(offsetof(UCC22, FirstUnitOrigin_Loc_SMov_CC) == 0x000530, "Member 'UCC22::FirstUnitOrigin_Loc_SMov_CC' has a wrong offset!");
static_assert(offsetof(UCC22, FirstUnitOrigin_Rot_SMov_CC) == 0x000548, "Member 'UCC22::FirstUnitOrigin_Rot_SMov_CC' has a wrong offset!");
static_assert(offsetof(UCC22, LastUnitOrigin_Loc_SMov_CC) == 0x000560, "Member 'UCC22::LastUnitOrigin_Loc_SMov_CC' has a wrong offset!");
static_assert(offsetof(UCC22, LastUnitOrigin_Rot_SMov_CC) == 0x000578, "Member 'UCC22::LastUnitOrigin_Rot_SMov_CC' has a wrong offset!");
static_assert(offsetof(UCC22, FirstUnitTarget_Loc_SMov_CC) == 0x000590, "Member 'UCC22::FirstUnitTarget_Loc_SMov_CC' has a wrong offset!");
static_assert(offsetof(UCC22, FirstUnitTarget_Rot_SMov_CC) == 0x0005A8, "Member 'UCC22::FirstUnitTarget_Rot_SMov_CC' has a wrong offset!");
static_assert(offsetof(UCC22, FirstUnitTarget_RotInvert_SMov_CC) == 0x0005C0, "Member 'UCC22::FirstUnitTarget_RotInvert_SMov_CC' has a wrong offset!");
static_assert(offsetof(UCC22, Begin_SMov_CC) == 0x0005D8, "Member 'UCC22::Begin_SMov_CC' has a wrong offset!");
static_assert(offsetof(UCC22, AllowFirstUnitRotate_Att_SMov_CC) == 0x0005D9, "Member 'UCC22::AllowFirstUnitRotate_Att_SMov_CC' has a wrong offset!");
static_assert(offsetof(UCC22, AllowFirstUnitRotate_Immobile_SMov_CC) == 0x0005DA, "Member 'UCC22::AllowFirstUnitRotate_Immobile_SMov_CC' has a wrong offset!");
static_assert(offsetof(UCC22, LerpValue_SMov_CC) == 0x0005DC, "Member 'UCC22::LerpValue_SMov_CC' has a wrong offset!");
static_assert(offsetof(UCC22, TimerDelay_SMov_CC) == 0x0005E0, "Member 'UCC22::TimerDelay_SMov_CC' has a wrong offset!");
static_assert(offsetof(UCC22, ChainMeshPR_CC) == 0x0005E8, "Member 'UCC22::ChainMeshPR_CC' has a wrong offset!");
static_assert(offsetof(UCC22, FalseChainMeshPR_CC) == 0x0005F0, "Member 'UCC22::FalseChainMeshPR_CC' has a wrong offset!");
static_assert(offsetof(UCC22, First_ChainMeshPR_CC) == 0x0005F8, "Member 'UCC22::First_ChainMeshPR_CC' has a wrong offset!");
static_assert(offsetof(UCC22, LastChainMeshPR_CC) == 0x000600, "Member 'UCC22::LastChainMeshPR_CC' has a wrong offset!");
static_assert(offsetof(UCC22, PhysicsConstraintPR_CC) == 0x000608, "Member 'UCC22::PhysicsConstraintPR_CC' has a wrong offset!");
static_assert(offsetof(UCC22, BuildingSplinePR_CC) == 0x000610, "Member 'UCC22::BuildingSplinePR_CC' has a wrong offset!");
static_assert(offsetof(UCC22, DataSplinePR_CC) == 0x000618, "Member 'UCC22::DataSplinePR_CC' has a wrong offset!");
static_assert(offsetof(UCC22, DataSplineDestroyPR_CC) == 0x000620, "Member 'UCC22::DataSplineDestroyPR_CC' has a wrong offset!");
static_assert(offsetof(UCC22, StartPrimitive_CC) == 0x000628, "Member 'UCC22::StartPrimitive_CC' has a wrong offset!");
static_assert(offsetof(UCC22, StartPhyConstrPR_CC) == 0x000630, "Member 'UCC22::StartPhyConstrPR_CC' has a wrong offset!");
static_assert(offsetof(UCC22, StartSkeletalMesh_CC) == 0x000638, "Member 'UCC22::StartSkeletalMesh_CC' has a wrong offset!");
static_assert(offsetof(UCC22, EndPrimitive_CC) == 0x000640, "Member 'UCC22::EndPrimitive_CC' has a wrong offset!");
static_assert(offsetof(UCC22, EndPhyConstrPR_CC) == 0x000648, "Member 'UCC22::EndPhyConstrPR_CC' has a wrong offset!");
