#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RopeCutting

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function RopeCutting.CC22.AttachChainEnd_RC
// 0x0018 (0x0018 - 0x0000)
struct CC22_AttachChainEnd_RC final
{
public:
	class UPrimitiveComponent*                    MeshToAttach;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SocketName;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CC22_AttachChainEnd_RC) == 0x000008, "Wrong alignment on CC22_AttachChainEnd_RC");
static_assert(sizeof(CC22_AttachChainEnd_RC) == 0x000018, "Wrong size on CC22_AttachChainEnd_RC");
static_assert(offsetof(CC22_AttachChainEnd_RC, MeshToAttach) == 0x000000, "Member 'CC22_AttachChainEnd_RC::MeshToAttach' has a wrong offset!");
static_assert(offsetof(CC22_AttachChainEnd_RC, SocketName) == 0x000008, "Member 'CC22_AttachChainEnd_RC::SocketName' has a wrong offset!");
static_assert(offsetof(CC22_AttachChainEnd_RC, BoneName) == 0x000010, "Member 'CC22_AttachChainEnd_RC::BoneName' has a wrong offset!");

// Function RopeCutting.CC22.AttachChainStart_CC
// 0x0018 (0x0018 - 0x0000)
struct CC22_AttachChainStart_CC final
{
public:
	class UPrimitiveComponent*                    MeshToAttach;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SocketName;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CC22_AttachChainStart_CC) == 0x000008, "Wrong alignment on CC22_AttachChainStart_CC");
static_assert(sizeof(CC22_AttachChainStart_CC) == 0x000018, "Wrong size on CC22_AttachChainStart_CC");
static_assert(offsetof(CC22_AttachChainStart_CC, MeshToAttach) == 0x000000, "Member 'CC22_AttachChainStart_CC::MeshToAttach' has a wrong offset!");
static_assert(offsetof(CC22_AttachChainStart_CC, SocketName) == 0x000008, "Member 'CC22_AttachChainStart_CC::SocketName' has a wrong offset!");
static_assert(offsetof(CC22_AttachChainStart_CC, BoneName) == 0x000010, "Member 'CC22_AttachChainStart_CC::BoneName' has a wrong offset!");

// Function RopeCutting.CC22.BreakChain_CC
// 0x0008 (0x0008 - 0x0000)
struct CC22_BreakChain_CC final
{
public:
	class UPrimitiveComponent*                    ChainLinkHit;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CC22_BreakChain_CC) == 0x000008, "Wrong alignment on CC22_BreakChain_CC");
static_assert(sizeof(CC22_BreakChain_CC) == 0x000008, "Wrong size on CC22_BreakChain_CC");
static_assert(offsetof(CC22_BreakChain_CC, ChainLinkHit) == 0x000000, "Member 'CC22_BreakChain_CC::ChainLinkHit' has a wrong offset!");

// Function RopeCutting.CC22.BreakChainByNumber_CC
// 0x0004 (0x0004 - 0x0000)
struct CC22_BreakChainByNumber_CC final
{
public:
	int32                                         ChainLinkHit;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CC22_BreakChainByNumber_CC) == 0x000004, "Wrong alignment on CC22_BreakChainByNumber_CC");
static_assert(sizeof(CC22_BreakChainByNumber_CC) == 0x000004, "Wrong size on CC22_BreakChainByNumber_CC");
static_assert(offsetof(CC22_BreakChainByNumber_CC, ChainLinkHit) == 0x000000, "Member 'CC22_BreakChainByNumber_CC::ChainLinkHit' has a wrong offset!");

// Function RopeCutting.CC22.CreateUniqueName_CC
// 0x0020 (0x0020 - 0x0000)
struct CC22_CreateUniqueName_CC final
{
public:
	class FString                                 ComponentType;                                     // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ComponentNumber;                                   // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0014(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1955[0x4];                                     // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CC22_CreateUniqueName_CC) == 0x000008, "Wrong alignment on CC22_CreateUniqueName_CC");
static_assert(sizeof(CC22_CreateUniqueName_CC) == 0x000020, "Wrong size on CC22_CreateUniqueName_CC");
static_assert(offsetof(CC22_CreateUniqueName_CC, ComponentType) == 0x000000, "Member 'CC22_CreateUniqueName_CC::ComponentType' has a wrong offset!");
static_assert(offsetof(CC22_CreateUniqueName_CC, ComponentNumber) == 0x000010, "Member 'CC22_CreateUniqueName_CC::ComponentNumber' has a wrong offset!");
static_assert(offsetof(CC22_CreateUniqueName_CC, ReturnValue) == 0x000014, "Member 'CC22_CreateUniqueName_CC::ReturnValue' has a wrong offset!");

// Function RopeCutting.CC22.DropChain_CC
// 0x0004 (0x0004 - 0x0000)
struct CC22_DropChain_CC final
{
public:
	float                                         DisableGrabDuration;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CC22_DropChain_CC) == 0x000004, "Wrong alignment on CC22_DropChain_CC");
static_assert(sizeof(CC22_DropChain_CC) == 0x000004, "Wrong size on CC22_DropChain_CC");
static_assert(offsetof(CC22_DropChain_CC, DisableGrabDuration) == 0x000000, "Member 'CC22_DropChain_CC::DisableGrabDuration' has a wrong offset!");

// Function RopeCutting.CC22.GetEndPrimitiveConstraint_CC
// 0x0008 (0x0008 - 0x0000)
struct CC22_GetEndPrimitiveConstraint_CC final
{
public:
	class UPhysicsConstraintComponent*            ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CC22_GetEndPrimitiveConstraint_CC) == 0x000008, "Wrong alignment on CC22_GetEndPrimitiveConstraint_CC");
static_assert(sizeof(CC22_GetEndPrimitiveConstraint_CC) == 0x000008, "Wrong size on CC22_GetEndPrimitiveConstraint_CC");
static_assert(offsetof(CC22_GetEndPrimitiveConstraint_CC, ReturnValue) == 0x000000, "Member 'CC22_GetEndPrimitiveConstraint_CC::ReturnValue' has a wrong offset!");

// Function RopeCutting.CC22.GetFirstChainMesh_CC
// 0x0008 (0x0008 - 0x0000)
struct CC22_GetFirstChainMesh_CC final
{
public:
	class UStaticMeshComponent*                   ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CC22_GetFirstChainMesh_CC) == 0x000008, "Wrong alignment on CC22_GetFirstChainMesh_CC");
static_assert(sizeof(CC22_GetFirstChainMesh_CC) == 0x000008, "Wrong size on CC22_GetFirstChainMesh_CC");
static_assert(offsetof(CC22_GetFirstChainMesh_CC, ReturnValue) == 0x000000, "Member 'CC22_GetFirstChainMesh_CC::ReturnValue' has a wrong offset!");

// Function RopeCutting.CC22.GetLastChainMesh_CC
// 0x0008 (0x0008 - 0x0000)
struct CC22_GetLastChainMesh_CC final
{
public:
	class UStaticMeshComponent*                   ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CC22_GetLastChainMesh_CC) == 0x000008, "Wrong alignment on CC22_GetLastChainMesh_CC");
static_assert(sizeof(CC22_GetLastChainMesh_CC) == 0x000008, "Wrong size on CC22_GetLastChainMesh_CC");
static_assert(offsetof(CC22_GetLastChainMesh_CC, ReturnValue) == 0x000000, "Member 'CC22_GetLastChainMesh_CC::ReturnValue' has a wrong offset!");

// Function RopeCutting.CC22.GetMeshArray_CC
// 0x0010 (0x0010 - 0x0000)
struct CC22_GetMeshArray_CC final
{
public:
	TArray<class UStaticMeshComponent*>           ReturnValue;                                       // 0x0000(0x0010)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(CC22_GetMeshArray_CC) == 0x000008, "Wrong alignment on CC22_GetMeshArray_CC");
static_assert(sizeof(CC22_GetMeshArray_CC) == 0x000010, "Wrong size on CC22_GetMeshArray_CC");
static_assert(offsetof(CC22_GetMeshArray_CC, ReturnValue) == 0x000000, "Member 'CC22_GetMeshArray_CC::ReturnValue' has a wrong offset!");

// Function RopeCutting.CC22.GetPhysicsConstraintArray_CC
// 0x0010 (0x0010 - 0x0000)
struct CC22_GetPhysicsConstraintArray_CC final
{
public:
	TArray<class UPhysicsConstraintComponent*>    ReturnValue;                                       // 0x0000(0x0010)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(CC22_GetPhysicsConstraintArray_CC) == 0x000008, "Wrong alignment on CC22_GetPhysicsConstraintArray_CC");
static_assert(sizeof(CC22_GetPhysicsConstraintArray_CC) == 0x000010, "Wrong size on CC22_GetPhysicsConstraintArray_CC");
static_assert(offsetof(CC22_GetPhysicsConstraintArray_CC, ReturnValue) == 0x000000, "Member 'CC22_GetPhysicsConstraintArray_CC::ReturnValue' has a wrong offset!");

// Function RopeCutting.CC22.GetStartPrimitiveConstraint_CC
// 0x0008 (0x0008 - 0x0000)
struct CC22_GetStartPrimitiveConstraint_CC final
{
public:
	class UPhysicsConstraintComponent*            ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CC22_GetStartPrimitiveConstraint_CC) == 0x000008, "Wrong alignment on CC22_GetStartPrimitiveConstraint_CC");
static_assert(sizeof(CC22_GetStartPrimitiveConstraint_CC) == 0x000008, "Wrong size on CC22_GetStartPrimitiveConstraint_CC");
static_assert(offsetof(CC22_GetStartPrimitiveConstraint_CC, ReturnValue) == 0x000000, "Member 'CC22_GetStartPrimitiveConstraint_CC::ReturnValue' has a wrong offset!");

// Function RopeCutting.CC22.MoveEndOfChain_CC
// 0x0020 (0x0020 - 0x0000)
struct CC22_MoveEndOfChain_CC final
{
public:
	struct FVector                                MoveToLocation;                                    // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DurationOfMove;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AllowStartRotationAttached;                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AllowStartRotationImmobilised;                     // 0x001D(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1956[0x2];                                     // 0x001E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CC22_MoveEndOfChain_CC) == 0x000008, "Wrong alignment on CC22_MoveEndOfChain_CC");
static_assert(sizeof(CC22_MoveEndOfChain_CC) == 0x000020, "Wrong size on CC22_MoveEndOfChain_CC");
static_assert(offsetof(CC22_MoveEndOfChain_CC, MoveToLocation) == 0x000000, "Member 'CC22_MoveEndOfChain_CC::MoveToLocation' has a wrong offset!");
static_assert(offsetof(CC22_MoveEndOfChain_CC, DurationOfMove) == 0x000018, "Member 'CC22_MoveEndOfChain_CC::DurationOfMove' has a wrong offset!");
static_assert(offsetof(CC22_MoveEndOfChain_CC, AllowStartRotationAttached) == 0x00001C, "Member 'CC22_MoveEndOfChain_CC::AllowStartRotationAttached' has a wrong offset!");
static_assert(offsetof(CC22_MoveEndOfChain_CC, AllowStartRotationImmobilised) == 0x00001D, "Member 'CC22_MoveEndOfChain_CC::AllowStartRotationImmobilised' has a wrong offset!");

// Function RopeCutting.CC22.MoveStartOfChain_CC
// 0x0020 (0x0020 - 0x0000)
struct CC22_MoveStartOfChain_CC final
{
public:
	struct FVector                                MoveToLocation;                                    // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DurationOfMove;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AllowEndRotationAttached;                          // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AllowEndRotationImmobilised;                       // 0x001D(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1957[0x2];                                     // 0x001E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CC22_MoveStartOfChain_CC) == 0x000008, "Wrong alignment on CC22_MoveStartOfChain_CC");
static_assert(sizeof(CC22_MoveStartOfChain_CC) == 0x000020, "Wrong size on CC22_MoveStartOfChain_CC");
static_assert(offsetof(CC22_MoveStartOfChain_CC, MoveToLocation) == 0x000000, "Member 'CC22_MoveStartOfChain_CC::MoveToLocation' has a wrong offset!");
static_assert(offsetof(CC22_MoveStartOfChain_CC, DurationOfMove) == 0x000018, "Member 'CC22_MoveStartOfChain_CC::DurationOfMove' has a wrong offset!");
static_assert(offsetof(CC22_MoveStartOfChain_CC, AllowEndRotationAttached) == 0x00001C, "Member 'CC22_MoveStartOfChain_CC::AllowEndRotationAttached' has a wrong offset!");
static_assert(offsetof(CC22_MoveStartOfChain_CC, AllowEndRotationImmobilised) == 0x00001D, "Member 'CC22_MoveStartOfChain_CC::AllowEndRotationImmobilised' has a wrong offset!");

// Function RopeCutting.CC22.OnCompHit
// 0x0118 (0x0118 - 0x0000)
struct CC22_OnCompHit final
{
public:
	class UPrimitiveComponent*                    HitComp;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             Hit;                                               // 0x0030(0x00E8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(CC22_OnCompHit) == 0x000008, "Wrong alignment on CC22_OnCompHit");
static_assert(sizeof(CC22_OnCompHit) == 0x000118, "Wrong size on CC22_OnCompHit");
static_assert(offsetof(CC22_OnCompHit, HitComp) == 0x000000, "Member 'CC22_OnCompHit::HitComp' has a wrong offset!");
static_assert(offsetof(CC22_OnCompHit, OtherActor) == 0x000008, "Member 'CC22_OnCompHit::OtherActor' has a wrong offset!");
static_assert(offsetof(CC22_OnCompHit, OtherComp) == 0x000010, "Member 'CC22_OnCompHit::OtherComp' has a wrong offset!");
static_assert(offsetof(CC22_OnCompHit, NormalImpulse) == 0x000018, "Member 'CC22_OnCompHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(CC22_OnCompHit, Hit) == 0x000030, "Member 'CC22_OnCompHit::Hit' has a wrong offset!");

// Function RopeCutting.CC22.ResetChainAfterMove_CC
// 0x0002 (0x0002 - 0x0000)
struct CC22_ResetChainAfterMove_CC final
{
public:
	bool                                          ImmobiliseStart;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ImmobiliseEnd;                                     // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CC22_ResetChainAfterMove_CC) == 0x000001, "Wrong alignment on CC22_ResetChainAfterMove_CC");
static_assert(sizeof(CC22_ResetChainAfterMove_CC) == 0x000002, "Wrong size on CC22_ResetChainAfterMove_CC");
static_assert(offsetof(CC22_ResetChainAfterMove_CC, ImmobiliseStart) == 0x000000, "Member 'CC22_ResetChainAfterMove_CC::ImmobiliseStart' has a wrong offset!");
static_assert(offsetof(CC22_ResetChainAfterMove_CC, ImmobiliseEnd) == 0x000001, "Member 'CC22_ResetChainAfterMove_CC::ImmobiliseEnd' has a wrong offset!");

// Function RopeCutting.RC22.AddPointsToBuildingSpline
// 0x0010 (0x0010 - 0x0000)
struct RC22_AddPointsToBuildingSpline final
{
public:
	class USplineComponent*                       SplineToGrow;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumberOfLoopsAPTSIn;                               // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UnitLengthAPTSIn;                                  // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RC22_AddPointsToBuildingSpline) == 0x000008, "Wrong alignment on RC22_AddPointsToBuildingSpline");
static_assert(sizeof(RC22_AddPointsToBuildingSpline) == 0x000010, "Wrong size on RC22_AddPointsToBuildingSpline");
static_assert(offsetof(RC22_AddPointsToBuildingSpline, SplineToGrow) == 0x000000, "Member 'RC22_AddPointsToBuildingSpline::SplineToGrow' has a wrong offset!");
static_assert(offsetof(RC22_AddPointsToBuildingSpline, NumberOfLoopsAPTSIn) == 0x000008, "Member 'RC22_AddPointsToBuildingSpline::NumberOfLoopsAPTSIn' has a wrong offset!");
static_assert(offsetof(RC22_AddPointsToBuildingSpline, UnitLengthAPTSIn) == 0x00000C, "Member 'RC22_AddPointsToBuildingSpline::UnitLengthAPTSIn' has a wrong offset!");

// Function RopeCutting.RC22.AddPointsToSpline
// 0x0030 (0x0030 - 0x0000)
struct RC22_AddPointsToSpline final
{
public:
	class USplineComponent*                       SplineToGrow;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USplineComponent*                       UserSplineCRSIn;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumberOfLoopsAPTSIn;                               // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UnitLengthAPTSIn;                                  // 0x0014(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                RopeOffsetAPTSIn;                                  // 0x0018(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RC22_AddPointsToSpline) == 0x000008, "Wrong alignment on RC22_AddPointsToSpline");
static_assert(sizeof(RC22_AddPointsToSpline) == 0x000030, "Wrong size on RC22_AddPointsToSpline");
static_assert(offsetof(RC22_AddPointsToSpline, SplineToGrow) == 0x000000, "Member 'RC22_AddPointsToSpline::SplineToGrow' has a wrong offset!");
static_assert(offsetof(RC22_AddPointsToSpline, UserSplineCRSIn) == 0x000008, "Member 'RC22_AddPointsToSpline::UserSplineCRSIn' has a wrong offset!");
static_assert(offsetof(RC22_AddPointsToSpline, NumberOfLoopsAPTSIn) == 0x000010, "Member 'RC22_AddPointsToSpline::NumberOfLoopsAPTSIn' has a wrong offset!");
static_assert(offsetof(RC22_AddPointsToSpline, UnitLengthAPTSIn) == 0x000014, "Member 'RC22_AddPointsToSpline::UnitLengthAPTSIn' has a wrong offset!");
static_assert(offsetof(RC22_AddPointsToSpline, RopeOffsetAPTSIn) == 0x000018, "Member 'RC22_AddPointsToSpline::RopeOffsetAPTSIn' has a wrong offset!");

// Function RopeCutting.RC22.AdjustRenderSplineLocation
// 0x0028 (0x0028 - 0x0000)
struct RC22_AdjustRenderSplineLocation final
{
public:
	class USplineComponent*                       RenderSpline;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USplineComponent*                       UserSpline;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    AttachedPrimitive;                                 // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumberOfLoops;                                     // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SocketName;                                        // 0x001C(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1985[0x4];                                     // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RC22_AdjustRenderSplineLocation) == 0x000008, "Wrong alignment on RC22_AdjustRenderSplineLocation");
static_assert(sizeof(RC22_AdjustRenderSplineLocation) == 0x000028, "Wrong size on RC22_AdjustRenderSplineLocation");
static_assert(offsetof(RC22_AdjustRenderSplineLocation, RenderSpline) == 0x000000, "Member 'RC22_AdjustRenderSplineLocation::RenderSpline' has a wrong offset!");
static_assert(offsetof(RC22_AdjustRenderSplineLocation, UserSpline) == 0x000008, "Member 'RC22_AdjustRenderSplineLocation::UserSpline' has a wrong offset!");
static_assert(offsetof(RC22_AdjustRenderSplineLocation, AttachedPrimitive) == 0x000010, "Member 'RC22_AdjustRenderSplineLocation::AttachedPrimitive' has a wrong offset!");
static_assert(offsetof(RC22_AdjustRenderSplineLocation, NumberOfLoops) == 0x000018, "Member 'RC22_AdjustRenderSplineLocation::NumberOfLoops' has a wrong offset!");
static_assert(offsetof(RC22_AdjustRenderSplineLocation, SocketName) == 0x00001C, "Member 'RC22_AdjustRenderSplineLocation::SocketName' has a wrong offset!");

// Function RopeCutting.RC22.CreateSphereCollision
// 0x0018 (0x0018 - 0x0000)
struct RC22_CreateSphereCollision final
{
public:
	class USphereComponent*                       SphereCollisionCSCIn;                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWorld*                                 WorldRefCSCIn;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USplineComponent*                       SplineRefCSCIn;                                    // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RC22_CreateSphereCollision) == 0x000008, "Wrong alignment on RC22_CreateSphereCollision");
static_assert(sizeof(RC22_CreateSphereCollision) == 0x000018, "Wrong size on RC22_CreateSphereCollision");
static_assert(offsetof(RC22_CreateSphereCollision, SphereCollisionCSCIn) == 0x000000, "Member 'RC22_CreateSphereCollision::SphereCollisionCSCIn' has a wrong offset!");
static_assert(offsetof(RC22_CreateSphereCollision, WorldRefCSCIn) == 0x000008, "Member 'RC22_CreateSphereCollision::WorldRefCSCIn' has a wrong offset!");
static_assert(offsetof(RC22_CreateSphereCollision, SplineRefCSCIn) == 0x000010, "Member 'RC22_CreateSphereCollision::SplineRefCSCIn' has a wrong offset!");

// Function RopeCutting.RC22.CreateSpline
// 0x0048 (0x0048 - 0x0000)
struct RC22_CreateSpline final
{
public:
	class USplineComponent*                       InSplineCS;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                WorldLocationCS;                                   // 0x0008(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               WorldRotationCS;                                   // 0x0020(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class UWorld*                                 WorldRefCSIn;                                      // 0x0038(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        SelfRefCSIn;                                       // 0x0040(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RC22_CreateSpline) == 0x000008, "Wrong alignment on RC22_CreateSpline");
static_assert(sizeof(RC22_CreateSpline) == 0x000048, "Wrong size on RC22_CreateSpline");
static_assert(offsetof(RC22_CreateSpline, InSplineCS) == 0x000000, "Member 'RC22_CreateSpline::InSplineCS' has a wrong offset!");
static_assert(offsetof(RC22_CreateSpline, WorldLocationCS) == 0x000008, "Member 'RC22_CreateSpline::WorldLocationCS' has a wrong offset!");
static_assert(offsetof(RC22_CreateSpline, WorldRotationCS) == 0x000020, "Member 'RC22_CreateSpline::WorldRotationCS' has a wrong offset!");
static_assert(offsetof(RC22_CreateSpline, WorldRefCSIn) == 0x000038, "Member 'RC22_CreateSpline::WorldRefCSIn' has a wrong offset!");
static_assert(offsetof(RC22_CreateSpline, SelfRefCSIn) == 0x000040, "Member 'RC22_CreateSpline::SelfRefCSIn' has a wrong offset!");

// Function RopeCutting.RC22.CreateSplineMeshes
// 0x0018 (0x0018 - 0x0000)
struct RC22_CreateSplineMeshes final
{
public:
	class USplineMeshComponent*                   SplineMeshCSMInput;                                // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWorld*                                 WorldRefCSMIn;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USplineComponent*                       SplineOwnerRefCSMIn;                               // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RC22_CreateSplineMeshes) == 0x000008, "Wrong alignment on RC22_CreateSplineMeshes");
static_assert(sizeof(RC22_CreateSplineMeshes) == 0x000018, "Wrong size on RC22_CreateSplineMeshes");
static_assert(offsetof(RC22_CreateSplineMeshes, SplineMeshCSMInput) == 0x000000, "Member 'RC22_CreateSplineMeshes::SplineMeshCSMInput' has a wrong offset!");
static_assert(offsetof(RC22_CreateSplineMeshes, WorldRefCSMIn) == 0x000008, "Member 'RC22_CreateSplineMeshes::WorldRefCSMIn' has a wrong offset!");
static_assert(offsetof(RC22_CreateSplineMeshes, SplineOwnerRefCSMIn) == 0x000010, "Member 'RC22_CreateSplineMeshes::SplineOwnerRefCSMIn' has a wrong offset!");

// Function RopeCutting.RC22.MakePhysConstr
// 0x0030 (0x0030 - 0x0000)
struct RC22_MakePhysConstr final
{
public:
	class UPhysicsConstraintComponent*            PhyConstrMPCIn;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWorld*                                 WorldRefMPCIn;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                WorldLocationMPCIn;                                // 0x0010(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USphereComponent*                       CollRefAttachMPCIn;                                // 0x0028(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RC22_MakePhysConstr) == 0x000008, "Wrong alignment on RC22_MakePhysConstr");
static_assert(sizeof(RC22_MakePhysConstr) == 0x000030, "Wrong size on RC22_MakePhysConstr");
static_assert(offsetof(RC22_MakePhysConstr, PhyConstrMPCIn) == 0x000000, "Member 'RC22_MakePhysConstr::PhyConstrMPCIn' has a wrong offset!");
static_assert(offsetof(RC22_MakePhysConstr, WorldRefMPCIn) == 0x000008, "Member 'RC22_MakePhysConstr::WorldRefMPCIn' has a wrong offset!");
static_assert(offsetof(RC22_MakePhysConstr, WorldLocationMPCIn) == 0x000010, "Member 'RC22_MakePhysConstr::WorldLocationMPCIn' has a wrong offset!");
static_assert(offsetof(RC22_MakePhysConstr, CollRefAttachMPCIn) == 0x000028, "Member 'RC22_MakePhysConstr::CollRefAttachMPCIn' has a wrong offset!");

// Function RopeCutting.RC22.Mesh_RC
// 0x0028 (0x0028 - 0x0000)
struct RC22_Mesh_RC final
{
public:
	class USplineMeshComponent*                   SplineMeshToConfigure;                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            MeshModel;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MeshWidth_Config;                                  // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1986[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     MeshMat01;                                         // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     MeshMat02;                                         // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RC22_Mesh_RC) == 0x000008, "Wrong alignment on RC22_Mesh_RC");
static_assert(sizeof(RC22_Mesh_RC) == 0x000028, "Wrong size on RC22_Mesh_RC");
static_assert(offsetof(RC22_Mesh_RC, SplineMeshToConfigure) == 0x000000, "Member 'RC22_Mesh_RC::SplineMeshToConfigure' has a wrong offset!");
static_assert(offsetof(RC22_Mesh_RC, MeshModel) == 0x000008, "Member 'RC22_Mesh_RC::MeshModel' has a wrong offset!");
static_assert(offsetof(RC22_Mesh_RC, MeshWidth_Config) == 0x000010, "Member 'RC22_Mesh_RC::MeshWidth_Config' has a wrong offset!");
static_assert(offsetof(RC22_Mesh_RC, MeshMat01) == 0x000018, "Member 'RC22_Mesh_RC::MeshMat01' has a wrong offset!");
static_assert(offsetof(RC22_Mesh_RC, MeshMat02) == 0x000020, "Member 'RC22_Mesh_RC::MeshMat02' has a wrong offset!");

// Function RopeCutting.RC22.PhyConstrConfig
// 0x0028 (0x0028 - 0x0000)
struct RC22_PhyConstrConfig final
{
public:
	class UPhysicsConstraintComponent*            PhyConstrIn;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SetAngularSwing1LimitPCCIn;                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SetAngularSwing2LimitPCCIn;                        // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SetAngularTwistLimitPCCIn;                         // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngularDrivePositionStrengthPCCIn;                 // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngularDriveVelocityStrengthPCCIn;                 // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LinearLimit;                                       // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LinearDrive;                                       // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1987[0x4];                                     // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RC22_PhyConstrConfig) == 0x000008, "Wrong alignment on RC22_PhyConstrConfig");
static_assert(sizeof(RC22_PhyConstrConfig) == 0x000028, "Wrong size on RC22_PhyConstrConfig");
static_assert(offsetof(RC22_PhyConstrConfig, PhyConstrIn) == 0x000000, "Member 'RC22_PhyConstrConfig::PhyConstrIn' has a wrong offset!");
static_assert(offsetof(RC22_PhyConstrConfig, SetAngularSwing1LimitPCCIn) == 0x000008, "Member 'RC22_PhyConstrConfig::SetAngularSwing1LimitPCCIn' has a wrong offset!");
static_assert(offsetof(RC22_PhyConstrConfig, SetAngularSwing2LimitPCCIn) == 0x00000C, "Member 'RC22_PhyConstrConfig::SetAngularSwing2LimitPCCIn' has a wrong offset!");
static_assert(offsetof(RC22_PhyConstrConfig, SetAngularTwistLimitPCCIn) == 0x000010, "Member 'RC22_PhyConstrConfig::SetAngularTwistLimitPCCIn' has a wrong offset!");
static_assert(offsetof(RC22_PhyConstrConfig, AngularDrivePositionStrengthPCCIn) == 0x000014, "Member 'RC22_PhyConstrConfig::AngularDrivePositionStrengthPCCIn' has a wrong offset!");
static_assert(offsetof(RC22_PhyConstrConfig, AngularDriveVelocityStrengthPCCIn) == 0x000018, "Member 'RC22_PhyConstrConfig::AngularDriveVelocityStrengthPCCIn' has a wrong offset!");
static_assert(offsetof(RC22_PhyConstrConfig, LinearLimit) == 0x00001C, "Member 'RC22_PhyConstrConfig::LinearLimit' has a wrong offset!");
static_assert(offsetof(RC22_PhyConstrConfig, LinearDrive) == 0x000020, "Member 'RC22_PhyConstrConfig::LinearDrive' has a wrong offset!");

// Function RopeCutting.RC22.SetSplMLocTang
// 0x0018 (0x0018 - 0x0000)
struct RC22_SetSplMLocTang final
{
public:
	class USplineComponent*                       ITargetSpline;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USplineMeshComponent*                   InTargetSplM;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IEditPoint;                                        // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UnitLengthSSMLTIn;                                 // 0x0014(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RC22_SetSplMLocTang) == 0x000008, "Wrong alignment on RC22_SetSplMLocTang");
static_assert(sizeof(RC22_SetSplMLocTang) == 0x000018, "Wrong size on RC22_SetSplMLocTang");
static_assert(offsetof(RC22_SetSplMLocTang, ITargetSpline) == 0x000000, "Member 'RC22_SetSplMLocTang::ITargetSpline' has a wrong offset!");
static_assert(offsetof(RC22_SetSplMLocTang, InTargetSplM) == 0x000008, "Member 'RC22_SetSplMLocTang::InTargetSplM' has a wrong offset!");
static_assert(offsetof(RC22_SetSplMLocTang, IEditPoint) == 0x000010, "Member 'RC22_SetSplMLocTang::IEditPoint' has a wrong offset!");
static_assert(offsetof(RC22_SetSplMLocTang, UnitLengthSSMLTIn) == 0x000014, "Member 'RC22_SetSplMLocTang::UnitLengthSSMLTIn' has a wrong offset!");

// Function RopeCutting.RC22.SplineUpDir
// 0x0010 (0x0010 - 0x0000)
struct RC22_SplineUpDir final
{
public:
	class USplineComponent*                       ITargetSpline;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ISplineUpDirClamp;                                 // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1988[0x4];                                     // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RC22_SplineUpDir) == 0x000008, "Wrong alignment on RC22_SplineUpDir");
static_assert(sizeof(RC22_SplineUpDir) == 0x000010, "Wrong size on RC22_SplineUpDir");
static_assert(offsetof(RC22_SplineUpDir, ITargetSpline) == 0x000000, "Member 'RC22_SplineUpDir::ITargetSpline' has a wrong offset!");
static_assert(offsetof(RC22_SplineUpDir, ISplineUpDirClamp) == 0x000008, "Member 'RC22_SplineUpDir::ISplineUpDirClamp' has a wrong offset!");

// Function RopeCutting.RC22.TransferSphereCollision
// 0x0018 (0x0018 - 0x0000)
struct RC22_TransferSphereCollision final
{
public:
	class USphereComponent*                       SphereCollisionArrayTSCIn;                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USplineComponent*                       TargetSplineTSCIn;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EditPoint;                                         // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1989[0x4];                                     // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RC22_TransferSphereCollision) == 0x000008, "Wrong alignment on RC22_TransferSphereCollision");
static_assert(sizeof(RC22_TransferSphereCollision) == 0x000018, "Wrong size on RC22_TransferSphereCollision");
static_assert(offsetof(RC22_TransferSphereCollision, SphereCollisionArrayTSCIn) == 0x000000, "Member 'RC22_TransferSphereCollision::SphereCollisionArrayTSCIn' has a wrong offset!");
static_assert(offsetof(RC22_TransferSphereCollision, TargetSplineTSCIn) == 0x000008, "Member 'RC22_TransferSphereCollision::TargetSplineTSCIn' has a wrong offset!");
static_assert(offsetof(RC22_TransferSphereCollision, EditPoint) == 0x000010, "Member 'RC22_TransferSphereCollision::EditPoint' has a wrong offset!");

// Function RopeCutting.RC22.TransferSplineMeshes
// 0x0018 (0x0018 - 0x0000)
struct RC22_TransferSplineMeshes final
{
public:
	class USplineMeshComponent*                   SplMeshArrayTSMIn;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USplineComponent*                       TargetSplineTSMIn;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UnitLengthTSMIn;                                   // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IEditPoint;                                        // 0x0014(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RC22_TransferSplineMeshes) == 0x000008, "Wrong alignment on RC22_TransferSplineMeshes");
static_assert(sizeof(RC22_TransferSplineMeshes) == 0x000018, "Wrong size on RC22_TransferSplineMeshes");
static_assert(offsetof(RC22_TransferSplineMeshes, SplMeshArrayTSMIn) == 0x000000, "Member 'RC22_TransferSplineMeshes::SplMeshArrayTSMIn' has a wrong offset!");
static_assert(offsetof(RC22_TransferSplineMeshes, TargetSplineTSMIn) == 0x000008, "Member 'RC22_TransferSplineMeshes::TargetSplineTSMIn' has a wrong offset!");
static_assert(offsetof(RC22_TransferSplineMeshes, UnitLengthTSMIn) == 0x000010, "Member 'RC22_TransferSplineMeshes::UnitLengthTSMIn' has a wrong offset!");
static_assert(offsetof(RC22_TransferSplineMeshes, IEditPoint) == 0x000014, "Member 'RC22_TransferSplineMeshes::IEditPoint' has a wrong offset!");

// Function RopeCutting.RC22.AttachRopeEnd_RC
// 0x0018 (0x0018 - 0x0000)
struct RC22_AttachRopeEnd_RC final
{
public:
	class UPrimitiveComponent*                    MeshToAttach;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SocketName;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RC22_AttachRopeEnd_RC) == 0x000008, "Wrong alignment on RC22_AttachRopeEnd_RC");
static_assert(sizeof(RC22_AttachRopeEnd_RC) == 0x000018, "Wrong size on RC22_AttachRopeEnd_RC");
static_assert(offsetof(RC22_AttachRopeEnd_RC, MeshToAttach) == 0x000000, "Member 'RC22_AttachRopeEnd_RC::MeshToAttach' has a wrong offset!");
static_assert(offsetof(RC22_AttachRopeEnd_RC, SocketName) == 0x000008, "Member 'RC22_AttachRopeEnd_RC::SocketName' has a wrong offset!");
static_assert(offsetof(RC22_AttachRopeEnd_RC, BoneName) == 0x000010, "Member 'RC22_AttachRopeEnd_RC::BoneName' has a wrong offset!");

// Function RopeCutting.RC22.AttachRopeStart_RC
// 0x0018 (0x0018 - 0x0000)
struct RC22_AttachRopeStart_RC final
{
public:
	class UPrimitiveComponent*                    MeshToAttach;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SocketName;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RC22_AttachRopeStart_RC) == 0x000008, "Wrong alignment on RC22_AttachRopeStart_RC");
static_assert(sizeof(RC22_AttachRopeStart_RC) == 0x000018, "Wrong size on RC22_AttachRopeStart_RC");
static_assert(offsetof(RC22_AttachRopeStart_RC, MeshToAttach) == 0x000000, "Member 'RC22_AttachRopeStart_RC::MeshToAttach' has a wrong offset!");
static_assert(offsetof(RC22_AttachRopeStart_RC, SocketName) == 0x000008, "Member 'RC22_AttachRopeStart_RC::SocketName' has a wrong offset!");
static_assert(offsetof(RC22_AttachRopeStart_RC, BoneName) == 0x000010, "Member 'RC22_AttachRopeStart_RC::BoneName' has a wrong offset!");

// Function RopeCutting.RC22.CreateUniqueName
// 0x0020 (0x0020 - 0x0000)
struct RC22_CreateUniqueName final
{
public:
	class FString                                 ComponentType;                                     // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ComponentNumber;                                   // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0014(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_198A[0x4];                                     // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RC22_CreateUniqueName) == 0x000008, "Wrong alignment on RC22_CreateUniqueName");
static_assert(sizeof(RC22_CreateUniqueName) == 0x000020, "Wrong size on RC22_CreateUniqueName");
static_assert(offsetof(RC22_CreateUniqueName, ComponentType) == 0x000000, "Member 'RC22_CreateUniqueName::ComponentType' has a wrong offset!");
static_assert(offsetof(RC22_CreateUniqueName, ComponentNumber) == 0x000010, "Member 'RC22_CreateUniqueName::ComponentNumber' has a wrong offset!");
static_assert(offsetof(RC22_CreateUniqueName, ReturnValue) == 0x000014, "Member 'RC22_CreateUniqueName::ReturnValue' has a wrong offset!");

// Function RopeCutting.RC22.CutRopeUsingCollision_RC
// 0x0008 (0x0008 - 0x0000)
struct RC22_CutRopeUsingCollision_RC final
{
public:
	class USphereComponent*                       ChosenCollisionSphere;                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RC22_CutRopeUsingCollision_RC) == 0x000008, "Wrong alignment on RC22_CutRopeUsingCollision_RC");
static_assert(sizeof(RC22_CutRopeUsingCollision_RC) == 0x000008, "Wrong size on RC22_CutRopeUsingCollision_RC");
static_assert(offsetof(RC22_CutRopeUsingCollision_RC, ChosenCollisionSphere) == 0x000000, "Member 'RC22_CutRopeUsingCollision_RC::ChosenCollisionSphere' has a wrong offset!");

// Function RopeCutting.RC22.CutRopeUsingNumber_RC
// 0x0004 (0x0004 - 0x0000)
struct RC22_CutRopeUsingNumber_RC final
{
public:
	int32                                         ChosenPosition;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RC22_CutRopeUsingNumber_RC) == 0x000004, "Wrong alignment on RC22_CutRopeUsingNumber_RC");
static_assert(sizeof(RC22_CutRopeUsingNumber_RC) == 0x000004, "Wrong size on RC22_CutRopeUsingNumber_RC");
static_assert(offsetof(RC22_CutRopeUsingNumber_RC, ChosenPosition) == 0x000000, "Member 'RC22_CutRopeUsingNumber_RC::ChosenPosition' has a wrong offset!");

// Function RopeCutting.RC22.GetCollisionArray_RC
// 0x0010 (0x0010 - 0x0000)
struct RC22_GetCollisionArray_RC final
{
public:
	TArray<class USphereComponent*>               ReturnValue;                                       // 0x0000(0x0010)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(RC22_GetCollisionArray_RC) == 0x000008, "Wrong alignment on RC22_GetCollisionArray_RC");
static_assert(sizeof(RC22_GetCollisionArray_RC) == 0x000010, "Wrong size on RC22_GetCollisionArray_RC");
static_assert(offsetof(RC22_GetCollisionArray_RC, ReturnValue) == 0x000000, "Member 'RC22_GetCollisionArray_RC::ReturnValue' has a wrong offset!");

// Function RopeCutting.RC22.GetEndAnchorConstraint_RC
// 0x0008 (0x0008 - 0x0000)
struct RC22_GetEndAnchorConstraint_RC final
{
public:
	class UPhysicsConstraintComponent*            ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RC22_GetEndAnchorConstraint_RC) == 0x000008, "Wrong alignment on RC22_GetEndAnchorConstraint_RC");
static_assert(sizeof(RC22_GetEndAnchorConstraint_RC) == 0x000008, "Wrong size on RC22_GetEndAnchorConstraint_RC");
static_assert(offsetof(RC22_GetEndAnchorConstraint_RC, ReturnValue) == 0x000000, "Member 'RC22_GetEndAnchorConstraint_RC::ReturnValue' has a wrong offset!");

// Function RopeCutting.RC22.GetFirstCollisionSphere_RC
// 0x0008 (0x0008 - 0x0000)
struct RC22_GetFirstCollisionSphere_RC final
{
public:
	class USphereComponent*                       ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RC22_GetFirstCollisionSphere_RC) == 0x000008, "Wrong alignment on RC22_GetFirstCollisionSphere_RC");
static_assert(sizeof(RC22_GetFirstCollisionSphere_RC) == 0x000008, "Wrong size on RC22_GetFirstCollisionSphere_RC");
static_assert(offsetof(RC22_GetFirstCollisionSphere_RC, ReturnValue) == 0x000000, "Member 'RC22_GetFirstCollisionSphere_RC::ReturnValue' has a wrong offset!");

// Function RopeCutting.RC22.GetLastCollisionSphere_RC
// 0x0008 (0x0008 - 0x0000)
struct RC22_GetLastCollisionSphere_RC final
{
public:
	class USphereComponent*                       ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RC22_GetLastCollisionSphere_RC) == 0x000008, "Wrong alignment on RC22_GetLastCollisionSphere_RC");
static_assert(sizeof(RC22_GetLastCollisionSphere_RC) == 0x000008, "Wrong size on RC22_GetLastCollisionSphere_RC");
static_assert(offsetof(RC22_GetLastCollisionSphere_RC, ReturnValue) == 0x000000, "Member 'RC22_GetLastCollisionSphere_RC::ReturnValue' has a wrong offset!");

// Function RopeCutting.RC22.GetPhysicsConstraintArray_RC
// 0x0010 (0x0010 - 0x0000)
struct RC22_GetPhysicsConstraintArray_RC final
{
public:
	TArray<class UPhysicsConstraintComponent*>    ReturnValue;                                       // 0x0000(0x0010)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(RC22_GetPhysicsConstraintArray_RC) == 0x000008, "Wrong alignment on RC22_GetPhysicsConstraintArray_RC");
static_assert(sizeof(RC22_GetPhysicsConstraintArray_RC) == 0x000010, "Wrong size on RC22_GetPhysicsConstraintArray_RC");
static_assert(offsetof(RC22_GetPhysicsConstraintArray_RC, ReturnValue) == 0x000000, "Member 'RC22_GetPhysicsConstraintArray_RC::ReturnValue' has a wrong offset!");

// Function RopeCutting.RC22.GetSplineComponent_RC
// 0x0008 (0x0008 - 0x0000)
struct RC22_GetSplineComponent_RC final
{
public:
	class USplineComponent*                       ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RC22_GetSplineComponent_RC) == 0x000008, "Wrong alignment on RC22_GetSplineComponent_RC");
static_assert(sizeof(RC22_GetSplineComponent_RC) == 0x000008, "Wrong size on RC22_GetSplineComponent_RC");
static_assert(offsetof(RC22_GetSplineComponent_RC, ReturnValue) == 0x000000, "Member 'RC22_GetSplineComponent_RC::ReturnValue' has a wrong offset!");

// Function RopeCutting.RC22.GetSplineMeshArray_RC
// 0x0010 (0x0010 - 0x0000)
struct RC22_GetSplineMeshArray_RC final
{
public:
	TArray<class USplineMeshComponent*>           ReturnValue;                                       // 0x0000(0x0010)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(RC22_GetSplineMeshArray_RC) == 0x000008, "Wrong alignment on RC22_GetSplineMeshArray_RC");
static_assert(sizeof(RC22_GetSplineMeshArray_RC) == 0x000010, "Wrong size on RC22_GetSplineMeshArray_RC");
static_assert(offsetof(RC22_GetSplineMeshArray_RC, ReturnValue) == 0x000000, "Member 'RC22_GetSplineMeshArray_RC::ReturnValue' has a wrong offset!");

// Function RopeCutting.RC22.GetStartAnchorConstraint_RC
// 0x0008 (0x0008 - 0x0000)
struct RC22_GetStartAnchorConstraint_RC final
{
public:
	class UPhysicsConstraintComponent*            ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RC22_GetStartAnchorConstraint_RC) == 0x000008, "Wrong alignment on RC22_GetStartAnchorConstraint_RC");
static_assert(sizeof(RC22_GetStartAnchorConstraint_RC) == 0x000008, "Wrong size on RC22_GetStartAnchorConstraint_RC");
static_assert(offsetof(RC22_GetStartAnchorConstraint_RC, ReturnValue) == 0x000000, "Member 'RC22_GetStartAnchorConstraint_RC::ReturnValue' has a wrong offset!");

// Function RopeCutting.RC22.GrowRope_RC
// 0x0004 (0x0004 - 0x0000)
struct RC22_GrowRope_RC final
{
public:
	float                                         RateOfAddition;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RC22_GrowRope_RC) == 0x000004, "Wrong alignment on RC22_GrowRope_RC");
static_assert(sizeof(RC22_GrowRope_RC) == 0x000004, "Wrong size on RC22_GrowRope_RC");
static_assert(offsetof(RC22_GrowRope_RC, RateOfAddition) == 0x000000, "Member 'RC22_GrowRope_RC::RateOfAddition' has a wrong offset!");

// Function RopeCutting.RC22.ImmobiliseEnd_RC
// 0x0001 (0x0001 - 0x0000)
struct RC22_ImmobiliseEnd_RC final
{
public:
	bool                                          FurtherImmobiliseRopeEnd;                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RC22_ImmobiliseEnd_RC) == 0x000001, "Wrong alignment on RC22_ImmobiliseEnd_RC");
static_assert(sizeof(RC22_ImmobiliseEnd_RC) == 0x000001, "Wrong size on RC22_ImmobiliseEnd_RC");
static_assert(offsetof(RC22_ImmobiliseEnd_RC, FurtherImmobiliseRopeEnd) == 0x000000, "Member 'RC22_ImmobiliseEnd_RC::FurtherImmobiliseRopeEnd' has a wrong offset!");

// Function RopeCutting.RC22.ImmobiliseStart_RC
// 0x0001 (0x0001 - 0x0000)
struct RC22_ImmobiliseStart_RC final
{
public:
	bool                                          FurtherImmobiliseRopeStart;                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RC22_ImmobiliseStart_RC) == 0x000001, "Wrong alignment on RC22_ImmobiliseStart_RC");
static_assert(sizeof(RC22_ImmobiliseStart_RC) == 0x000001, "Wrong size on RC22_ImmobiliseStart_RC");
static_assert(offsetof(RC22_ImmobiliseStart_RC, FurtherImmobiliseRopeStart) == 0x000000, "Member 'RC22_ImmobiliseStart_RC::FurtherImmobiliseRopeStart' has a wrong offset!");

// Function RopeCutting.RC22.MoveEndOfRope_RC
// 0x0020 (0x0020 - 0x0000)
struct RC22_MoveEndOfRope_RC final
{
public:
	struct FVector                                MoveToLocation;                                    // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DurationOfMove;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AllowStartRotationAttached;                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AllowStartRotationImmobilised;                     // 0x001D(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_198B[0x2];                                     // 0x001E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RC22_MoveEndOfRope_RC) == 0x000008, "Wrong alignment on RC22_MoveEndOfRope_RC");
static_assert(sizeof(RC22_MoveEndOfRope_RC) == 0x000020, "Wrong size on RC22_MoveEndOfRope_RC");
static_assert(offsetof(RC22_MoveEndOfRope_RC, MoveToLocation) == 0x000000, "Member 'RC22_MoveEndOfRope_RC::MoveToLocation' has a wrong offset!");
static_assert(offsetof(RC22_MoveEndOfRope_RC, DurationOfMove) == 0x000018, "Member 'RC22_MoveEndOfRope_RC::DurationOfMove' has a wrong offset!");
static_assert(offsetof(RC22_MoveEndOfRope_RC, AllowStartRotationAttached) == 0x00001C, "Member 'RC22_MoveEndOfRope_RC::AllowStartRotationAttached' has a wrong offset!");
