#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SettingPopup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ESettingLevel_structs.hpp"
#include "Slate_structs.hpp"
#include "WBP_WidgetBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SettingPopup.SettingPopup_C
// 0x00E8 (0x0360 - 0x0278)
class USettingPopup_C : public UWBP_WidgetBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       StartAnimation;                                    // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_0;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ButtonsCanvas;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_1;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClickableText_C*                       ClickableText;                                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClickableText_C*                       HighButton;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClickableText_C*                       LowButton;                                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClickableText_C*                       LowestButton;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClickableText_C*                       MediumButton;                                      // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClickableText_C*                       UltraButton;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        Offset;                                            // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          WidgetIsActual;                                    // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESettingLevel                                 ReturnedLevel;                                     // 0x02D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2968[0x6];                                     // 0x02DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             ReturnLevel;                                       // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FAnchors                               ButtonsNormalizedPosition;                         // 0x02F0(0x0020)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn)
	class FText                                   SettingName;                                       // 0x0310(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   Setting_Name;                                      // 0x0328(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	ESettingLevel                                 StartLevel;                                        // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	ESettingLevel                                 CursorCurrentSelection;                            // 0x0341(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2969[0x6];                                     // 0x0342(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        XOffset;                                           // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          XOffsetByDesiredSize;                              // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_296A[0x7];                                     // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DesiredSizeMult;                                   // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void ReturnLevel__DelegateSignature(class USettingPopup_C* Widget, ESettingLevel Level);
	void ExecuteUbergraph_SettingPopup(int32 EntryPoint);
	void Dead();
	void Construct();
	void CalculateCurretnSelection();
	void BndEvt__SettingPopup_UltraButton_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature(class UClickableText_C* Text);
	void BndEvt__SettingPopup_MediumButton_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature(class UClickableText_C* Text);
	void BndEvt__SettingPopup_LowestButton_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature(class UClickableText_C* Text);
	void BndEvt__SettingPopup_LowButton_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature(class UClickableText_C* Text);
	void BndEvt__SettingPopup_HighButton_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature(class UClickableText_C* Text);
	void BndEvt__SettingPopup_Button_0_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SettingPopup_C">();
	}
	static class USettingPopup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USettingPopup_C>();
	}
};
static_assert(alignof(USettingPopup_C) == 0x000008, "Wrong alignment on USettingPopup_C");
static_assert(sizeof(USettingPopup_C) == 0x000360, "Wrong size on USettingPopup_C");
static_assert(offsetof(USettingPopup_C, UberGraphFrame) == 0x000278, "Member 'USettingPopup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USettingPopup_C, StartAnimation) == 0x000280, "Member 'USettingPopup_C::StartAnimation' has a wrong offset!");
static_assert(offsetof(USettingPopup_C, Button_0) == 0x000288, "Member 'USettingPopup_C::Button_0' has a wrong offset!");
static_assert(offsetof(USettingPopup_C, ButtonsCanvas) == 0x000290, "Member 'USettingPopup_C::ButtonsCanvas' has a wrong offset!");
static_assert(offsetof(USettingPopup_C, CanvasPanel_1) == 0x000298, "Member 'USettingPopup_C::CanvasPanel_1' has a wrong offset!");
static_assert(offsetof(USettingPopup_C, ClickableText) == 0x0002A0, "Member 'USettingPopup_C::ClickableText' has a wrong offset!");
static_assert(offsetof(USettingPopup_C, HighButton) == 0x0002A8, "Member 'USettingPopup_C::HighButton' has a wrong offset!");
static_assert(offsetof(USettingPopup_C, LowButton) == 0x0002B0, "Member 'USettingPopup_C::LowButton' has a wrong offset!");
static_assert(offsetof(USettingPopup_C, LowestButton) == 0x0002B8, "Member 'USettingPopup_C::LowestButton' has a wrong offset!");
static_assert(offsetof(USettingPopup_C, MediumButton) == 0x0002C0, "Member 'USettingPopup_C::MediumButton' has a wrong offset!");
static_assert(offsetof(USettingPopup_C, UltraButton) == 0x0002C8, "Member 'USettingPopup_C::UltraButton' has a wrong offset!");
static_assert(offsetof(USettingPopup_C, Offset) == 0x0002D0, "Member 'USettingPopup_C::Offset' has a wrong offset!");
static_assert(offsetof(USettingPopup_C, WidgetIsActual) == 0x0002D8, "Member 'USettingPopup_C::WidgetIsActual' has a wrong offset!");
static_assert(offsetof(USettingPopup_C, ReturnedLevel) == 0x0002D9, "Member 'USettingPopup_C::ReturnedLevel' has a wrong offset!");
static_assert(offsetof(USettingPopup_C, ReturnLevel) == 0x0002E0, "Member 'USettingPopup_C::ReturnLevel' has a wrong offset!");
static_assert(offsetof(USettingPopup_C, ButtonsNormalizedPosition) == 0x0002F0, "Member 'USettingPopup_C::ButtonsNormalizedPosition' has a wrong offset!");
static_assert(offsetof(USettingPopup_C, SettingName) == 0x000310, "Member 'USettingPopup_C::SettingName' has a wrong offset!");
static_assert(offsetof(USettingPopup_C, Setting_Name) == 0x000328, "Member 'USettingPopup_C::Setting_Name' has a wrong offset!");
static_assert(offsetof(USettingPopup_C, StartLevel) == 0x000340, "Member 'USettingPopup_C::StartLevel' has a wrong offset!");
static_assert(offsetof(USettingPopup_C, CursorCurrentSelection) == 0x000341, "Member 'USettingPopup_C::CursorCurrentSelection' has a wrong offset!");
static_assert(offsetof(USettingPopup_C, XOffset) == 0x000348, "Member 'USettingPopup_C::XOffset' has a wrong offset!");
static_assert(offsetof(USettingPopup_C, XOffsetByDesiredSize) == 0x000350, "Member 'USettingPopup_C::XOffsetByDesiredSize' has a wrong offset!");
static_assert(offsetof(USettingPopup_C, DesiredSizeMult) == 0x000358, "Member 'USettingPopup_C::DesiredSizeMult' has a wrong offset!");

}

