#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SettingPopup

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ESettingLevel_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SettingPopup.SettingPopup_C.Tick
// 0x0048 (0x0048 - 0x0000)
struct SettingPopup_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingPopup_C_Tick) == 0x000008, "Wrong alignment on SettingPopup_C_Tick");
static_assert(sizeof(SettingPopup_C_Tick) == 0x000048, "Wrong size on SettingPopup_C_Tick");
static_assert(offsetof(SettingPopup_C_Tick, MyGeometry) == 0x000000, "Member 'SettingPopup_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_Tick, InDeltaTime) == 0x000040, "Member 'SettingPopup_C_Tick::InDeltaTime' has a wrong offset!");

// Function SettingPopup.SettingPopup_C.ReturnLevel__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct SettingPopup_C_ReturnLevel__DelegateSignature final
{
public:
	class USettingPopup_C*                        Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESettingLevel                                 Level;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingPopup_C_ReturnLevel__DelegateSignature) == 0x000008, "Wrong alignment on SettingPopup_C_ReturnLevel__DelegateSignature");
static_assert(sizeof(SettingPopup_C_ReturnLevel__DelegateSignature) == 0x000010, "Wrong size on SettingPopup_C_ReturnLevel__DelegateSignature");
static_assert(offsetof(SettingPopup_C_ReturnLevel__DelegateSignature, Widget) == 0x000000, "Member 'SettingPopup_C_ReturnLevel__DelegateSignature::Widget' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ReturnLevel__DelegateSignature, Level) == 0x000008, "Member 'SettingPopup_C_ReturnLevel__DelegateSignature::Level' has a wrong offset!");

// Function SettingPopup.SettingPopup_C.ExecuteUbergraph_SettingPopup
// 0x02E8 (0x02E8 - 0x0000)
struct SettingPopup_C_ExecuteUbergraph_SettingPopup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESettingLevel                                 Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_296B[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_296C[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0020(0x0040)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_296D[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0068(0x0010)(ReferenceParm, ContainsInstancedReference)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_296E[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_296F[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2970[0x4];                                     // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_FloatToDouble_ReturnValue;           // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClickableText_C*                       K2Node_ComponentBoundEvent_Text_4;                 // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClickableText_C*                       K2Node_ComponentBoundEvent_Text_3;                 // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClickableText_C*                       K2Node_ComponentBoundEvent_Text_2;                 // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UClickableText_C*                       K2Node_ComponentBoundEvent_Text_1;                 // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UClickableText_C*                       K2Node_ComponentBoundEvent_Text;                   // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0158(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01A8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01B8(0x0018)()
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelWidget*                           CallFunc_GetParent_ReturnValue;                    // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_2;           // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2971[0x7];                                     // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetPosition_ReturnValue_1;                // 0x01F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_2;                        // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_2;                        // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_3;           // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue_1;             // 0x0218(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_3;                        // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_3;                        // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default;                             // 0x0240(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue_2;             // 0x0248(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_4;                        // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_4;                        // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0270(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_4;           // 0x0290(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue_2;                // 0x0298(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_5;                        // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_5;                        // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue_1;                  // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue_2;                  // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x02D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingPopup_C_ExecuteUbergraph_SettingPopup) == 0x000008, "Wrong alignment on SettingPopup_C_ExecuteUbergraph_SettingPopup");
static_assert(sizeof(SettingPopup_C_ExecuteUbergraph_SettingPopup) == 0x0002E8, "Wrong size on SettingPopup_C_ExecuteUbergraph_SettingPopup");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, EntryPoint) == 0x000000, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::EntryPoint' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, Temp_byte_Variable) == 0x000004, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, Temp_int_Array_Index_Variable) == 0x000008, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000010, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, Temp_bool_IsClosed_Variable) == 0x000018, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, Temp_bool_Has_Been_Initd_Variable) == 0x000019, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, K2Node_Event_MyGeometry) == 0x000020, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, K2Node_Event_InDeltaTime) == 0x000060, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_GetAllChildren_ReturnValue) == 0x000068, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000078, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_Array_Get_Item) == 0x000080, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000090, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_Less_IntInt_ReturnValue) == 0x000098, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_GetDesiredSize_ReturnValue) == 0x0000A0, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_GetDesiredSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_BreakVector2D_X) == 0x0000B0, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_BreakVector2D_Y) == 0x0000B8, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x0000C0, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000C8, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_GetPosition_ReturnValue) == 0x0000D0, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0000E0, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_BreakVector2D_X_1) == 0x0000E8, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_BreakVector2D_Y_1) == 0x0000F0, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x0000F8, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_Conv_FloatToDouble_ReturnValue) == 0x000100, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_Conv_FloatToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000108, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, K2Node_ComponentBoundEvent_Text_4) == 0x000110, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::K2Node_ComponentBoundEvent_Text_4' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000118, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, K2Node_ComponentBoundEvent_Text_3) == 0x000120, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::K2Node_ComponentBoundEvent_Text_3' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_FInterpTo_ReturnValue) == 0x000128, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, K2Node_ComponentBoundEvent_Text_2) == 0x000130, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::K2Node_ComponentBoundEvent_Text_2' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, K2Node_ComponentBoundEvent_Text_1) == 0x000138, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::K2Node_ComponentBoundEvent_Text_1' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, K2Node_ComponentBoundEvent_Text) == 0x000140, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_PlayAnimationForward_ReturnValue) == 0x000148, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000150, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, K2Node_MakeStruct_FormatArgumentData) == 0x000158, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, K2Node_MakeArray_Array) == 0x0001A8, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_Format_ReturnValue) == 0x0001B8, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x0001D0, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_GetParent_ReturnValue) == 0x0001D8, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_GetParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_SlotAsCanvasSlot_ReturnValue_2) == 0x0001E0, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_SlotAsCanvasSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_IsValid_ReturnValue) == 0x0001E8, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_GetPosition_ReturnValue_1) == 0x0001F0, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_GetPosition_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_BreakVector2D_X_2) == 0x000200, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_BreakVector2D_Y_2) == 0x000208, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_SlotAsCanvasSlot_ReturnValue_3) == 0x000210, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_SlotAsCanvasSlot_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_GetDesiredSize_ReturnValue_1) == 0x000218, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_GetDesiredSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_BreakVector2D_X_3) == 0x000228, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_BreakVector2D_X_3' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_BreakVector2D_Y_3) == 0x000230, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_BreakVector2D_Y_3' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000238, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, K2Node_Select_Default) == 0x000240, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_GetDesiredSize_ReturnValue_2) == 0x000248, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_GetDesiredSize_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_SelectFloat_ReturnValue) == 0x000258, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_BreakVector2D_X_4) == 0x000260, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_BreakVector2D_X_4' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_BreakVector2D_Y_4) == 0x000268, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_BreakVector2D_Y_4' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_MakeVector2D_ReturnValue) == 0x000270, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000280, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000288, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_SlotAsCanvasSlot_ReturnValue_4) == 0x000290, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_SlotAsCanvasSlot_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_GetPosition_ReturnValue_2) == 0x000298, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_GetPosition_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_BreakVector2D_X_5) == 0x0002A8, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_BreakVector2D_X_5' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_BreakVector2D_Y_5) == 0x0002B0, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_BreakVector2D_Y_5' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0002B8, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_FInterpTo_ReturnValue_1) == 0x0002C0, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_FInterpTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_FInterpTo_ReturnValue_2) == 0x0002C8, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_FInterpTo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_MakeVector2D_ReturnValue_1) == 0x0002D0, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_ExecuteUbergraph_SettingPopup, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0002E0, "Member 'SettingPopup_C_ExecuteUbergraph_SettingPopup::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function SettingPopup.SettingPopup_C.CalculateCurretnSelection
// 0x0005 (0x0005 - 0x0000)
struct SettingPopup_C_CalculateCurretnSelection final
{
public:
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue_1;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue_2;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue_3;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue_4;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingPopup_C_CalculateCurretnSelection) == 0x000001, "Wrong alignment on SettingPopup_C_CalculateCurretnSelection");
static_assert(sizeof(SettingPopup_C_CalculateCurretnSelection) == 0x000005, "Wrong size on SettingPopup_C_CalculateCurretnSelection");
static_assert(offsetof(SettingPopup_C_CalculateCurretnSelection, CallFunc_IsHovered_ReturnValue) == 0x000000, "Member 'SettingPopup_C_CalculateCurretnSelection::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_CalculateCurretnSelection, CallFunc_IsHovered_ReturnValue_1) == 0x000001, "Member 'SettingPopup_C_CalculateCurretnSelection::CallFunc_IsHovered_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_CalculateCurretnSelection, CallFunc_IsHovered_ReturnValue_2) == 0x000002, "Member 'SettingPopup_C_CalculateCurretnSelection::CallFunc_IsHovered_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_CalculateCurretnSelection, CallFunc_IsHovered_ReturnValue_3) == 0x000003, "Member 'SettingPopup_C_CalculateCurretnSelection::CallFunc_IsHovered_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SettingPopup_C_CalculateCurretnSelection, CallFunc_IsHovered_ReturnValue_4) == 0x000004, "Member 'SettingPopup_C_CalculateCurretnSelection::CallFunc_IsHovered_ReturnValue_4' has a wrong offset!");

// Function SettingPopup.SettingPopup_C.BndEvt__SettingPopup_UltraButton_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SettingPopup_C_BndEvt__SettingPopup_UltraButton_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature final
{
public:
	class UClickableText_C*                       Text;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingPopup_C_BndEvt__SettingPopup_UltraButton_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature) == 0x000008, "Wrong alignment on SettingPopup_C_BndEvt__SettingPopup_UltraButton_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature");
static_assert(sizeof(SettingPopup_C_BndEvt__SettingPopup_UltraButton_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature) == 0x000008, "Wrong size on SettingPopup_C_BndEvt__SettingPopup_UltraButton_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature");
static_assert(offsetof(SettingPopup_C_BndEvt__SettingPopup_UltraButton_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature, Text) == 0x000000, "Member 'SettingPopup_C_BndEvt__SettingPopup_UltraButton_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature::Text' has a wrong offset!");

// Function SettingPopup.SettingPopup_C.BndEvt__SettingPopup_MediumButton_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SettingPopup_C_BndEvt__SettingPopup_MediumButton_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature final
{
public:
	class UClickableText_C*                       Text;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingPopup_C_BndEvt__SettingPopup_MediumButton_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature) == 0x000008, "Wrong alignment on SettingPopup_C_BndEvt__SettingPopup_MediumButton_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature");
static_assert(sizeof(SettingPopup_C_BndEvt__SettingPopup_MediumButton_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature) == 0x000008, "Wrong size on SettingPopup_C_BndEvt__SettingPopup_MediumButton_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature");
static_assert(offsetof(SettingPopup_C_BndEvt__SettingPopup_MediumButton_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature, Text) == 0x000000, "Member 'SettingPopup_C_BndEvt__SettingPopup_MediumButton_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature::Text' has a wrong offset!");

// Function SettingPopup.SettingPopup_C.BndEvt__SettingPopup_LowestButton_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SettingPopup_C_BndEvt__SettingPopup_LowestButton_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature final
{
public:
	class UClickableText_C*                       Text;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingPopup_C_BndEvt__SettingPopup_LowestButton_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature) == 0x000008, "Wrong alignment on SettingPopup_C_BndEvt__SettingPopup_LowestButton_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature");
static_assert(sizeof(SettingPopup_C_BndEvt__SettingPopup_LowestButton_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature) == 0x000008, "Wrong size on SettingPopup_C_BndEvt__SettingPopup_LowestButton_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature");
static_assert(offsetof(SettingPopup_C_BndEvt__SettingPopup_LowestButton_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature, Text) == 0x000000, "Member 'SettingPopup_C_BndEvt__SettingPopup_LowestButton_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature::Text' has a wrong offset!");

// Function SettingPopup.SettingPopup_C.BndEvt__SettingPopup_LowButton_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SettingPopup_C_BndEvt__SettingPopup_LowButton_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature final
{
public:
	class UClickableText_C*                       Text;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingPopup_C_BndEvt__SettingPopup_LowButton_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature) == 0x000008, "Wrong alignment on SettingPopup_C_BndEvt__SettingPopup_LowButton_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature");
static_assert(sizeof(SettingPopup_C_BndEvt__SettingPopup_LowButton_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature) == 0x000008, "Wrong size on SettingPopup_C_BndEvt__SettingPopup_LowButton_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature");
static_assert(offsetof(SettingPopup_C_BndEvt__SettingPopup_LowButton_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature, Text) == 0x000000, "Member 'SettingPopup_C_BndEvt__SettingPopup_LowButton_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature::Text' has a wrong offset!");

// Function SettingPopup.SettingPopup_C.BndEvt__SettingPopup_HighButton_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SettingPopup_C_BndEvt__SettingPopup_HighButton_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature final
{
public:
	class UClickableText_C*                       Text;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingPopup_C_BndEvt__SettingPopup_HighButton_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature) == 0x000008, "Wrong alignment on SettingPopup_C_BndEvt__SettingPopup_HighButton_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature");
static_assert(sizeof(SettingPopup_C_BndEvt__SettingPopup_HighButton_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature) == 0x000008, "Wrong size on SettingPopup_C_BndEvt__SettingPopup_HighButton_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature");
static_assert(offsetof(SettingPopup_C_BndEvt__SettingPopup_HighButton_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature, Text) == 0x000000, "Member 'SettingPopup_C_BndEvt__SettingPopup_HighButton_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature::Text' has a wrong offset!");

}

