#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_Name_Text

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct ST_Name_Text.ST_Name_Text
// 0x0028 (0x0028 - 0x0000)
struct FST_Name_Text final
{
public:
	bool                                          Show_4_2C54C26C4ECDF1E76E7E9484273944CC;           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29E6[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Tag_6_E837FBF5454521EB18C0228001A5C559;            // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29E7[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DisplayName_8_C004B265462F75FF2E347F9C237A6E47;    // 0x0010(0x0018)(Edit, BlueprintVisible)
};
static_assert(alignof(FST_Name_Text) == 0x000008, "Wrong alignment on FST_Name_Text");
static_assert(sizeof(FST_Name_Text) == 0x000028, "Wrong size on FST_Name_Text");
static_assert(offsetof(FST_Name_Text, Show_4_2C54C26C4ECDF1E76E7E9484273944CC) == 0x000000, "Member 'FST_Name_Text::Show_4_2C54C26C4ECDF1E76E7E9484273944CC' has a wrong offset!");
static_assert(offsetof(FST_Name_Text, Tag_6_E837FBF5454521EB18C0228001A5C559) == 0x000004, "Member 'FST_Name_Text::Tag_6_E837FBF5454521EB18C0228001A5C559' has a wrong offset!");
static_assert(offsetof(FST_Name_Text, DisplayName_8_C004B265462F75FF2E347F9C237A6E47) == 0x000010, "Member 'FST_Name_Text::DisplayName_8_C004B265462F75FF2E347F9C237A6E47' has a wrong offset!");

}

