#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UDS_PlayerOcclusion

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UDS_PlayerOcclusion.UDS_PlayerOcclusion_C.Update Target Occlusion Profile
// 0x06A0 (0x06A0 - 0x0000)
struct UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile final
{
public:
	bool                                          Finished;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F16[0x7];                                      // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Actors_to_Ignore;                                  // 0x0008(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Directional_Hits;                                  // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F17[0x4];                                      // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Total_Occlusion;                                   // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Total_Hits;                                        // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F18[0x4];                                      // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<double>                                New_Occlusion_Profile;                             // 0x0030(0x0010)(Edit, BlueprintVisible)
	double                                        Temp_real_Variable;                                // 0x0040(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F19[0x3];                                      // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1A[0x4];                                      // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1B[0x7];                                      // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1C[0x4];                                      // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0098(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Variable_3;                               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1D[0x4];                                      // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1E[0x3];                                      // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_3;           // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1F[0x3];                                      // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F20[0x2];                                      // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_5;                               // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x00E0(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F21[0x4];                                      // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x00F8(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F22[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F23[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F24[0x2];                                      // 0x0132(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F25[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F26[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IUDS_Occlusion_Volume_Interface_C> K2Node_DynamicCast_AsUDS_Occlusion_Volume_Interface; // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_Occlusion_Result_Occluded;            // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F27[0x6];                                      // 0x0162(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F28[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F29[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x01F0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2A[0x3];                                      // 0x02D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2B[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Array_Get_Item_1;                         // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2C[0x3];                                      // 0x0309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2D[0x2];                                      // 0x0312(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_1;            // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_2;            // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2E[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        K2Node_MakeArray_Array_1;                          // 0x0350(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_Array_Get_Item_2;                         // 0x0360(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_8;                 // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2F[0x4];                                      // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x0380(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0398(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x03B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_6;                               // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_3;       // 0x03D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x03E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit_1;                 // 0x0400(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue_1;            // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F30[0x3];                                      // 0x04E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_5;                  // 0x04EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        K2Node_MakeArray_Array_2;                          // 0x04F0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0500(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F31[0x4];                                      // 0x0504(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Array_Get_Item_3;                         // 0x0508(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F32[0x7];                                      // 0x0521(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x0528(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x0540(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_2;                     // 0x0558(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_4;       // 0x0570(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_4;           // 0x0588(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit_2;                 // 0x05A0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue_2;            // 0x0688(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F33[0x3];                                      // 0x0689(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RotateAngleAxis_AngleDeg_ImplicitCast;    // 0x068C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast;       // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast_1;     // 0x0698(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile) == 0x000008, "Wrong alignment on UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile");
static_assert(sizeof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile) == 0x0006A0, "Wrong size on UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, Finished) == 0x000000, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::Finished' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, Actors_to_Ignore) == 0x000008, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::Actors_to_Ignore' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, Directional_Hits) == 0x000018, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::Directional_Hits' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, Total_Occlusion) == 0x000020, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::Total_Occlusion' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, Total_Hits) == 0x000028, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::Total_Hits' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, New_Occlusion_Profile) == 0x000030, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::New_Occlusion_Profile' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, Temp_real_Variable) == 0x000040, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, Temp_int_Variable) == 0x000048, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00004C, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, Temp_int_Variable_1) == 0x000054, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, Temp_int_Variable_2) == 0x000058, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000060, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000068, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000070, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_MakeVector_ReturnValue) == 0x000078, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Add_IntInt_ReturnValue_1) == 0x000090, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, Temp_object_Variable) == 0x000098, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, Temp_int_Variable_3) == 0x0000A8, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x0000B0, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x0000B8, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000BC, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, Temp_int_Loop_Counter_Variable) == 0x0000C0, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000C4, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, Temp_int_Array_Index_Variable) == 0x0000C8, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, Temp_int_Variable_4) == 0x0000CC, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_LessEqual_IntInt_ReturnValue_3) == 0x0000D0, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_LessEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Add_IntInt_ReturnValue_4) == 0x0000D4, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, K2Node_SwitchEnum_CmpSuccess) == 0x0000D8, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Not_PreBool_ReturnValue) == 0x0000D9, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, Temp_int_Variable_5) == 0x0000DC, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, K2Node_MakeArray_Array) == 0x0000E0, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, Temp_int_Loop_Counter_Variable_1) == 0x0000F0, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_SphereOverlapActors_OutActors) == 0x0000F8, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_SphereOverlapActors_ReturnValue) == 0x000108, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Add_IntInt_ReturnValue_5) == 0x00010C, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Array_Length_ReturnValue) == 0x000110, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Less_IntInt_ReturnValue) == 0x000114, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_BreakVector_X) == 0x000118, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_BreakVector_Y) == 0x000120, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_BreakVector_Z) == 0x000128, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, K2Node_SwitchEnum_CmpSuccess_1) == 0x000130, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000131, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, Temp_int_Array_Index_Variable_1) == 0x000134, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_BooleanAND_ReturnValue) == 0x000138, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Array_Get_Item) == 0x000140, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_BooleanOR_ReturnValue) == 0x000148, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, K2Node_DynamicCast_AsUDS_Occlusion_Volume_Interface) == 0x000150, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::K2Node_DynamicCast_AsUDS_Occlusion_Volume_Interface' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, K2Node_DynamicCast_bSuccess) == 0x000160, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Get_Occlusion_Result_Occluded) == 0x000161, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Get_Occlusion_Result_Occluded' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000168, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000170, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Array_Add_ReturnValue) == 0x000178, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000180, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_GetPlayerPawn_ReturnValue) == 0x000198, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Normal_ReturnValue) == 0x0001A0, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_IsValid_ReturnValue) == 0x0001B8, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0001C0, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Add_VectorVector_ReturnValue) == 0x0001D8, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_LineTraceSingle_OutHit) == 0x0001F0, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_LineTraceSingle_ReturnValue) == 0x0002D8, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Array_Add_ReturnValue_1) == 0x0002DC, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_SelectFloat_ReturnValue) == 0x0002E0, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x0002E8, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Lerp_ReturnValue) == 0x0002F0, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Array_Add_ReturnValue_2) == 0x0002F8, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Array_Get_Item_1) == 0x000300, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, Temp_bool_True_if_break_was_hit_Variable) == 0x000308, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Add_IntInt_ReturnValue_6) == 0x00030C, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Add_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Not_PreBool_ReturnValue_1) == 0x000310, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_BooleanAND_ReturnValue_1) == 0x000311, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000314, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_MapRangeClamped_ReturnValue) == 0x000318, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_MapRangeClamped_ReturnValue_1) == 0x000320, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Lerp_ReturnValue_1) == 0x000328, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000330, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Array_Add_ReturnValue_3) == 0x000338, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x00033C, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_MapRangeClamped_ReturnValue_2) == 0x000340, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_MapRangeClamped_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Add_IntInt_ReturnValue_7) == 0x000348, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Add_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, K2Node_MakeArray_Array_1) == 0x000350, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Array_Get_Item_2) == 0x000360, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Add_IntInt_ReturnValue_8) == 0x000378, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Add_IntInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x000380, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000398, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Normal_ReturnValue_1) == 0x0003B0, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, Temp_int_Variable_6) == 0x0003C8, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::Temp_int_Variable_6' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Array_Add_ReturnValue_4) == 0x0003CC, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Array_Add_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Multiply_VectorFloat_ReturnValue_3) == 0x0003D0, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Multiply_VectorFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Add_VectorVector_ReturnValue_2) == 0x0003E8, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_LineTraceSingle_OutHit_1) == 0x000400, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_LineTraceSingle_OutHit_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_LineTraceSingle_ReturnValue_1) == 0x0004E8, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_LineTraceSingle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Array_Add_ReturnValue_5) == 0x0004EC, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Array_Add_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, K2Node_MakeArray_Array_2) == 0x0004F0, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Array_Length_ReturnValue_1) == 0x000500, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Array_Get_Item_3) == 0x000508, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Less_IntInt_ReturnValue_1) == 0x000520, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_RotateAngleAxis_ReturnValue) == 0x000528, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Add_VectorVector_ReturnValue_3) == 0x000540, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Normal_ReturnValue_2) == 0x000558, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Normal_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Multiply_VectorFloat_ReturnValue_4) == 0x000570, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Multiply_VectorFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_Add_VectorVector_ReturnValue_4) == 0x000588, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_Add_VectorVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_LineTraceSingle_OutHit_2) == 0x0005A0, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_LineTraceSingle_OutHit_2' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_LineTraceSingle_ReturnValue_2) == 0x000688, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_LineTraceSingle_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_RotateAngleAxis_AngleDeg_ImplicitCast) == 0x00068C, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_RotateAngleAxis_AngleDeg_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_MapRangeClamped_Value_ImplicitCast) == 0x000690, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_MapRangeClamped_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile, CallFunc_MapRangeClamped_Value_ImplicitCast_1) == 0x000698, "Member 'UDS_PlayerOcclusion_C_Update_Target_Occlusion_Profile::CallFunc_MapRangeClamped_Value_ImplicitCast_1' has a wrong offset!");

// Function UDS_PlayerOcclusion.UDS_PlayerOcclusion_C.Update Current Occlusion Profile
// 0x0080 (0x0080 - 0x0000)
struct UDS_PlayerOcclusion_C_Update_Current_Occlusion_Profile final
{
public:
	double                                        Interp_Speed_Multiplier;                           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F34[0x3];                                      // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F35[0x7];                                      // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Array_Get_Item_1;                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Array_Get_Item_2;                         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F36[0x4];                                      // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UDS_PlayerOcclusion_C_Update_Current_Occlusion_Profile) == 0x000008, "Wrong alignment on UDS_PlayerOcclusion_C_Update_Current_Occlusion_Profile");
static_assert(sizeof(UDS_PlayerOcclusion_C_Update_Current_Occlusion_Profile) == 0x000080, "Wrong size on UDS_PlayerOcclusion_C_Update_Current_Occlusion_Profile");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Current_Occlusion_Profile, Interp_Speed_Multiplier) == 0x000000, "Member 'UDS_PlayerOcclusion_C_Update_Current_Occlusion_Profile::Interp_Speed_Multiplier' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Current_Occlusion_Profile, Temp_int_Array_Index_Variable) == 0x000008, "Member 'UDS_PlayerOcclusion_C_Update_Current_Occlusion_Profile::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Current_Occlusion_Profile, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'UDS_PlayerOcclusion_C_Update_Current_Occlusion_Profile::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Current_Occlusion_Profile, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000010, "Member 'UDS_PlayerOcclusion_C_Update_Current_Occlusion_Profile::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Current_Occlusion_Profile, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'UDS_PlayerOcclusion_C_Update_Current_Occlusion_Profile::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Current_Occlusion_Profile, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'UDS_PlayerOcclusion_C_Update_Current_Occlusion_Profile::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Current_Occlusion_Profile, CallFunc_SelectFloat_ReturnValue) == 0x000020, "Member 'UDS_PlayerOcclusion_C_Update_Current_Occlusion_Profile::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Current_Occlusion_Profile, CallFunc_SelectFloat_ReturnValue_1) == 0x000028, "Member 'UDS_PlayerOcclusion_C_Update_Current_Occlusion_Profile::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Current_Occlusion_Profile, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000030, "Member 'UDS_PlayerOcclusion_C_Update_Current_Occlusion_Profile::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Current_Occlusion_Profile, CallFunc_Array_Get_Item) == 0x000038, "Member 'UDS_PlayerOcclusion_C_Update_Current_Occlusion_Profile::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Current_Occlusion_Profile, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000040, "Member 'UDS_PlayerOcclusion_C_Update_Current_Occlusion_Profile::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Current_Occlusion_Profile, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000048, "Member 'UDS_PlayerOcclusion_C_Update_Current_Occlusion_Profile::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Current_Occlusion_Profile, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000050, "Member 'UDS_PlayerOcclusion_C_Update_Current_Occlusion_Profile::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Current_Occlusion_Profile, CallFunc_Array_Get_Item_1) == 0x000058, "Member 'UDS_PlayerOcclusion_C_Update_Current_Occlusion_Profile::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Current_Occlusion_Profile, CallFunc_Array_Get_Item_2) == 0x000060, "Member 'UDS_PlayerOcclusion_C_Update_Current_Occlusion_Profile::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Current_Occlusion_Profile, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'UDS_PlayerOcclusion_C_Update_Current_Occlusion_Profile::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Update_Current_Occlusion_Profile, CallFunc_FInterpTo_ReturnValue) == 0x000070, "Member 'UDS_PlayerOcclusion_C_Update_Current_Occlusion_Profile::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
