#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Notification

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Notification.WBP_Notification_C.WritingProcess
// 0x0060 (0x0060 - 0x0000)
struct WBP_Notification_C_WritingProcess final
{
public:
	int32                                         NumCharsToDisplay;                                 // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2979[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue_1;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_297A[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0018)()
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Notification_C_WritingProcess) == 0x000008, "Wrong alignment on WBP_Notification_C_WritingProcess");
static_assert(sizeof(WBP_Notification_C_WritingProcess) == 0x000060, "Wrong size on WBP_Notification_C_WritingProcess");
static_assert(offsetof(WBP_Notification_C_WritingProcess, NumCharsToDisplay) == 0x000000, "Member 'WBP_Notification_C_WritingProcess::NumCharsToDisplay' has a wrong offset!");
static_assert(offsetof(WBP_Notification_C_WritingProcess, CallFunc_Len_ReturnValue) == 0x000004, "Member 'WBP_Notification_C_WritingProcess::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Notification_C_WritingProcess, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Notification_C_WritingProcess::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Notification_C_WritingProcess, CallFunc_GetSubstring_ReturnValue) == 0x000010, "Member 'WBP_Notification_C_WritingProcess::CallFunc_GetSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Notification_C_WritingProcess, CallFunc_Len_ReturnValue_1) == 0x000020, "Member 'WBP_Notification_C_WritingProcess::CallFunc_Len_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Notification_C_WritingProcess, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'WBP_Notification_C_WritingProcess::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Notification_C_WritingProcess, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000040, "Member 'WBP_Notification_C_WritingProcess::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Notification_C_WritingProcess, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000048, "Member 'WBP_Notification_C_WritingProcess::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Notification_C_WritingProcess, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000050, "Member 'WBP_Notification_C_WritingProcess::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Notification_C_WritingProcess, CallFunc_FFloor_ReturnValue) == 0x000058, "Member 'WBP_Notification_C_WritingProcess::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Notification_C_WritingProcess, CallFunc_Clamp_ReturnValue) == 0x00005C, "Member 'WBP_Notification_C_WritingProcess::CallFunc_Clamp_ReturnValue' has a wrong offset!");

// Function WBP_Notification.WBP_Notification_C.Write
// 0x0010 (0x0010 - 0x0000)
struct WBP_Notification_C_Write final
{
public:
	class FString                                 Param_Text;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Notification_C_Write) == 0x000008, "Wrong alignment on WBP_Notification_C_Write");
static_assert(sizeof(WBP_Notification_C_Write) == 0x000010, "Wrong size on WBP_Notification_C_Write");
static_assert(offsetof(WBP_Notification_C_Write, Param_Text) == 0x000000, "Member 'WBP_Notification_C_Write::Param_Text' has a wrong offset!");

// Function WBP_Notification.WBP_Notification_C.Tick
// 0x0048 (0x0048 - 0x0000)
struct WBP_Notification_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Notification_C_Tick) == 0x000008, "Wrong alignment on WBP_Notification_C_Tick");
static_assert(sizeof(WBP_Notification_C_Tick) == 0x000048, "Wrong size on WBP_Notification_C_Tick");
static_assert(offsetof(WBP_Notification_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Notification_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Notification_C_Tick, InDeltaTime) == 0x000040, "Member 'WBP_Notification_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_Notification.WBP_Notification_C.ExecuteUbergraph_WBP_Notification
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_Notification_C_ExecuteUbergraph_WBP_Notification final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_297B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Text;                           // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0040(0x0040)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_297C[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_DeltaTime_ImplicitCast;         // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Current_ImplicitCast;           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Notification_C_ExecuteUbergraph_WBP_Notification) == 0x000008, "Wrong alignment on WBP_Notification_C_ExecuteUbergraph_WBP_Notification");
static_assert(sizeof(WBP_Notification_C_ExecuteUbergraph_WBP_Notification) == 0x0000C8, "Wrong size on WBP_Notification_C_ExecuteUbergraph_WBP_Notification");
static_assert(offsetof(WBP_Notification_C_ExecuteUbergraph_WBP_Notification, EntryPoint) == 0x000000, "Member 'WBP_Notification_C_ExecuteUbergraph_WBP_Notification::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Notification_C_ExecuteUbergraph_WBP_Notification, CallFunc_GetDesiredSize_ReturnValue) == 0x000008, "Member 'WBP_Notification_C_ExecuteUbergraph_WBP_Notification::CallFunc_GetDesiredSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Notification_C_ExecuteUbergraph_WBP_Notification, CallFunc_BreakVector2D_X) == 0x000018, "Member 'WBP_Notification_C_ExecuteUbergraph_WBP_Notification::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_Notification_C_ExecuteUbergraph_WBP_Notification, CallFunc_BreakVector2D_Y) == 0x000020, "Member 'WBP_Notification_C_ExecuteUbergraph_WBP_Notification::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_Notification_C_ExecuteUbergraph_WBP_Notification, K2Node_CustomEvent_Text) == 0x000028, "Member 'WBP_Notification_C_ExecuteUbergraph_WBP_Notification::K2Node_CustomEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_Notification_C_ExecuteUbergraph_WBP_Notification, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000038, "Member 'WBP_Notification_C_ExecuteUbergraph_WBP_Notification::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Notification_C_ExecuteUbergraph_WBP_Notification, K2Node_Event_MyGeometry) == 0x000040, "Member 'WBP_Notification_C_ExecuteUbergraph_WBP_Notification::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Notification_C_ExecuteUbergraph_WBP_Notification, K2Node_Event_InDeltaTime) == 0x000080, "Member 'WBP_Notification_C_ExecuteUbergraph_WBP_Notification::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Notification_C_ExecuteUbergraph_WBP_Notification, CallFunc_Conv_TextToString_ReturnValue) == 0x000088, "Member 'WBP_Notification_C_ExecuteUbergraph_WBP_Notification::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Notification_C_ExecuteUbergraph_WBP_Notification, CallFunc_PlayAnimationForward_ReturnValue) == 0x000098, "Member 'WBP_Notification_C_ExecuteUbergraph_WBP_Notification::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Notification_C_ExecuteUbergraph_WBP_Notification, CallFunc_PlayAnimationReverse_ReturnValue) == 0x0000A0, "Member 'WBP_Notification_C_ExecuteUbergraph_WBP_Notification::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Notification_C_ExecuteUbergraph_WBP_Notification, CallFunc_FInterpTo_ReturnValue) == 0x0000A8, "Member 'WBP_Notification_C_ExecuteUbergraph_WBP_Notification::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Notification_C_ExecuteUbergraph_WBP_Notification, CallFunc_FInterpTo_DeltaTime_ImplicitCast) == 0x0000B0, "Member 'WBP_Notification_C_ExecuteUbergraph_WBP_Notification::CallFunc_FInterpTo_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Notification_C_ExecuteUbergraph_WBP_Notification, CallFunc_FInterpTo_Current_ImplicitCast) == 0x0000B8, "Member 'WBP_Notification_C_ExecuteUbergraph_WBP_Notification::CallFunc_FInterpTo_Current_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Notification_C_ExecuteUbergraph_WBP_Notification, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x0000C0, "Member 'WBP_Notification_C_ExecuteUbergraph_WBP_Notification::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");

}

