#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ItemHintIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_WidgetBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ItemHintIcon.WBP_ItemHintIcon_C
// 0x0020 (0x0298 - 0x0278)
class UWBP_ItemHintIcon_C final : public UWBP_WidgetBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       StartAnim;                                         // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_ItemBase_C*                         Item;                                              // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ItemHintIcon(int32 EntryPoint);
	void Destroy();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ItemHintIcon_C">();
	}
	static class UWBP_ItemHintIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ItemHintIcon_C>();
	}
};
static_assert(alignof(UWBP_ItemHintIcon_C) == 0x000008, "Wrong alignment on UWBP_ItemHintIcon_C");
static_assert(sizeof(UWBP_ItemHintIcon_C) == 0x000298, "Wrong size on UWBP_ItemHintIcon_C");
static_assert(offsetof(UWBP_ItemHintIcon_C, UberGraphFrame) == 0x000278, "Member 'UWBP_ItemHintIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ItemHintIcon_C, StartAnim) == 0x000280, "Member 'UWBP_ItemHintIcon_C::StartAnim' has a wrong offset!");
static_assert(offsetof(UWBP_ItemHintIcon_C, Image_0) == 0x000288, "Member 'UWBP_ItemHintIcon_C::Image_0' has a wrong offset!");
static_assert(offsetof(UWBP_ItemHintIcon_C, Item) == 0x000290, "Member 'UWBP_ItemHintIcon_C::Item' has a wrong offset!");

}

