#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DialogBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_WidgetBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DialogBox.WBP_DialogBox_C
// 0x00C0 (0x0338 - 0x0278)
class UWBP_DialogBox_C final : public UWBP_WidgetBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       StartAnimation;                                    // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             DescriptionText;                                   // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             HeaderText;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_132;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClickableText_C*                       Option1;                                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClickableText_C*                       Option2;                                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_74;                                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   DialogName;                                        // 0x02B8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   DialogDesc;                                        // 0x02D0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   FirstOption;                                       // 0x02E8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   SecondOption;                                      // 0x0300(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	FMulticastInlineDelegateProperty_             ReturnFirstOption;                                 // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             ReturnSecodnOption;                                // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ReturnSecodnOption__DelegateSignature();
	void ReturnFirstOption__DelegateSignature();
	void ExecuteUbergraph_WBP_DialogBox(int32 EntryPoint);
	void Construct();
	void CompleteDialog();
	void BndEvt__WBP_DialogBox_Option2_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature(class UClickableText_C* Text);
	void BndEvt__WBP_DialogBox_Option1_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature(class UClickableText_C* Text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DialogBox_C">();
	}
	static class UWBP_DialogBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DialogBox_C>();
	}
};
static_assert(alignof(UWBP_DialogBox_C) == 0x000008, "Wrong alignment on UWBP_DialogBox_C");
static_assert(sizeof(UWBP_DialogBox_C) == 0x000338, "Wrong size on UWBP_DialogBox_C");
static_assert(offsetof(UWBP_DialogBox_C, UberGraphFrame) == 0x000278, "Member 'UWBP_DialogBox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DialogBox_C, StartAnimation) == 0x000280, "Member 'UWBP_DialogBox_C::StartAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_DialogBox_C, DescriptionText) == 0x000288, "Member 'UWBP_DialogBox_C::DescriptionText' has a wrong offset!");
static_assert(offsetof(UWBP_DialogBox_C, HeaderText) == 0x000290, "Member 'UWBP_DialogBox_C::HeaderText' has a wrong offset!");
static_assert(offsetof(UWBP_DialogBox_C, Image_132) == 0x000298, "Member 'UWBP_DialogBox_C::Image_132' has a wrong offset!");
static_assert(offsetof(UWBP_DialogBox_C, Option1) == 0x0002A0, "Member 'UWBP_DialogBox_C::Option1' has a wrong offset!");
static_assert(offsetof(UWBP_DialogBox_C, Option2) == 0x0002A8, "Member 'UWBP_DialogBox_C::Option2' has a wrong offset!");
static_assert(offsetof(UWBP_DialogBox_C, Spacer_74) == 0x0002B0, "Member 'UWBP_DialogBox_C::Spacer_74' has a wrong offset!");
static_assert(offsetof(UWBP_DialogBox_C, DialogName) == 0x0002B8, "Member 'UWBP_DialogBox_C::DialogName' has a wrong offset!");
static_assert(offsetof(UWBP_DialogBox_C, DialogDesc) == 0x0002D0, "Member 'UWBP_DialogBox_C::DialogDesc' has a wrong offset!");
static_assert(offsetof(UWBP_DialogBox_C, FirstOption) == 0x0002E8, "Member 'UWBP_DialogBox_C::FirstOption' has a wrong offset!");
static_assert(offsetof(UWBP_DialogBox_C, SecondOption) == 0x000300, "Member 'UWBP_DialogBox_C::SecondOption' has a wrong offset!");
static_assert(offsetof(UWBP_DialogBox_C, ReturnFirstOption) == 0x000318, "Member 'UWBP_DialogBox_C::ReturnFirstOption' has a wrong offset!");
static_assert(offsetof(UWBP_DialogBox_C, ReturnSecodnOption) == 0x000328, "Member 'UWBP_DialogBox_C::ReturnSecodnOption' has a wrong offset!");

}

