#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DebugString

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_DebugString.WBP_DebugString_C.ExecuteUbergraph_WBP_DebugString
// 0x0040 (0x0040 - 0x0000)
struct WBP_DebugString_C_ExecuteUbergraph_WBP_DebugString final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29DF[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0008(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0020(0x0014)()
	float                                         CallFunc_PrintString_Duration_ImplicitCast;        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugString_C_ExecuteUbergraph_WBP_DebugString) == 0x000008, "Wrong alignment on WBP_DebugString_C_ExecuteUbergraph_WBP_DebugString");
static_assert(sizeof(WBP_DebugString_C_ExecuteUbergraph_WBP_DebugString) == 0x000040, "Wrong size on WBP_DebugString_C_ExecuteUbergraph_WBP_DebugString");
static_assert(offsetof(WBP_DebugString_C_ExecuteUbergraph_WBP_DebugString, EntryPoint) == 0x000000, "Member 'WBP_DebugString_C_ExecuteUbergraph_WBP_DebugString::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DebugString_C_ExecuteUbergraph_WBP_DebugString, CallFunc_Conv_StringToText_ReturnValue) == 0x000008, "Member 'WBP_DebugString_C_ExecuteUbergraph_WBP_DebugString::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugString_C_ExecuteUbergraph_WBP_DebugString, K2Node_MakeStruct_SlateColor) == 0x000020, "Member 'WBP_DebugString_C_ExecuteUbergraph_WBP_DebugString::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_DebugString_C_ExecuteUbergraph_WBP_DebugString, CallFunc_PrintString_Duration_ImplicitCast) == 0x000034, "Member 'WBP_DebugString_C_ExecuteUbergraph_WBP_DebugString::CallFunc_PrintString_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_DebugString_C_ExecuteUbergraph_WBP_DebugString, CallFunc_Delay_Duration_ImplicitCast) == 0x000038, "Member 'WBP_DebugString_C_ExecuteUbergraph_WBP_DebugString::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

}

