#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RemoteControlUi

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RemoteControlUi.WBP_RemoteControlUi_C
// 0x0018 (0x0290 - 0x0278)
class UWBP_RemoteControlUi_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_0;                                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_0;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SuccessMessage();
	void FailMessage();
	void ExecuteUbergraph_WBP_RemoteControlUi(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RemoteControlUi_C">();
	}
	static class UWBP_RemoteControlUi_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RemoteControlUi_C>();
	}
};
static_assert(alignof(UWBP_RemoteControlUi_C) == 0x000008, "Wrong alignment on UWBP_RemoteControlUi_C");
static_assert(sizeof(UWBP_RemoteControlUi_C) == 0x000290, "Wrong size on UWBP_RemoteControlUi_C");
static_assert(offsetof(UWBP_RemoteControlUi_C, UberGraphFrame) == 0x000278, "Member 'UWBP_RemoteControlUi_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_RemoteControlUi_C, Image_0) == 0x000280, "Member 'UWBP_RemoteControlUi_C::Image_0' has a wrong offset!");
static_assert(offsetof(UWBP_RemoteControlUi_C, TextBlock_0) == 0x000288, "Member 'UWBP_RemoteControlUi_C::TextBlock_0' has a wrong offset!");

}

