#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SettingsWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_WidgetBase_classes.hpp"
#include "ESettingLevel_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SettingsWidget.WBP_SettingsWidget_C
// 0x00F8 (0x0370 - 0x0278)
class UWBP_SettingsWidget_C final : public UWBP_WidgetBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UClickableText_C*                       AudioSettingsButton;                               // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_0;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonAnimatedSwitcher*                CommonAnimatedSwitcher_0;                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClickableText_C*                       ControlesSettingsButton;                           // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableText*                          EditableText;                                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableText*                          EditableText_0;                                    // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlider_C*                         FovSlider;                                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlider_C*                         GameVolumeSlider;                                  // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlider_C*                         GammaSlider;                                       // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             GraphicsSettings;                                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClickableText_C*                       GrSetBut;                                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_4;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlider_C*                         MouseSensitivitySlider;                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlider_C*                         MusicVolumeSlider;                                 // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSetting_C*                        NamedSetting_1;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSetting_C*                        NamedSetting_2;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSetting_C*                        NamedSetting_3;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSetting_C*                        NamedSetting_4;                                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSetting_C*                        NamedSetting_5;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSetting_C*                        NamedSetting_6;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSetting_C*                        NamedSetting_7;                                    // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSetting_C*                        NamedSetting_8;                                    // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlider_C*                         NamedSlider;                                       // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           SettingsCanvas;                                    // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_127;                                        // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClickableText_C*                       UiSettingsButton;                                  // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlider_C*                         UiVolumeSlider;                                    // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_GameInstanceMain_C*                 As_BP_Game_Instance_Main;                          // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USettingPopup_C*                        CurrentPopup;                                      // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Spacer43Fix();
	void ReturnLevel_Event(class USettingPopup_C* Widget, ESettingLevel Level);
	void ResetCaller();
	void GetInstance(class UBP_GameInstanceMain_C** BP_GameInstanceMain);
	void ExecuteUbergraph_WBP_SettingsWidget(int32 EntryPoint);
	void Construct();
	void CallPopup();
	void BndEvt__WBP_SettingsWidget_UiVolumeSlider_K2Node_ComponentBoundEvent_9_OnValueChanged__DelegateSignature(double Value, double Percent);
	void BndEvt__WBP_SettingsWidget_NamedSlider_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature(double Value, double Percent);
	void BndEvt__WBP_SettingsWidget_NamedSlider_4_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature(double Value, double Percent);
	void BndEvt__WBP_SettingsWidget_MusicVolumeSlider_K2Node_ComponentBoundEvent_8_OnValueChanged__DelegateSignature(double Value, double Percent);
	void BndEvt__WBP_SettingsWidget_MouseSensitivitySlider_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature(double Value, double Percent);
	void BndEvt__WBP_SettingsWidget_GrSetBut_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature(class UClickableText_C* Text);
	void BndEvt__WBP_SettingsWidget_gammaSlider_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature(double Value, double Percent);
	void BndEvt__WBP_SettingsWidget_FovSlider_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature(double Value, double Percent);
	void BndEvt__WBP_SettingsWidget_EditableText_0_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature(const class FText& Text);
	void BndEvt__WBP_SettingsWidget_ControlesSettingsButton_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature(class UClickableText_C* Text);
	void BndEvt__WBP_SettingsWidget_Button_0_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_SettingsWidget_AudioSettingsButton_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature(class UClickableText_C* Text);
	void AssignSliders();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SettingsWidget_C">();
	}
	static class UWBP_SettingsWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SettingsWidget_C>();
	}
};
static_assert(alignof(UWBP_SettingsWidget_C) == 0x000008, "Wrong alignment on UWBP_SettingsWidget_C");
static_assert(sizeof(UWBP_SettingsWidget_C) == 0x000370, "Wrong size on UWBP_SettingsWidget_C");
static_assert(offsetof(UWBP_SettingsWidget_C, UberGraphFrame) == 0x000278, "Member 'UWBP_SettingsWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsWidget_C, AudioSettingsButton) == 0x000280, "Member 'UWBP_SettingsWidget_C::AudioSettingsButton' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsWidget_C, Button_0) == 0x000288, "Member 'UWBP_SettingsWidget_C::Button_0' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsWidget_C, CommonAnimatedSwitcher_0) == 0x000290, "Member 'UWBP_SettingsWidget_C::CommonAnimatedSwitcher_0' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsWidget_C, ControlesSettingsButton) == 0x000298, "Member 'UWBP_SettingsWidget_C::ControlesSettingsButton' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsWidget_C, EditableText) == 0x0002A0, "Member 'UWBP_SettingsWidget_C::EditableText' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsWidget_C, EditableText_0) == 0x0002A8, "Member 'UWBP_SettingsWidget_C::EditableText_0' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsWidget_C, FovSlider) == 0x0002B0, "Member 'UWBP_SettingsWidget_C::FovSlider' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsWidget_C, GameVolumeSlider) == 0x0002B8, "Member 'UWBP_SettingsWidget_C::GameVolumeSlider' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsWidget_C, GammaSlider) == 0x0002C0, "Member 'UWBP_SettingsWidget_C::GammaSlider' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsWidget_C, GraphicsSettings) == 0x0002C8, "Member 'UWBP_SettingsWidget_C::GraphicsSettings' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsWidget_C, GrSetBut) == 0x0002D0, "Member 'UWBP_SettingsWidget_C::GrSetBut' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsWidget_C, HorizontalBox_4) == 0x0002D8, "Member 'UWBP_SettingsWidget_C::HorizontalBox_4' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsWidget_C, Image_0) == 0x0002E0, "Member 'UWBP_SettingsWidget_C::Image_0' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsWidget_C, MouseSensitivitySlider) == 0x0002E8, "Member 'UWBP_SettingsWidget_C::MouseSensitivitySlider' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsWidget_C, MusicVolumeSlider) == 0x0002F0, "Member 'UWBP_SettingsWidget_C::MusicVolumeSlider' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsWidget_C, NamedSetting_1) == 0x0002F8, "Member 'UWBP_SettingsWidget_C::NamedSetting_1' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsWidget_C, NamedSetting_2) == 0x000300, "Member 'UWBP_SettingsWidget_C::NamedSetting_2' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsWidget_C, NamedSetting_3) == 0x000308, "Member 'UWBP_SettingsWidget_C::NamedSetting_3' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsWidget_C, NamedSetting_4) == 0x000310, "Member 'UWBP_SettingsWidget_C::NamedSetting_4' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsWidget_C, NamedSetting_5) == 0x000318, "Member 'UWBP_SettingsWidget_C::NamedSetting_5' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsWidget_C, NamedSetting_6) == 0x000320, "Member 'UWBP_SettingsWidget_C::NamedSetting_6' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsWidget_C, NamedSetting_7) == 0x000328, "Member 'UWBP_SettingsWidget_C::NamedSetting_7' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsWidget_C, NamedSetting_8) == 0x000330, "Member 'UWBP_SettingsWidget_C::NamedSetting_8' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsWidget_C, NamedSlider) == 0x000338, "Member 'UWBP_SettingsWidget_C::NamedSlider' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsWidget_C, SettingsCanvas) == 0x000340, "Member 'UWBP_SettingsWidget_C::SettingsCanvas' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsWidget_C, Spacer_127) == 0x000348, "Member 'UWBP_SettingsWidget_C::Spacer_127' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsWidget_C, UiSettingsButton) == 0x000350, "Member 'UWBP_SettingsWidget_C::UiSettingsButton' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsWidget_C, UiVolumeSlider) == 0x000358, "Member 'UWBP_SettingsWidget_C::UiVolumeSlider' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsWidget_C, As_BP_Game_Instance_Main) == 0x000360, "Member 'UWBP_SettingsWidget_C::As_BP_Game_Instance_Main' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsWidget_C, CurrentPopup) == 0x000368, "Member 'UWBP_SettingsWidget_C::CurrentPopup' has a wrong offset!");

}

