#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HintItems

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_HintItems.WBP_HintItems_C.Tick
// 0x0048 (0x0048 - 0x0000)
struct WBP_HintItems_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HintItems_C_Tick) == 0x000008, "Wrong alignment on WBP_HintItems_C_Tick");
static_assert(sizeof(WBP_HintItems_C_Tick) == 0x000048, "Wrong size on WBP_HintItems_C_Tick");
static_assert(offsetof(WBP_HintItems_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_HintItems_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_Tick, InDeltaTime) == 0x000040, "Member 'WBP_HintItems_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_HintItems.WBP_HintItems_C.ThisItemIsValid
// 0x0030 (0x0030 - 0x0000)
struct WBP_HintItems_C_ThisItemIsValid final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          NewLocalVar_01;                                    // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewLocalVar_0;                                     // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_260E[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_260F[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ItemHintIcon_C*                    CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HintItems_C_ThisItemIsValid) == 0x000008, "Wrong alignment on WBP_HintItems_C_ThisItemIsValid");
static_assert(sizeof(WBP_HintItems_C_ThisItemIsValid) == 0x000030, "Wrong size on WBP_HintItems_C_ThisItemIsValid");
static_assert(offsetof(WBP_HintItems_C_ThisItemIsValid, Item) == 0x000000, "Member 'WBP_HintItems_C_ThisItemIsValid::Item' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ThisItemIsValid, NewLocalVar_01) == 0x000008, "Member 'WBP_HintItems_C_ThisItemIsValid::NewLocalVar_01' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ThisItemIsValid, NewLocalVar_0) == 0x000009, "Member 'WBP_HintItems_C_ThisItemIsValid::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ThisItemIsValid, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WBP_HintItems_C_ThisItemIsValid::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ThisItemIsValid, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'WBP_HintItems_C_ThisItemIsValid::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ThisItemIsValid, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WBP_HintItems_C_ThisItemIsValid::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ThisItemIsValid, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_HintItems_C_ThisItemIsValid::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ThisItemIsValid, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_HintItems_C_ThisItemIsValid::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ThisItemIsValid, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'WBP_HintItems_C_ThisItemIsValid::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ThisItemIsValid, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000029, "Member 'WBP_HintItems_C_ThisItemIsValid::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function WBP_HintItems.WBP_HintItems_C.GetAllItemsInRange
// 0x0100 (0x0100 - 0x0000)
struct WBP_HintItems_C_GetAllItemsInRange final
{
public:
	double                                        Range;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IfRendering;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RaycastCheck;                                      // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2610[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_ItemBase_C*>                 Param_Items;                                       // 0x0010(0x0010)(Parm, OutParm)
	int32                                         Param_Num;                                         // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2611[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_ItemBase_C*>                 NewLocalVar;                                       // 0x0028(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Player_C*                           K2Node_DynamicCast_AsBP_Player;                    // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2612[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2613[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_ItemBase_C*>                 CallFunc_GetAllActorsOfClass_OutActors;            // 0x0090(0x0010)(ReferenceParm)
	class ABP_ItemBase_C*                         CallFunc_Array_Get_Item;                           // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2614[0x3];                                     // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2615[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CameraRaycastCheck_ReturnValue;           // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue;          // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2616[0x2];                                     // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HintItems_C_GetAllItemsInRange) == 0x000008, "Wrong alignment on WBP_HintItems_C_GetAllItemsInRange");
static_assert(sizeof(WBP_HintItems_C_GetAllItemsInRange) == 0x000100, "Wrong size on WBP_HintItems_C_GetAllItemsInRange");
static_assert(offsetof(WBP_HintItems_C_GetAllItemsInRange, Range) == 0x000000, "Member 'WBP_HintItems_C_GetAllItemsInRange::Range' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_GetAllItemsInRange, IfRendering) == 0x000008, "Member 'WBP_HintItems_C_GetAllItemsInRange::IfRendering' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_GetAllItemsInRange, RaycastCheck) == 0x000009, "Member 'WBP_HintItems_C_GetAllItemsInRange::RaycastCheck' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_GetAllItemsInRange, Param_Items) == 0x000010, "Member 'WBP_HintItems_C_GetAllItemsInRange::Param_Items' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_GetAllItemsInRange, Param_Num) == 0x000020, "Member 'WBP_HintItems_C_GetAllItemsInRange::Param_Num' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_GetAllItemsInRange, NewLocalVar) == 0x000028, "Member 'WBP_HintItems_C_GetAllItemsInRange::NewLocalVar' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_GetAllItemsInRange, CallFunc_GetOwningPlayer_ReturnValue) == 0x000038, "Member 'WBP_HintItems_C_GetAllItemsInRange::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_GetAllItemsInRange, CallFunc_K2_GetPawn_ReturnValue) == 0x000040, "Member 'WBP_HintItems_C_GetAllItemsInRange::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_GetAllItemsInRange, K2Node_DynamicCast_AsBP_Player) == 0x000048, "Member 'WBP_HintItems_C_GetAllItemsInRange::K2Node_DynamicCast_AsBP_Player' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_GetAllItemsInRange, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_HintItems_C_GetAllItemsInRange::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_GetAllItemsInRange, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000058, "Member 'WBP_HintItems_C_GetAllItemsInRange::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_GetAllItemsInRange, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'WBP_HintItems_C_GetAllItemsInRange::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_GetAllItemsInRange, CallFunc_GetCameraLocation_ReturnValue) == 0x000068, "Member 'WBP_HintItems_C_GetAllItemsInRange::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_GetAllItemsInRange, Temp_int_Loop_Counter_Variable) == 0x000080, "Member 'WBP_HintItems_C_GetAllItemsInRange::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_GetAllItemsInRange, Temp_int_Array_Index_Variable) == 0x000084, "Member 'WBP_HintItems_C_GetAllItemsInRange::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_GetAllItemsInRange, CallFunc_Add_IntInt_ReturnValue) == 0x000088, "Member 'WBP_HintItems_C_GetAllItemsInRange::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_GetAllItemsInRange, CallFunc_Array_Length_ReturnValue) == 0x00008C, "Member 'WBP_HintItems_C_GetAllItemsInRange::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_GetAllItemsInRange, CallFunc_GetAllActorsOfClass_OutActors) == 0x000090, "Member 'WBP_HintItems_C_GetAllItemsInRange::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_GetAllItemsInRange, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'WBP_HintItems_C_GetAllItemsInRange::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_GetAllItemsInRange, CallFunc_Array_Length_ReturnValue_1) == 0x0000A8, "Member 'WBP_HintItems_C_GetAllItemsInRange::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_GetAllItemsInRange, CallFunc_Less_IntInt_ReturnValue) == 0x0000AC, "Member 'WBP_HintItems_C_GetAllItemsInRange::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_GetAllItemsInRange, CallFunc_Array_Add_ReturnValue) == 0x0000B0, "Member 'WBP_HintItems_C_GetAllItemsInRange::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_GetAllItemsInRange, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000B8, "Member 'WBP_HintItems_C_GetAllItemsInRange::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_GetAllItemsInRange, CallFunc_CameraRaycastCheck_ReturnValue) == 0x0000D0, "Member 'WBP_HintItems_C_GetAllItemsInRange::CallFunc_CameraRaycastCheck_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_GetAllItemsInRange, CallFunc_WasRecentlyRendered_ReturnValue) == 0x0000D1, "Member 'WBP_HintItems_C_GetAllItemsInRange::CallFunc_WasRecentlyRendered_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_GetAllItemsInRange, CallFunc_Array_Add_ReturnValue_1) == 0x0000D4, "Member 'WBP_HintItems_C_GetAllItemsInRange::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_GetAllItemsInRange, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0000D8, "Member 'WBP_HintItems_C_GetAllItemsInRange::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_GetAllItemsInRange, CallFunc_Vector_Distance_ReturnValue) == 0x0000F0, "Member 'WBP_HintItems_C_GetAllItemsInRange::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_GetAllItemsInRange, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x0000F8, "Member 'WBP_HintItems_C_GetAllItemsInRange::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");

// Function WBP_HintItems.WBP_HintItems_C.ExecuteUbergraph_WBP_HintItems
// 0x0260 (0x0260 - 0x0000)
struct WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2617[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0018(0x0040)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2618[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue;              // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x0078(0x0040)(ConstParm, IsPlainOldData, NoDestructor)
	double                                        CallFunc_BreakVector2D_X;                          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetLocalSize_ReturnValue;                 // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_ItemHintIcon_C*                    CallFunc_Create_ReturnValue;                       // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ItemHintIcon_C*                    CallFunc_Array_Get_Item;                           // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2619[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261A[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261B[0x4];                                     // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261C[0x4];                                     // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_ItemBase_C*>                 CallFunc_GetAllItemsInRange_Items;                 // 0x0158(0x0010)(ReferenceParm)
	int32                                         CallFunc_GetAllItemsInRange_Num;                   // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261D[0x4];                                     // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ItemBase_C*                         CallFunc_Array_Get_Item_1;                         // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261E[0x7];                                     // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ItemBase_C*                         CallFunc_Array_Get_Item_2;                         // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x01B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ThisItemIsValid_NewLocalVar_01;           // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261F[0x7];                                     // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetTransform                       K2Node_MakeStruct_WidgetTransform;                 // 0x01C8(0x0038)(NoDestructor)
	double                                        CallFunc_MapRangeClamped_ReturnValue_1;            // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2620[0x3];                                     // 0x020D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_ProjectWorldToScreen_ScreenPosition;      // 0x0210(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProjectWorldToScreen_ReturnValue;         // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2621[0x7];                                     // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X_2;                        // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_2;                        // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_2;            // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_3;            // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0248(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems) == 0x000008, "Wrong alignment on WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems");
static_assert(sizeof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems) == 0x000260, "Wrong size on WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, EntryPoint) == 0x000000, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, K2Node_Event_MyGeometry) == 0x000018, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, K2Node_Event_InDeltaTime) == 0x000058, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, CallFunc_GetOwningPlayer_ReturnValue) == 0x000060, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, CallFunc_GetViewportSize_ReturnValue) == 0x000068, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::CallFunc_GetViewportSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, CallFunc_GetCachedGeometry_ReturnValue) == 0x000078, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::CallFunc_GetCachedGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, CallFunc_BreakVector2D_X) == 0x0000B8, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, CallFunc_BreakVector2D_Y) == 0x0000C0, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, CallFunc_GetLocalSize_ReturnValue) == 0x0000C8, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::CallFunc_GetLocalSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, CallFunc_BreakVector2D_X_1) == 0x0000D8, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, CallFunc_BreakVector2D_Y_1) == 0x0000E0, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, CallFunc_Create_ReturnValue) == 0x0000E8, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x0000F0, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, CallFunc_Array_Get_Item) == 0x0000F8, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, CallFunc_Array_RemoveItem_ReturnValue) == 0x000100, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000108, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, CallFunc_Array_Length_ReturnValue) == 0x000110, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, CallFunc_Array_Add_ReturnValue) == 0x000114, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, CallFunc_Less_IntInt_ReturnValue) == 0x000118, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, CallFunc_AddChild_ReturnValue) == 0x000120, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, Temp_int_Loop_Counter_Variable_1) == 0x000128, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000130, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, CallFunc_GetCameraLocation_ReturnValue) == 0x000138, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, CallFunc_Add_IntInt_ReturnValue_1) == 0x000150, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, CallFunc_GetAllItemsInRange_Items) == 0x000158, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::CallFunc_GetAllItemsInRange_Items' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, CallFunc_GetAllItemsInRange_Num) == 0x000168, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::CallFunc_GetAllItemsInRange_Num' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, CallFunc_Array_Get_Item_1) == 0x000170, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000178, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000180, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, CallFunc_Vector_Distance_ReturnValue) == 0x000198, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, CallFunc_Array_Get_Item_2) == 0x0001A0, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, CallFunc_MapRangeClamped_ReturnValue) == 0x0001A8, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, CallFunc_MakeVector2D_ReturnValue) == 0x0001B0, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, CallFunc_ThisItemIsValid_NewLocalVar_01) == 0x0001C0, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::CallFunc_ThisItemIsValid_NewLocalVar_01' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, K2Node_MakeStruct_WidgetTransform) == 0x0001C8, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::K2Node_MakeStruct_WidgetTransform' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, CallFunc_MapRangeClamped_ReturnValue_1) == 0x000200, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, CallFunc_Array_Length_ReturnValue_1) == 0x000208, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, CallFunc_Less_IntInt_ReturnValue_1) == 0x00020C, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, CallFunc_ProjectWorldToScreen_ScreenPosition) == 0x000210, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::CallFunc_ProjectWorldToScreen_ScreenPosition' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, CallFunc_ProjectWorldToScreen_ReturnValue) == 0x000220, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::CallFunc_ProjectWorldToScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, CallFunc_BreakVector2D_X_2) == 0x000228, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, CallFunc_BreakVector2D_Y_2) == 0x000230, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, CallFunc_MapRangeClamped_ReturnValue_2) == 0x000238, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::CallFunc_MapRangeClamped_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, CallFunc_MapRangeClamped_ReturnValue_3) == 0x000240, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::CallFunc_MapRangeClamped_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, CallFunc_MakeVector2D_ReturnValue_1) == 0x000248, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000258, "Member 'WBP_HintItems_C_ExecuteUbergraph_WBP_HintItems::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function WBP_HintItems.WBP_HintItems_C.CameraRaycastCheck
// 0x0150 (0x0150 - 0x0000)
struct WBP_HintItems_C_CameraRaycastCheck final
{
public:
	struct FVector                                ObjectLocation;                                    // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2622[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0020(0x0010)(ConstParm, ReferenceParm)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ConstParm, ReferenceParm)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0060(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HintItems_C_CameraRaycastCheck) == 0x000008, "Wrong alignment on WBP_HintItems_C_CameraRaycastCheck");
static_assert(sizeof(WBP_HintItems_C_CameraRaycastCheck) == 0x000150, "Wrong size on WBP_HintItems_C_CameraRaycastCheck");
static_assert(offsetof(WBP_HintItems_C_CameraRaycastCheck, ObjectLocation) == 0x000000, "Member 'WBP_HintItems_C_CameraRaycastCheck::ObjectLocation' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_CameraRaycastCheck, ReturnValue) == 0x000018, "Member 'WBP_HintItems_C_CameraRaycastCheck::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HintItems_C_CameraRaycastCheck, Temp_object_Variable) == 0x000020, "Member 'WBP_HintItems_C_CameraRaycastCheck::Temp_object_Variable' has a wrong offset!");
