#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DebugCanvas

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_DebugCanvas.WBP_DebugCanvas_C.PrintDebugString
// 0x0030 (0x0030 - 0x0000)
struct WBP_DebugCanvas_C_PrintDebugString final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          PrintToLog;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2963[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Text_Color;                                        // 0x0014(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2964[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Duration;                                          // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugCanvas_C_PrintDebugString) == 0x000008, "Wrong alignment on WBP_DebugCanvas_C_PrintDebugString");
static_assert(sizeof(WBP_DebugCanvas_C_PrintDebugString) == 0x000030, "Wrong size on WBP_DebugCanvas_C_PrintDebugString");
static_assert(offsetof(WBP_DebugCanvas_C_PrintDebugString, String) == 0x000000, "Member 'WBP_DebugCanvas_C_PrintDebugString::String' has a wrong offset!");
static_assert(offsetof(WBP_DebugCanvas_C_PrintDebugString, PrintToLog) == 0x000010, "Member 'WBP_DebugCanvas_C_PrintDebugString::PrintToLog' has a wrong offset!");
static_assert(offsetof(WBP_DebugCanvas_C_PrintDebugString, Text_Color) == 0x000014, "Member 'WBP_DebugCanvas_C_PrintDebugString::Text_Color' has a wrong offset!");
static_assert(offsetof(WBP_DebugCanvas_C_PrintDebugString, Duration) == 0x000028, "Member 'WBP_DebugCanvas_C_PrintDebugString::Duration' has a wrong offset!");

// Function WBP_DebugCanvas.WBP_DebugCanvas_C.ExecuteUbergraph_WBP_DebugCanvas
// 0x0048 (0x0048 - 0x0000)
struct WBP_DebugCanvas_C_ExecuteUbergraph_WBP_DebugCanvas final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2965[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_DebugString_C*                     CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_String;                         // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_PrintToLog;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2966[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_CustomEvent_Text_Color;                     // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2967[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_Duration;                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugCanvas_C_ExecuteUbergraph_WBP_DebugCanvas) == 0x000008, "Wrong alignment on WBP_DebugCanvas_C_ExecuteUbergraph_WBP_DebugCanvas");
static_assert(sizeof(WBP_DebugCanvas_C_ExecuteUbergraph_WBP_DebugCanvas) == 0x000048, "Wrong size on WBP_DebugCanvas_C_ExecuteUbergraph_WBP_DebugCanvas");
static_assert(offsetof(WBP_DebugCanvas_C_ExecuteUbergraph_WBP_DebugCanvas, EntryPoint) == 0x000000, "Member 'WBP_DebugCanvas_C_ExecuteUbergraph_WBP_DebugCanvas::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DebugCanvas_C_ExecuteUbergraph_WBP_DebugCanvas, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_DebugCanvas_C_ExecuteUbergraph_WBP_DebugCanvas::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugCanvas_C_ExecuteUbergraph_WBP_DebugCanvas, CallFunc_AddChild_ReturnValue) == 0x000010, "Member 'WBP_DebugCanvas_C_ExecuteUbergraph_WBP_DebugCanvas::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugCanvas_C_ExecuteUbergraph_WBP_DebugCanvas, K2Node_CustomEvent_String) == 0x000018, "Member 'WBP_DebugCanvas_C_ExecuteUbergraph_WBP_DebugCanvas::K2Node_CustomEvent_String' has a wrong offset!");
static_assert(offsetof(WBP_DebugCanvas_C_ExecuteUbergraph_WBP_DebugCanvas, K2Node_CustomEvent_PrintToLog) == 0x000028, "Member 'WBP_DebugCanvas_C_ExecuteUbergraph_WBP_DebugCanvas::K2Node_CustomEvent_PrintToLog' has a wrong offset!");
static_assert(offsetof(WBP_DebugCanvas_C_ExecuteUbergraph_WBP_DebugCanvas, K2Node_CustomEvent_Text_Color) == 0x00002C, "Member 'WBP_DebugCanvas_C_ExecuteUbergraph_WBP_DebugCanvas::K2Node_CustomEvent_Text_Color' has a wrong offset!");
static_assert(offsetof(WBP_DebugCanvas_C_ExecuteUbergraph_WBP_DebugCanvas, K2Node_CustomEvent_Duration) == 0x000040, "Member 'WBP_DebugCanvas_C_ExecuteUbergraph_WBP_DebugCanvas::K2Node_CustomEvent_Duration' has a wrong offset!");

}

