#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FPSGraph

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_FPSGraph.WBP_FPSGraph_C
// 0x0040 (0x02B8 - 0x0278)
class UWBP_FPSGraph_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_98;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_1;                                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_63;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         VisualGraph;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWBP_Stat_C*>                    NewVar;                                            // 0x02A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void Update();
	void StartAll();
	void ExecuteUbergraph_WBP_FPSGraph(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_FPSGraph_C">();
	}
	static class UWBP_FPSGraph_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_FPSGraph_C>();
	}
};
static_assert(alignof(UWBP_FPSGraph_C) == 0x000008, "Wrong alignment on UWBP_FPSGraph_C");
static_assert(sizeof(UWBP_FPSGraph_C) == 0x0002B8, "Wrong size on UWBP_FPSGraph_C");
static_assert(offsetof(UWBP_FPSGraph_C, UberGraphFrame) == 0x000278, "Member 'UWBP_FPSGraph_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_FPSGraph_C, Image_98) == 0x000280, "Member 'UWBP_FPSGraph_C::Image_98' has a wrong offset!");
static_assert(offsetof(UWBP_FPSGraph_C, TextBlock) == 0x000288, "Member 'UWBP_FPSGraph_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_FPSGraph_C, TextBlock_1) == 0x000290, "Member 'UWBP_FPSGraph_C::TextBlock_1' has a wrong offset!");
static_assert(offsetof(UWBP_FPSGraph_C, TextBlock_63) == 0x000298, "Member 'UWBP_FPSGraph_C::TextBlock_63' has a wrong offset!");
static_assert(offsetof(UWBP_FPSGraph_C, VisualGraph) == 0x0002A0, "Member 'UWBP_FPSGraph_C::VisualGraph' has a wrong offset!");
static_assert(offsetof(UWBP_FPSGraph_C, NewVar) == 0x0002A8, "Member 'UWBP_FPSGraph_C::NewVar' has a wrong offset!");

}

