#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RemoteControlUi

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_RemoteControlUi.WBP_RemoteControlUi_C.ExecuteUbergraph_WBP_RemoteControlUi
// 0x0040 (0x0040 - 0x0000)
struct WBP_RemoteControlUi_C_ExecuteUbergraph_WBP_RemoteControlUi final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0018(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x002C(0x0014)()
};
static_assert(alignof(WBP_RemoteControlUi_C_ExecuteUbergraph_WBP_RemoteControlUi) == 0x000004, "Wrong alignment on WBP_RemoteControlUi_C_ExecuteUbergraph_WBP_RemoteControlUi");
static_assert(sizeof(WBP_RemoteControlUi_C_ExecuteUbergraph_WBP_RemoteControlUi) == 0x000040, "Wrong size on WBP_RemoteControlUi_C_ExecuteUbergraph_WBP_RemoteControlUi");
static_assert(offsetof(WBP_RemoteControlUi_C_ExecuteUbergraph_WBP_RemoteControlUi, EntryPoint) == 0x000000, "Member 'WBP_RemoteControlUi_C_ExecuteUbergraph_WBP_RemoteControlUi::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_RemoteControlUi_C_ExecuteUbergraph_WBP_RemoteControlUi, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'WBP_RemoteControlUi_C_ExecuteUbergraph_WBP_RemoteControlUi::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_RemoteControlUi_C_ExecuteUbergraph_WBP_RemoteControlUi, K2Node_MakeStruct_SlateColor_1) == 0x000018, "Member 'WBP_RemoteControlUi_C_ExecuteUbergraph_WBP_RemoteControlUi::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_RemoteControlUi_C_ExecuteUbergraph_WBP_RemoteControlUi, K2Node_MakeStruct_SlateColor_2) == 0x00002C, "Member 'WBP_RemoteControlUi_C_ExecuteUbergraph_WBP_RemoteControlUi::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");

}

