#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Stat

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Stat.WBP_Stat_C.Tick
// 0x0048 (0x0048 - 0x0000)
struct WBP_Stat_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Stat_C_Tick) == 0x000008, "Wrong alignment on WBP_Stat_C_Tick");
static_assert(sizeof(WBP_Stat_C_Tick) == 0x000048, "Wrong size on WBP_Stat_C_Tick");
static_assert(offsetof(WBP_Stat_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Stat_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_Tick, InDeltaTime) == 0x000040, "Member 'WBP_Stat_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_Stat.WBP_Stat_C.ExecuteUbergraph_WBP_Stat
// 0x0130 (0x0130 - 0x0000)
struct WBP_Stat_C_ExecuteUbergraph_WBP_Stat final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2972[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0040)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2973[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_1;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FloatSpringInterp_ReturnValue;            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue_1;                  // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2974[0x3];                                     // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue_2;                  // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2975[0x3];                                     // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_2;                // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x00A8(0x0018)()
	double                                        CallFunc_FInterpTo_ReturnValue_1;                  // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue_2;                  // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_DeltaTime_ImplicitCast;         // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_DeltaTime_ImplicitCast_1;       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_DeltaTime_ImplicitCast_2;       // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_LinearColorLerp_Alpha_ImplicitCast;       // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FloatSpringInterp_Target_ImplicitCast;    // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Current_ImplicitCast;           // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2976[0x4];                                     // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FInterpTo_Current_ImplicitCast_1;         // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat) == 0x000008, "Wrong alignment on WBP_Stat_C_ExecuteUbergraph_WBP_Stat");
static_assert(sizeof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat) == 0x000130, "Wrong size on WBP_Stat_C_ExecuteUbergraph_WBP_Stat");
static_assert(offsetof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat, EntryPoint) == 0x000000, "Member 'WBP_Stat_C_ExecuteUbergraph_WBP_Stat::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat, CallFunc_IsHovered_ReturnValue) == 0x000004, "Member 'WBP_Stat_C_ExecuteUbergraph_WBP_Stat::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat, K2Node_Event_MyGeometry) == 0x000008, "Member 'WBP_Stat_C_ExecuteUbergraph_WBP_Stat::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat, K2Node_Event_InDeltaTime) == 0x000048, "Member 'WBP_Stat_C_ExecuteUbergraph_WBP_Stat::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat, CallFunc_SelectFloat_ReturnValue) == 0x000050, "Member 'WBP_Stat_C_ExecuteUbergraph_WBP_Stat::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat, CallFunc_MapRangeClamped_ReturnValue) == 0x000058, "Member 'WBP_Stat_C_ExecuteUbergraph_WBP_Stat::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat, CallFunc_MapRangeClamped_ReturnValue_1) == 0x000060, "Member 'WBP_Stat_C_ExecuteUbergraph_WBP_Stat::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat, CallFunc_LinearColorLerp_ReturnValue) == 0x000068, "Member 'WBP_Stat_C_ExecuteUbergraph_WBP_Stat::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat, CallFunc_PlayAnimationForward_ReturnValue) == 0x000078, "Member 'WBP_Stat_C_ExecuteUbergraph_WBP_Stat::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat, CallFunc_FloatSpringInterp_ReturnValue) == 0x000080, "Member 'WBP_Stat_C_ExecuteUbergraph_WBP_Stat::CallFunc_FloatSpringInterp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat, CallFunc_IsHovered_ReturnValue_1) == 0x000084, "Member 'WBP_Stat_C_ExecuteUbergraph_WBP_Stat::CallFunc_IsHovered_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat, CallFunc_SelectFloat_ReturnValue_1) == 0x000088, "Member 'WBP_Stat_C_ExecuteUbergraph_WBP_Stat::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat, CallFunc_FInterpTo_ReturnValue) == 0x000090, "Member 'WBP_Stat_C_ExecuteUbergraph_WBP_Stat::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat, CallFunc_GetRenderOpacity_ReturnValue) == 0x000098, "Member 'WBP_Stat_C_ExecuteUbergraph_WBP_Stat::CallFunc_GetRenderOpacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat, CallFunc_IsHovered_ReturnValue_2) == 0x00009C, "Member 'WBP_Stat_C_ExecuteUbergraph_WBP_Stat::CallFunc_IsHovered_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat, CallFunc_SelectFloat_ReturnValue_2) == 0x0000A0, "Member 'WBP_Stat_C_ExecuteUbergraph_WBP_Stat::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat, CallFunc_Conv_DoubleToText_ReturnValue) == 0x0000A8, "Member 'WBP_Stat_C_ExecuteUbergraph_WBP_Stat::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat, CallFunc_FInterpTo_ReturnValue_1) == 0x0000C0, "Member 'WBP_Stat_C_ExecuteUbergraph_WBP_Stat::CallFunc_FInterpTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat, CallFunc_BreakVector2D_X) == 0x0000C8, "Member 'WBP_Stat_C_ExecuteUbergraph_WBP_Stat::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat, CallFunc_BreakVector2D_Y) == 0x0000D0, "Member 'WBP_Stat_C_ExecuteUbergraph_WBP_Stat::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat, CallFunc_FInterpTo_ReturnValue_2) == 0x0000D8, "Member 'WBP_Stat_C_ExecuteUbergraph_WBP_Stat::CallFunc_FInterpTo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat, CallFunc_MakeVector2D_ReturnValue) == 0x0000E0, "Member 'WBP_Stat_C_ExecuteUbergraph_WBP_Stat::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat, CallFunc_FInterpTo_DeltaTime_ImplicitCast) == 0x0000F0, "Member 'WBP_Stat_C_ExecuteUbergraph_WBP_Stat::CallFunc_FInterpTo_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat, CallFunc_FInterpTo_DeltaTime_ImplicitCast_1) == 0x0000F8, "Member 'WBP_Stat_C_ExecuteUbergraph_WBP_Stat::CallFunc_FInterpTo_DeltaTime_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat, CallFunc_FInterpTo_DeltaTime_ImplicitCast_2) == 0x000100, "Member 'WBP_Stat_C_ExecuteUbergraph_WBP_Stat::CallFunc_FInterpTo_DeltaTime_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat, CallFunc_LinearColorLerp_Alpha_ImplicitCast) == 0x000108, "Member 'WBP_Stat_C_ExecuteUbergraph_WBP_Stat::CallFunc_LinearColorLerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat, CallFunc_FloatSpringInterp_Target_ImplicitCast) == 0x00010C, "Member 'WBP_Stat_C_ExecuteUbergraph_WBP_Stat::CallFunc_FloatSpringInterp_Target_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat, CallFunc_FInterpTo_Current_ImplicitCast) == 0x000110, "Member 'WBP_Stat_C_ExecuteUbergraph_WBP_Stat::CallFunc_FInterpTo_Current_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast) == 0x000118, "Member 'WBP_Stat_C_ExecuteUbergraph_WBP_Stat::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat, CallFunc_FInterpTo_Current_ImplicitCast_1) == 0x000120, "Member 'WBP_Stat_C_ExecuteUbergraph_WBP_Stat::CallFunc_FInterpTo_Current_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_Stat_C_ExecuteUbergraph_WBP_Stat, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000128, "Member 'WBP_Stat_C_ExecuteUbergraph_WBP_Stat::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

}

