#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ItemHintIcon

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_ItemHintIcon.WBP_ItemHintIcon_C.ExecuteUbergraph_WBP_ItemHintIcon
// 0x0018 (0x0018 - 0x0000)
struct WBP_ItemHintIcon_C_ExecuteUbergraph_WBP_ItemHintIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2263[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemHintIcon_C_ExecuteUbergraph_WBP_ItemHintIcon) == 0x000008, "Wrong alignment on WBP_ItemHintIcon_C_ExecuteUbergraph_WBP_ItemHintIcon");
static_assert(sizeof(WBP_ItemHintIcon_C_ExecuteUbergraph_WBP_ItemHintIcon) == 0x000018, "Wrong size on WBP_ItemHintIcon_C_ExecuteUbergraph_WBP_ItemHintIcon");
static_assert(offsetof(WBP_ItemHintIcon_C_ExecuteUbergraph_WBP_ItemHintIcon, EntryPoint) == 0x000000, "Member 'WBP_ItemHintIcon_C_ExecuteUbergraph_WBP_ItemHintIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ItemHintIcon_C_ExecuteUbergraph_WBP_ItemHintIcon, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'WBP_ItemHintIcon_C_ExecuteUbergraph_WBP_ItemHintIcon::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ItemHintIcon_C_ExecuteUbergraph_WBP_ItemHintIcon, Temp_bool_IsClosed_Variable) == 0x000005, "Member 'WBP_ItemHintIcon_C_ExecuteUbergraph_WBP_ItemHintIcon::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ItemHintIcon_C_ExecuteUbergraph_WBP_ItemHintIcon, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'WBP_ItemHintIcon_C_ExecuteUbergraph_WBP_ItemHintIcon::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemHintIcon_C_ExecuteUbergraph_WBP_ItemHintIcon, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'WBP_ItemHintIcon_C_ExecuteUbergraph_WBP_ItemHintIcon::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

}

