#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DialogBox

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_DialogBox.WBP_DialogBox_C.ExecuteUbergraph_WBP_DialogBox
// 0x0028 (0x0028 - 0x0000)
struct WBP_DialogBox_C_ExecuteUbergraph_WBP_DialogBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2977[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClickableText_C*                       K2Node_ComponentBoundEvent_Text_1;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UClickableText_C*                       K2Node_ComponentBoundEvent_Text;                   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DialogBox_C_ExecuteUbergraph_WBP_DialogBox) == 0x000008, "Wrong alignment on WBP_DialogBox_C_ExecuteUbergraph_WBP_DialogBox");
static_assert(sizeof(WBP_DialogBox_C_ExecuteUbergraph_WBP_DialogBox) == 0x000028, "Wrong size on WBP_DialogBox_C_ExecuteUbergraph_WBP_DialogBox");
static_assert(offsetof(WBP_DialogBox_C_ExecuteUbergraph_WBP_DialogBox, EntryPoint) == 0x000000, "Member 'WBP_DialogBox_C_ExecuteUbergraph_WBP_DialogBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DialogBox_C_ExecuteUbergraph_WBP_DialogBox, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'WBP_DialogBox_C_ExecuteUbergraph_WBP_DialogBox::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DialogBox_C_ExecuteUbergraph_WBP_DialogBox, Temp_bool_IsClosed_Variable) == 0x000005, "Member 'WBP_DialogBox_C_ExecuteUbergraph_WBP_DialogBox::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DialogBox_C_ExecuteUbergraph_WBP_DialogBox, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'WBP_DialogBox_C_ExecuteUbergraph_WBP_DialogBox::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogBox_C_ExecuteUbergraph_WBP_DialogBox, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000010, "Member 'WBP_DialogBox_C_ExecuteUbergraph_WBP_DialogBox::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogBox_C_ExecuteUbergraph_WBP_DialogBox, K2Node_ComponentBoundEvent_Text_1) == 0x000018, "Member 'WBP_DialogBox_C_ExecuteUbergraph_WBP_DialogBox::K2Node_ComponentBoundEvent_Text_1' has a wrong offset!");
static_assert(offsetof(WBP_DialogBox_C_ExecuteUbergraph_WBP_DialogBox, K2Node_ComponentBoundEvent_Text) == 0x000020, "Member 'WBP_DialogBox_C_ExecuteUbergraph_WBP_DialogBox::K2Node_ComponentBoundEvent_Text' has a wrong offset!");

// Function WBP_DialogBox.WBP_DialogBox_C.BndEvt__WBP_DialogBox_Option2_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_DialogBox_C_BndEvt__WBP_DialogBox_Option2_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature final
{
public:
	class UClickableText_C*                       Text;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DialogBox_C_BndEvt__WBP_DialogBox_Option2_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature) == 0x000008, "Wrong alignment on WBP_DialogBox_C_BndEvt__WBP_DialogBox_Option2_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature");
static_assert(sizeof(WBP_DialogBox_C_BndEvt__WBP_DialogBox_Option2_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature) == 0x000008, "Wrong size on WBP_DialogBox_C_BndEvt__WBP_DialogBox_Option2_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature");
static_assert(offsetof(WBP_DialogBox_C_BndEvt__WBP_DialogBox_Option2_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature, Text) == 0x000000, "Member 'WBP_DialogBox_C_BndEvt__WBP_DialogBox_Option2_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature::Text' has a wrong offset!");

// Function WBP_DialogBox.WBP_DialogBox_C.BndEvt__WBP_DialogBox_Option1_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_DialogBox_C_BndEvt__WBP_DialogBox_Option1_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature final
{
public:
	class UClickableText_C*                       Text;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DialogBox_C_BndEvt__WBP_DialogBox_Option1_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature) == 0x000008, "Wrong alignment on WBP_DialogBox_C_BndEvt__WBP_DialogBox_Option1_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature");
static_assert(sizeof(WBP_DialogBox_C_BndEvt__WBP_DialogBox_Option1_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature) == 0x000008, "Wrong size on WBP_DialogBox_C_BndEvt__WBP_DialogBox_Option1_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature");
static_assert(offsetof(WBP_DialogBox_C_BndEvt__WBP_DialogBox_Option1_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature, Text) == 0x000000, "Member 'WBP_DialogBox_C_BndEvt__WBP_DialogBox_Option1_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature::Text' has a wrong offset!");

}

