#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GameCanvas

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GameCanvas.WBP_GameCanvas_C
// 0x0158 (0x03D0 - 0x0278)
class UWBP_GameCanvas_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NewAnimation;                                      // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       StartAnimation;                                    // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CircularInteraction;                               // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Crosshair;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DevText1;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DevText1_1;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DevText1_2;                                        // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DevText1_3;                                        // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_132;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClickableText_C*                       MenuButton;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           MenuCanvas;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           NotificationBox;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClickableText_C*                       ResumeButton;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClickableText_C*                       ResumeButton_1;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClickableText_C*                       SettingsButton;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStackBox*                              StackBox_0;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStackBox*                              StackBox_2;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_0;                                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_1;                                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_2;                                       // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_3;                                       // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_5;                                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_6;                                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FPSGraph_C*                        WBP_FPSGraph;                                      // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SettingsWidget_C*                  WBP_SettingsWidget;                                // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_98;                                 // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_Player_C*                           As_BP_Player;                                      // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Index_WBP_GameCanvas_C;                            // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Menu;                                              // 0x0371(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_255A[0x6];                                     // 0x0372(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   InteractDisplayName;                               // 0x0378(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          ShowCrosshairPlate;                                // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewVar;                                            // 0x0391(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_255B[0x6];                                     // 0x0392(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 Texture_Target;                                    // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          GameplayFeatures;                                  // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_255C[0x7];                                     // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_DialogBox_C*                       MenuDialog;                                        // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CircularShader;                                    // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        InteractionProgress;                               // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InteractionRadius;                                 // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CrosshairOpacity;                                  // 0x03C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UsabilityText();
	void UpdateProgressDev();
	void UpdateInteractionCircle();
	void UpdateDevTexts();
	void ToggleMenu();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void ReturnSecodnOption_Event();
	void ReturnFirstOption_Event();
	void RecastPlayer();
	void PlayerTimerCheckDelayInteract();
	void MenuVisibilityController();
	void GetComponentsByTags(class ABP_CoreInteractable_C* Actor, TArray<class FName>& Tags, TArray<class UActorComponent*>* Components);
	void ExecuteUbergraph_WBP_GameCanvas(int32 EntryPoint);
	void Construct();
	void ComponentToText(class ABP_CoreInteractable_C* Actor, class UActorComponent* ActorComponent, class FText* Text, bool* Return);
	void CloseMenu();
	void CheckItem();
	void Check_Usability();
	void BndEvt__WBP_GameCanvas_SettingsButton_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature(class UClickableText_C* Text);
	void BndEvt__WBP_GameCanvas_ResumeButton_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature(class UClickableText_C* Text);
	void BndEvt__WBP_GameCanvas_ResumeButton_1_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature(class UClickableText_C* Text);
	void BndEvt__WBP_GameCanvas_MenuButton_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature(class UClickableText_C* Text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GameCanvas_C">();
	}
	static class UWBP_GameCanvas_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GameCanvas_C>();
	}
};
static_assert(alignof(UWBP_GameCanvas_C) == 0x000008, "Wrong alignment on UWBP_GameCanvas_C");
static_assert(sizeof(UWBP_GameCanvas_C) == 0x0003D0, "Wrong size on UWBP_GameCanvas_C");
static_assert(offsetof(UWBP_GameCanvas_C, UberGraphFrame) == 0x000278, "Member 'UWBP_GameCanvas_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GameCanvas_C, NewAnimation) == 0x000280, "Member 'UWBP_GameCanvas_C::NewAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_GameCanvas_C, StartAnimation) == 0x000288, "Member 'UWBP_GameCanvas_C::StartAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_GameCanvas_C, CircularInteraction) == 0x000290, "Member 'UWBP_GameCanvas_C::CircularInteraction' has a wrong offset!");
static_assert(offsetof(UWBP_GameCanvas_C, Crosshair) == 0x000298, "Member 'UWBP_GameCanvas_C::Crosshair' has a wrong offset!");
static_assert(offsetof(UWBP_GameCanvas_C, DevText1) == 0x0002A0, "Member 'UWBP_GameCanvas_C::DevText1' has a wrong offset!");
static_assert(offsetof(UWBP_GameCanvas_C, DevText1_1) == 0x0002A8, "Member 'UWBP_GameCanvas_C::DevText1_1' has a wrong offset!");
static_assert(offsetof(UWBP_GameCanvas_C, DevText1_2) == 0x0002B0, "Member 'UWBP_GameCanvas_C::DevText1_2' has a wrong offset!");
static_assert(offsetof(UWBP_GameCanvas_C, DevText1_3) == 0x0002B8, "Member 'UWBP_GameCanvas_C::DevText1_3' has a wrong offset!");
static_assert(offsetof(UWBP_GameCanvas_C, Image_0) == 0x0002C0, "Member 'UWBP_GameCanvas_C::Image_0' has a wrong offset!");
static_assert(offsetof(UWBP_GameCanvas_C, Image_1) == 0x0002C8, "Member 'UWBP_GameCanvas_C::Image_1' has a wrong offset!");
static_assert(offsetof(UWBP_GameCanvas_C, Image_132) == 0x0002D0, "Member 'UWBP_GameCanvas_C::Image_132' has a wrong offset!");
static_assert(offsetof(UWBP_GameCanvas_C, MenuButton) == 0x0002D8, "Member 'UWBP_GameCanvas_C::MenuButton' has a wrong offset!");
static_assert(offsetof(UWBP_GameCanvas_C, MenuCanvas) == 0x0002E0, "Member 'UWBP_GameCanvas_C::MenuCanvas' has a wrong offset!");
static_assert(offsetof(UWBP_GameCanvas_C, NotificationBox) == 0x0002E8, "Member 'UWBP_GameCanvas_C::NotificationBox' has a wrong offset!");
static_assert(offsetof(UWBP_GameCanvas_C, ResumeButton) == 0x0002F0, "Member 'UWBP_GameCanvas_C::ResumeButton' has a wrong offset!");
static_assert(offsetof(UWBP_GameCanvas_C, ResumeButton_1) == 0x0002F8, "Member 'UWBP_GameCanvas_C::ResumeButton_1' has a wrong offset!");
static_assert(offsetof(UWBP_GameCanvas_C, SettingsButton) == 0x000300, "Member 'UWBP_GameCanvas_C::SettingsButton' has a wrong offset!");
static_assert(offsetof(UWBP_GameCanvas_C, StackBox_0) == 0x000308, "Member 'UWBP_GameCanvas_C::StackBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_GameCanvas_C, StackBox_2) == 0x000310, "Member 'UWBP_GameCanvas_C::StackBox_2' has a wrong offset!");
static_assert(offsetof(UWBP_GameCanvas_C, TextBlock) == 0x000318, "Member 'UWBP_GameCanvas_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_GameCanvas_C, TextBlock_0) == 0x000320, "Member 'UWBP_GameCanvas_C::TextBlock_0' has a wrong offset!");
static_assert(offsetof(UWBP_GameCanvas_C, TextBlock_1) == 0x000328, "Member 'UWBP_GameCanvas_C::TextBlock_1' has a wrong offset!");
static_assert(offsetof(UWBP_GameCanvas_C, TextBlock_2) == 0x000330, "Member 'UWBP_GameCanvas_C::TextBlock_2' has a wrong offset!");
static_assert(offsetof(UWBP_GameCanvas_C, TextBlock_3) == 0x000338, "Member 'UWBP_GameCanvas_C::TextBlock_3' has a wrong offset!");
static_assert(offsetof(UWBP_GameCanvas_C, TextBlock_5) == 0x000340, "Member 'UWBP_GameCanvas_C::TextBlock_5' has a wrong offset!");
static_assert(offsetof(UWBP_GameCanvas_C, TextBlock_6) == 0x000348, "Member 'UWBP_GameCanvas_C::TextBlock_6' has a wrong offset!");
static_assert(offsetof(UWBP_GameCanvas_C, WBP_FPSGraph) == 0x000350, "Member 'UWBP_GameCanvas_C::WBP_FPSGraph' has a wrong offset!");
static_assert(offsetof(UWBP_GameCanvas_C, WBP_SettingsWidget) == 0x000358, "Member 'UWBP_GameCanvas_C::WBP_SettingsWidget' has a wrong offset!");
static_assert(offsetof(UWBP_GameCanvas_C, WidgetSwitcher_98) == 0x000360, "Member 'UWBP_GameCanvas_C::WidgetSwitcher_98' has a wrong offset!");
static_assert(offsetof(UWBP_GameCanvas_C, As_BP_Player) == 0x000368, "Member 'UWBP_GameCanvas_C::As_BP_Player' has a wrong offset!");
static_assert(offsetof(UWBP_GameCanvas_C, Index_WBP_GameCanvas_C) == 0x000370, "Member 'UWBP_GameCanvas_C::Index_WBP_GameCanvas_C' has a wrong offset!");
static_assert(offsetof(UWBP_GameCanvas_C, Menu) == 0x000371, "Member 'UWBP_GameCanvas_C::Menu' has a wrong offset!");
static_assert(offsetof(UWBP_GameCanvas_C, InteractDisplayName) == 0x000378, "Member 'UWBP_GameCanvas_C::InteractDisplayName' has a wrong offset!");
static_assert(offsetof(UWBP_GameCanvas_C, ShowCrosshairPlate) == 0x000390, "Member 'UWBP_GameCanvas_C::ShowCrosshairPlate' has a wrong offset!");
static_assert(offsetof(UWBP_GameCanvas_C, NewVar) == 0x000391, "Member 'UWBP_GameCanvas_C::NewVar' has a wrong offset!");
static_assert(offsetof(UWBP_GameCanvas_C, Texture_Target) == 0x000398, "Member 'UWBP_GameCanvas_C::Texture_Target' has a wrong offset!");
static_assert(offsetof(UWBP_GameCanvas_C, GameplayFeatures) == 0x0003A0, "Member 'UWBP_GameCanvas_C::GameplayFeatures' has a wrong offset!");
static_assert(offsetof(UWBP_GameCanvas_C, MenuDialog) == 0x0003A8, "Member 'UWBP_GameCanvas_C::MenuDialog' has a wrong offset!");
static_assert(offsetof(UWBP_GameCanvas_C, CircularShader) == 0x0003B0, "Member 'UWBP_GameCanvas_C::CircularShader' has a wrong offset!");
static_assert(offsetof(UWBP_GameCanvas_C, InteractionProgress) == 0x0003B8, "Member 'UWBP_GameCanvas_C::InteractionProgress' has a wrong offset!");
static_assert(offsetof(UWBP_GameCanvas_C, InteractionRadius) == 0x0003C0, "Member 'UWBP_GameCanvas_C::InteractionRadius' has a wrong offset!");
static_assert(offsetof(UWBP_GameCanvas_C, CrosshairOpacity) == 0x0003C8, "Member 'UWBP_GameCanvas_C::CrosshairOpacity' has a wrong offset!");

}

