#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_rec_effect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_rec_effect.WBP_rec_effect_C
// 0x0110 (0x0388 - 0x0278)
class UWBP_rec_effect_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ConstructAnim;                                     // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_1;                                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Decrease_zoom;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Decrease_zoom_1;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_206;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Increase_zoom;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Increase_zoom_1;                                   // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 L_DOWN_1;                                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 L_Down_Border;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           L_DOWN_Effect;                                     // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 L_UP_1;                                            // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 L_UP_Border;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           L_UP_Effect;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 R_Down;                                            // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 R_Down_1;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           R_DOWN_Effect;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 R_UP;                                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 R_UP_1;                                            // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           R_UP_Effect;                                       // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RecTime;                                           // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_0;                                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_3;                                     // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                                Slider_0;                                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_1;                                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        Zoom;                                              // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        Ui_shake;                                          // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Rec_effect_shakeness;                              // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                As_BP_Survival_PAWN;                               // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          AllCastsCompleted;                                 // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27F8[0x7];                                     // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                As_BP_Backrooms_PC;                                // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UObject*                                As_BP_Backrooms_GM;                                // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCineCameraComponent*                   CineCamera;                                        // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void SliderTextAnim();
	void Set_time();
	void Rec_zoom_effect();
	void Rec_effect_movement();
	void FPS_GraphAnim();
	void ExecuteUbergraph_WBP_rec_effect(int32 EntryPoint);
	void Construct();
	void BaseCasts();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_rec_effect_C">();
	}
	static class UWBP_rec_effect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_rec_effect_C>();
	}
};
static_assert(alignof(UWBP_rec_effect_C) == 0x000008, "Wrong alignment on UWBP_rec_effect_C");
static_assert(sizeof(UWBP_rec_effect_C) == 0x000388, "Wrong size on UWBP_rec_effect_C");
static_assert(offsetof(UWBP_rec_effect_C, UberGraphFrame) == 0x000278, "Member 'UWBP_rec_effect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_rec_effect_C, ConstructAnim) == 0x000280, "Member 'UWBP_rec_effect_C::ConstructAnim' has a wrong offset!");
static_assert(offsetof(UWBP_rec_effect_C, CanvasPanel_1) == 0x000288, "Member 'UWBP_rec_effect_C::CanvasPanel_1' has a wrong offset!");
static_assert(offsetof(UWBP_rec_effect_C, Decrease_zoom) == 0x000290, "Member 'UWBP_rec_effect_C::Decrease_zoom' has a wrong offset!");
static_assert(offsetof(UWBP_rec_effect_C, Decrease_zoom_1) == 0x000298, "Member 'UWBP_rec_effect_C::Decrease_zoom_1' has a wrong offset!");
static_assert(offsetof(UWBP_rec_effect_C, Image_1) == 0x0002A0, "Member 'UWBP_rec_effect_C::Image_1' has a wrong offset!");
static_assert(offsetof(UWBP_rec_effect_C, Image_206) == 0x0002A8, "Member 'UWBP_rec_effect_C::Image_206' has a wrong offset!");
static_assert(offsetof(UWBP_rec_effect_C, Increase_zoom) == 0x0002B0, "Member 'UWBP_rec_effect_C::Increase_zoom' has a wrong offset!");
static_assert(offsetof(UWBP_rec_effect_C, Increase_zoom_1) == 0x0002B8, "Member 'UWBP_rec_effect_C::Increase_zoom_1' has a wrong offset!");
static_assert(offsetof(UWBP_rec_effect_C, L_DOWN_1) == 0x0002C0, "Member 'UWBP_rec_effect_C::L_DOWN_1' has a wrong offset!");
static_assert(offsetof(UWBP_rec_effect_C, L_Down_Border) == 0x0002C8, "Member 'UWBP_rec_effect_C::L_Down_Border' has a wrong offset!");
static_assert(offsetof(UWBP_rec_effect_C, L_DOWN_Effect) == 0x0002D0, "Member 'UWBP_rec_effect_C::L_DOWN_Effect' has a wrong offset!");
static_assert(offsetof(UWBP_rec_effect_C, L_UP_1) == 0x0002D8, "Member 'UWBP_rec_effect_C::L_UP_1' has a wrong offset!");
static_assert(offsetof(UWBP_rec_effect_C, L_UP_Border) == 0x0002E0, "Member 'UWBP_rec_effect_C::L_UP_Border' has a wrong offset!");
static_assert(offsetof(UWBP_rec_effect_C, L_UP_Effect) == 0x0002E8, "Member 'UWBP_rec_effect_C::L_UP_Effect' has a wrong offset!");
static_assert(offsetof(UWBP_rec_effect_C, R_Down) == 0x0002F0, "Member 'UWBP_rec_effect_C::R_Down' has a wrong offset!");
static_assert(offsetof(UWBP_rec_effect_C, R_Down_1) == 0x0002F8, "Member 'UWBP_rec_effect_C::R_Down_1' has a wrong offset!");
static_assert(offsetof(UWBP_rec_effect_C, R_DOWN_Effect) == 0x000300, "Member 'UWBP_rec_effect_C::R_DOWN_Effect' has a wrong offset!");
static_assert(offsetof(UWBP_rec_effect_C, R_UP) == 0x000308, "Member 'UWBP_rec_effect_C::R_UP' has a wrong offset!");
static_assert(offsetof(UWBP_rec_effect_C, R_UP_1) == 0x000310, "Member 'UWBP_rec_effect_C::R_UP_1' has a wrong offset!");
static_assert(offsetof(UWBP_rec_effect_C, R_UP_Effect) == 0x000318, "Member 'UWBP_rec_effect_C::R_UP_Effect' has a wrong offset!");
static_assert(offsetof(UWBP_rec_effect_C, RecTime) == 0x000320, "Member 'UWBP_rec_effect_C::RecTime' has a wrong offset!");
static_assert(offsetof(UWBP_rec_effect_C, RetainerBox_0) == 0x000328, "Member 'UWBP_rec_effect_C::RetainerBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_rec_effect_C, RetainerBox_3) == 0x000330, "Member 'UWBP_rec_effect_C::RetainerBox_3' has a wrong offset!");
static_assert(offsetof(UWBP_rec_effect_C, Slider_0) == 0x000338, "Member 'UWBP_rec_effect_C::Slider_0' has a wrong offset!");
static_assert(offsetof(UWBP_rec_effect_C, TextBlock_1) == 0x000340, "Member 'UWBP_rec_effect_C::TextBlock_1' has a wrong offset!");
static_assert(offsetof(UWBP_rec_effect_C, Zoom) == 0x000348, "Member 'UWBP_rec_effect_C::Zoom' has a wrong offset!");
static_assert(offsetof(UWBP_rec_effect_C, Ui_shake) == 0x000350, "Member 'UWBP_rec_effect_C::Ui_shake' has a wrong offset!");
static_assert(offsetof(UWBP_rec_effect_C, Rec_effect_shakeness) == 0x000358, "Member 'UWBP_rec_effect_C::Rec_effect_shakeness' has a wrong offset!");
static_assert(offsetof(UWBP_rec_effect_C, As_BP_Survival_PAWN) == 0x000360, "Member 'UWBP_rec_effect_C::As_BP_Survival_PAWN' has a wrong offset!");
static_assert(offsetof(UWBP_rec_effect_C, AllCastsCompleted) == 0x000368, "Member 'UWBP_rec_effect_C::AllCastsCompleted' has a wrong offset!");
static_assert(offsetof(UWBP_rec_effect_C, As_BP_Backrooms_PC) == 0x000370, "Member 'UWBP_rec_effect_C::As_BP_Backrooms_PC' has a wrong offset!");
static_assert(offsetof(UWBP_rec_effect_C, As_BP_Backrooms_GM) == 0x000378, "Member 'UWBP_rec_effect_C::As_BP_Backrooms_GM' has a wrong offset!");
static_assert(offsetof(UWBP_rec_effect_C, CineCamera) == 0x000380, "Member 'UWBP_rec_effect_C::CineCamera' has a wrong offset!");

}

