#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DebugString

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DebugString.WBP_DebugString_C
// 0x0048 (0x02C0 - 0x0278)
class UWBP_DebugString_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_275;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 String;                                            // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          PrintToLog;                                        // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_29DD[0x3];                                     // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Text_Color;                                        // 0x02A4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_29DE[0x4];                                     // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Duration;                                          // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_DebugString(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DebugString_C">();
	}
	static class UWBP_DebugString_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DebugString_C>();
	}
};
static_assert(alignof(UWBP_DebugString_C) == 0x000008, "Wrong alignment on UWBP_DebugString_C");
static_assert(sizeof(UWBP_DebugString_C) == 0x0002C0, "Wrong size on UWBP_DebugString_C");
static_assert(offsetof(UWBP_DebugString_C, UberGraphFrame) == 0x000278, "Member 'UWBP_DebugString_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DebugString_C, Image_275) == 0x000280, "Member 'UWBP_DebugString_C::Image_275' has a wrong offset!");
static_assert(offsetof(UWBP_DebugString_C, TextBlock) == 0x000288, "Member 'UWBP_DebugString_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_DebugString_C, String) == 0x000290, "Member 'UWBP_DebugString_C::String' has a wrong offset!");
static_assert(offsetof(UWBP_DebugString_C, PrintToLog) == 0x0002A0, "Member 'UWBP_DebugString_C::PrintToLog' has a wrong offset!");
static_assert(offsetof(UWBP_DebugString_C, Text_Color) == 0x0002A4, "Member 'UWBP_DebugString_C::Text_Color' has a wrong offset!");
static_assert(offsetof(UWBP_DebugString_C, Duration) == 0x0002B8, "Member 'UWBP_DebugString_C::Duration' has a wrong offset!");

}

